----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2022.10.05-09.08.28.log.txt
  log type:  text
 opened on:   5 Oct 2022, 09:08:28

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  5 Oct 2022 09:08:28

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmat
> apostest;lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx
>  yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *----------------------------------------------------------------------
. gen leader_present = 0

. replace leader_present = 1 if leader_female_vill == 1 & leader_male_vill==0
(11 real changes made)

. replace leader_present = 2 if leader_female_vill == 0 & leader_male_vill==1
(17 real changes made)

. replace leader_present = 3 if leader_female_vill == 1 & leader_male_vill==1
(2 real changes made)

. replace leader_present = . if treatment==0
(27 real changes made, 27 to missing)

. lab def leader_lab 0 "None" 1 "Female" 2 "Male" 3 "Both", replace

. lab val leader_present leader_lab

. tab leader_present, gen(leader_)

leader_pres |
        ent |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |         26       46.43       46.43
     Female |         11       19.64       66.07
       Male |         17       30.36       96.43
       Both |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

. 
. gen leader_present2 = 0 if leader_present==0
(57 missing values generated)

. replace leader_present2 = 1 if leader_present==2
(17 real changes made)

. replace leader_present2 = 2 if leader_present==1 | leader_present==3
(13 real changes made)

. lab def leader_lab2 0 "None" 1 "Only male" 2 "Only female or both", replace

. lab val leader_present2 leader_lab2

. tab leader_present2, gen(leader2_)

    leader_present2 |      Freq.     Percent        Cum.
--------------------+-----------------------------------
               None |         26       46.43       46.43
          Only male |         17       30.36       76.79
Only female or both |         13       23.21      100.00
--------------------+-----------------------------------
              Total |         56      100.00

. 
. gen share_female_percent2 = share_no_leader_female_vill*100
(27 missing values generated)

. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new 
. global session_composition      share_female_percent2 leader2_2 leader2_3 d_illiterate
. global ingame_behavior          total_com_male total_com_female game_almost_opt_invest_r9_10
. global facilitation                     game_lead_facil count_intervention come_back_dummy com_outside_game             
. program error:  matching close brace not found
r(198);

end of do-file

r(198);
. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg fs_maintenance_12m_new bs_maintenance_12m_new $control i.FES_site##c.share_female_percent2 leader2_2 leader2_3 d_illiterate, robus
> t
note: 1.FES_site omitted because of collinearity

Linear regression                               Number of obs     =         56
                                                F(11, 44)         =       1.53
                                                Prob > F          =     0.1565
                                                R-squared         =     0.2237
                                                Root MSE          =     .44018

--------------------------------------------------------------------------------------------------
                                 |               Robust
          fs_maintenance_12m_new |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
          bs_maintenance_12m_new |   -.012116   .1404724    -0.09   0.932    -.2952194    .2709874
                           No_HH |   .0006899   .0007845     0.88   0.384    -.0008913     .002271
                        FES_site |   .4555829   .2491841     1.83   0.074    -.0466147    .9577805
                        Shar_Lit |   .0067917   .0080595     0.84   0.404    -.0094512    .0230345
                       Shar_SCST |   -.001186   .0048651    -0.24   0.809    -.0109909    .0086189
         fs_dam_used_farming_new |   .0897156   .1242686     0.72   0.474    -.1607313    .3401625
                                 |
                        FES_site |
                            yes  |          0  (omitted)
           share_female_percent2 |   .0108292   .0059406     1.82   0.075    -.0011433    .0228016
                                 |
FES_site#c.share_female_percent2 |
                            yes  |   -.006882   .0071553    -0.96   0.341    -.0213026    .0075386
                                 |
                       leader2_2 |   .0656788   .1705743     0.39   0.702     -.278091    .4094487
                       leader2_3 |  -.0500685   .1552329    -0.32   0.749    -.3629198    .2627828
                    d_illiterate |   .1214308    .119769     1.01   0.316    -.1199478    .3628094
                           _cons |  -.1947293   .7217845    -0.27   0.789     -1.64939    1.259932
--------------------------------------------------------------------------------------------------

. 
end of do-file

. tab treatment FES_site

Identifier |
       for |
  villages |
     where |
games were |     BS FES_site_
   played. |        no        yes |     Total
-----------+----------------------+----------
   Control |        16         11 |        27 
     Games |        17         39 |        56 
-----------+----------------------+----------
     Total |        33         50 |        83 

. tab game_lead_facil

       Lead |
facilitator |
     during |
interventio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
    Shivraj |         47       83.93       83.93
      Radha |          9       16.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_lead_facil, nolab

       Lead |
facilitator |
     during |
interventio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         47       83.93       83.93
          1 |          9       16.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. pwcorr FES_site game_lead_facil

             | FES_site game_l~l
-------------+------------------
    FES_site |   1.0000 
game_lead_~l |  -0.2398   1.0000 

. pwcorr FES_site game_lead_facil, sig

             | FES_site game_l~l
-------------+------------------
    FES_site |   1.0000 
             |
             |
game_lead_~l |  -0.2398   1.0000 
             |   0.0750
             |

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *----------------------------------------------------------------------
. gen leader_present = 0

. replace leader_present = 1 if leader_female_vill == 1 & leader_male_vill==0
(11 real changes made)

. replace leader_present = 2 if leader_female_vill == 0 & leader_male_vill==1
(17 real changes made)

. replace leader_present = 3 if leader_female_vill == 1 & leader_male_vill==1
(2 real changes made)

. replace leader_present = . if treatment==0
(27 real changes made, 27 to missing)

. lab def leader_lab 0 "None" 1 "Female" 2 "Male" 3 "Both", replace

. lab val leader_present leader_lab

. tab leader_present, gen(leader_)

leader_pres |
        ent |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |         26       46.43       46.43
     Female |         11       19.64       66.07
       Male |         17       30.36       96.43
       Both |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

. 
. gen leader_present2 = 0 if leader_present==0
(57 missing values generated)

. replace leader_present2 = 1 if leader_present==2
(17 real changes made)

. replace leader_present2 = 2 if leader_present==1 | leader_present==3
(13 real changes made)

. lab def leader_lab2 0 "None" 1 "Only male" 2 "Only female or both", replace

. lab val leader_present2 leader_lab2

. tab leader_present2, gen(leader2_)

    leader_present2 |      Freq.     Percent        Cum.
--------------------+-----------------------------------
               None |         26       46.43       46.43
          Only male |         17       30.36       76.79
Only female or both |         13       23.21      100.00
--------------------+-----------------------------------
              Total |         56      100.00

. 
. gen share_female_percent2 = share_no_leader_female_vill*100
(27 missing values generated)

. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new 
. global session_composition      share_female_percent2 leader2_2 leader2_3 d_illiterate
. global ingame_behavior          total_com_male total_com_female game_almost_opt_invest_r9_10
. global facilitation                     count_intervention come_back_dummy com_outside_game             
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. pwcorr FES_site com_outside_game, sig

             | FES_site com_ou~e
-------------+------------------
    FES_site |   1.0000 
             |
             |
com_outsid~e |   0.2270   1.0000 
             |   0.0924
             |

. 
. 
end of do-file

. ttest com_outside_game, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
      no |      17    .1764706     .095305    .3929526    -.025567    .3785082
     yes |      39    .4102564    .0797935    .4983102    .2487229    .5717899
---------+--------------------------------------------------------------------
combined |      56    .3392857    .0638423    .4777518     .211343    .4672285
---------+--------------------------------------------------------------------
    diff |           -.2337858    .1364684               -.5073885    .0398169
------------------------------------------------------------------------------
    diff = mean(no) - mean(yes)                                   t =  -1.7131
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0462         Pr(|T| > |t|) = 0.0924          Pr(T > t) = 0.9538

. prtest com_outside_game, by(FES_site)

Two-sample test of proportions                    no: Number of obs =       17
                                                 yes: Number of obs =       39
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          no |   .1764706   .0924594                     -.0047466    .3576878
         yes |   .4102564   .0787639                      .2558821    .5646307
-------------+----------------------------------------------------------------
        diff |  -.2337858   .1214598                     -.4718427    .0042711
             |  under Ho:   .1376027    -1.70   0.089
------------------------------------------------------------------------------
        diff = prop(no) - prop(yes)                               z =  -1.6990
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0447         Pr(|Z| > |z|) = 0.0893          Pr(Z > z) = 0.9553

. bitest com_outside_game, by(FES_site)
=exp required
r(100);

. help bitest

. help prtest

. help prtest

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. prtest com_outside_game, by(FES_site)

Two-sample test of proportions                    no: Number of obs =       17
                                                 yes: Number of obs =       39
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          no |   .1764706   .0924594                     -.0047466    .3576878
         yes |   .4102564   .0787639                      .2558821    .5646307
-------------+----------------------------------------------------------------
        diff |  -.2337858   .1214598                     -.4718427    .0042711
             |  under Ho:   .1376027    -1.70   0.089
------------------------------------------------------------------------------
        diff = prop(no) - prop(yes)                               z =  -1.6990
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0447         Pr(|Z| > |z|) = 0.0893          Pr(Z > z) = 0.9553

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *Figure 1. Main effects
. *Panel A: Maintenance & Rules
. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new, robust

Iteration 0:   log pseudolikelihood = -53.058719  
Iteration 1:   log pseudolikelihood = -49.439039  
Iteration 2:   log pseudolikelihood = -49.428948  
Iteration 3:   log pseudolikelihood = -49.428947  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       6.68
                                                Prob > chi2       =     0.0354
Log pseudolikelihood = -49.428947               Pseudo R2         =     0.0684

----------------------------------------------------------------------------------------
                       |               Robust
fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .5686503   .3036249     1.87   0.061    -.0264436    1.163744
bs_maintenance_12m_new |   .5538217   .2943742     1.88   0.060     -.023141    1.130784
                 _cons |   -.238478   .2840203    -0.84   0.401    -.7951476    .3181915
----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new

----------------------------------------------------------------------------------------
                       |            Delta-method
                       |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .1929771   .0959755     2.01   0.044     .0048686    .3810855
bs_maintenance_12m_new |   .1879449   .0929958     2.02   0.043     .0056764    .3702133
----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2') adec(2) word dec(2) replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new $control, robust

Iteration 0:   log pseudolikelihood = -52.644113  
Iteration 1:   log pseudolikelihood = -45.117314  
Iteration 2:   log pseudolikelihood = -45.070712  
Iteration 3:   log pseudolikelihood =  -45.07068  
Iteration 4:   log pseudolikelihood =  -45.07068  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =      13.04
                                                Prob > chi2       =     0.0711
Log pseudolikelihood =  -45.07068               Pseudo R2         =     0.1439

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .6446241    .334522     1.93   0.054    -.0110269    1.300275
 bs_maintenance_12m_new |    .442477   .3158484     1.40   0.161    -.1765746    1.061529
                  No_HH |   .0000721   .0014733     0.05   0.961    -.0028155    .0029596
               FES_site |   .2549761   .3465333     0.74   0.462    -.4242168    .9341689
               Shar_Lit |   .0223016   .0197229     1.13   0.258    -.0163545    .0609578
              Shar_SCST |   -.020116   .0091652    -2.19   0.028    -.0380794   -.0021525
fs_dam_used_farming_new |  -.0427218   .3216812    -0.13   0.894    -.6732054    .5877618
                  _cons |   .0599992   1.473972     0.04   0.968    -2.828932    2.948931
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.47
         Prob > chi2 =    0.1320

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .2010772   .0958373     2.10   0.036     .0132395    .3889148
 bs_maintenance_12m_new |   .1380216   .0943051     1.46   0.143     -.046813    .3228561
                  No_HH |   .0000225   .0004597     0.05   0.961    -.0008785    .0009235
               FES_site |   .0795345   .1071444     0.74   0.458    -.1304646    .2895336
               Shar_Lit |   .0069565   .0060276     1.15   0.248    -.0048574    .0187705
              Shar_SCST |  -.0062748   .0026519    -2.37   0.018    -.0114724   -.0010771
fs_dam_used_farming_new |  -.0133262    .100369    -0.13   0.894    -.2100458    .1833934
-----------------------------------------------------------------------------------------

. est store main1

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new, robust

Iteration 0:   log pseudolikelihood = -51.599338  
Iteration 1:   log pseudolikelihood = -51.386211  
Iteration 2:   log pseudolikelihood = -51.386165  
Iteration 3:   log pseudolikelihood = -51.386165  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       0.43
                                                Prob > chi2       =     0.8079
Log pseudolikelihood = -51.386165               Pseudo R2         =     0.0041

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0828411   .3106302     0.27   0.790     -.525983    .6916651
bs_dam_maintenance_rule_new |    .237315   .3898897     0.61   0.543    -.5268548    1.001485
                      _cons |   -.581681    .266548    -2.18   0.029    -1.104105   -.0592565
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0292277   .1094712     0.27   0.789     -.185332    .2437874
bs_dam_maintenance_rule_new |   .0837286   .1366674     0.61   0.540    -.1841345    .3515918
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.858142  
Iteration 2:   log pseudolikelihood = -47.840102  
Iteration 3:   log pseudolikelihood = -47.840096  
Iteration 4:   log pseudolikelihood = -47.840096  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =       3.70
                                                Prob > chi2       =     0.8135
Log pseudolikelihood = -47.840096               Pseudo R2         =     0.0513

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .1317343   .3391044     0.39   0.698    -.5328982    .7963667
bs_dam_maintenance_rule_new |   .2178599   .4191106     0.52   0.603    -.6035818    1.039302
                      No_HH |  -.0022962    .001682    -1.37   0.172     -.005593    .0010005
                   FES_site |   .0929715   .3105338     0.30   0.765    -.5156636    .7016066
                   Shar_Lit |   .0006083   .0189441     0.03   0.974    -.0365214     .037738
                  Shar_SCST |  -.0041951   .0084126    -0.50   0.618    -.0206835    .0122934
    fs_dam_used_farming_new |  -.4083287   .3399753    -1.20   0.230    -1.074668    .2580106
                      _cons |   .1359511   1.307531     0.10   0.917    -2.426762    2.698664
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.52
         Prob > chi2 =    0.6201

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0438927   .1127663     0.39   0.697    -.1771253    .2649107
bs_dam_maintenance_rule_new |    .072589   .1385918     0.52   0.600    -.1990459     .344224
                      No_HH |  -.0007651   .0005388    -1.42   0.156    -.0018211     .000291
                   FES_site |   .0309773   .1029149     0.30   0.763    -.1707321    .2326867
                   Shar_Lit |   .0002027   .0063116     0.03   0.974    -.0121679    .0125733
                  Shar_SCST |  -.0013978   .0027801    -0.50   0.615    -.0068467    .0040511
    fs_dam_used_farming_new |  -.1360516   .1097955    -1.24   0.215    -.3512469    .0791437
---------------------------------------------------------------------------------------------

. est store main2

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention" FES_site = "NGO presence") xline(0, lpattern
> (dash) lcolor(gs3)) title("{bf:A } Treatment effects", span pos(11) size()) xtitle("Regression estimated impact relative to control vi
> llages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40
> ") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond
> (@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 
(note:  named style medthin not found in class linestyle, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. coefplot (main1) (main2),   keep(treatment FES_site)  coeflabels(treatment  = "Games Intervention" FES_site = "NGO presence") xline(0,
>  lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effects", span pos(11) size()) xtitle("Regression estimated impact relative to c
> ontrol villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "2
> 0" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "
> **", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. tab FES_Site
variable FES_Site not found
r(111);

. tab FES_site

         BS |
  FES_site_ |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |         33       39.76       39.76
        yes |         50       60.24      100.00
------------+-----------------------------------
      Total |         83      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. coefplot (main1) (main2),   keep(treatment FES_site)  coeflabels(treatment  = "Games Intervention" FES_site = "FES present") xline(0, 
> lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effects", span pos(11) size()) xtitle("Regression estimated impact relative to co
> ntrol villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20
> " .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "*
> *", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new $control $session_composition $ingame_behavior,  robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.157599  
Iteration 2:   log pseudolikelihood = -24.754696  
Iteration 3:   log pseudolikelihood = -24.749295  
Iteration 4:   log pseudolikelihood = -24.749291  
Iteration 5:   log pseudolikelihood = -24.749291  

Probit regression                               Number of obs     =         56
                                                Wald chi2(13)     =      16.04
                                                Prob > chi2       =     0.2470
Log pseudolikelihood = -24.749291               Pseudo R2         =     0.2395

----------------------------------------------------------------------------------------------
                             |               Robust
      fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |          0  (omitted)
      bs_maintenance_12m_new |   .0817371   .4430955     0.18   0.854    -.7867141    .9501883
                       No_HH |   .0027499   .0025144     1.09   0.274    -.0021782     .007678
                    FES_site |   .9693696   .4794995     2.02   0.043     .0295679    1.909171
                    Shar_Lit |   .0218811   .0273169     0.80   0.423     -.031659    .0754212
                   Shar_SCST |  -.0173331   .0169093    -1.03   0.305    -.0504746    .0158085
     fs_dam_used_farming_new |   .4979127   .3764454     1.32   0.186    -.2399066    1.235732
       share_female_percent2 |   .0198448   .0192813     1.03   0.303    -.0179458    .0576354
                   leader2_2 |   .1779419    .464937     0.38   0.702    -.7333179    1.089202
                   leader2_3 |  -.6340573    .575522    -1.10   0.271     -1.76206    .4939451
                d_illiterate |   .5099176   .4151962     1.23   0.219    -.3038519    1.323687
              total_com_male |  -.0110422   .0078182    -1.41   0.158    -.0263655    .0042811
            total_com_female |   .0116908   .0163567     0.71   0.475    -.0203677    .0437493
game_almost_opt_invest_r9_10 |   .4342964   .6171235     0.70   0.482    -.7752434    1.643836
                       _cons |  -.6478533   2.429208    -0.27   0.790    -5.409013    4.113306
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2') adec(2) word dec(2) replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
end of do-file

. tab d_illiterate

d_illiterat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       58.93       58.93
          1 |         23       41.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. global control                          No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new 

. global session_composition      share_female_percent2 leader2_2 leader2_3 d_illiterate

. }
} is not a valid command name
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *Panel B: Determinants of Maintenance & Rules in treatment villages
. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control ,  robust

Iteration 0:   log pseudolikelihood = -52.644113  
Iteration 1:   log pseudolikelihood =  -46.94723  
Iteration 2:   log pseudolikelihood = -46.903718  
Iteration 3:   log pseudolikelihood = -46.903703  
Iteration 4:   log pseudolikelihood = -46.903703  

Probit regression                               Number of obs     =         82
                                                Wald chi2(6)      =      12.18
                                                Prob > chi2       =     0.0580
Log pseudolikelihood = -46.903703               Pseudo R2         =     0.1090

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .4507743   .3114225     1.45   0.148    -.1596026    1.061151
                  No_HH |   -.000188   .0015535    -0.12   0.904    -.0032327    .0028567
               FES_site |   .3916165   .3366065     1.16   0.245    -.2681202    1.051353
               Shar_Lit |   .0203954   .0192344     1.06   0.289    -.0173033    .0580942
              Shar_SCST |   -.020391   .0091444    -2.23   0.026    -.0383137   -.0024682
fs_dam_used_farming_new |   .0273001   .3125733     0.09   0.930    -.5853323    .6399324
                  _cons |   .5423385   1.424731     0.38   0.703    -2.250082    3.334759
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.930422  
Iteration 2:   log pseudolikelihood = -47.916021  
Iteration 3:   log pseudolikelihood = -47.916019  

Probit regression                               Number of obs     =         82
                                                Wald chi2(6)      =       3.45
                                                Prob > chi2       =     0.7505
Log pseudolikelihood = -47.916019               Pseudo R2         =     0.0498

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .2172909    .417357     0.52   0.603    -.6007139    1.035296
                      No_HH |  -.0022857    .001671    -1.37   0.171    -.0055608    .0009894
                   FES_site |    .127537   .3095946     0.41   0.680    -.4792572    .7343311
                   Shar_Lit |   .0003095   .0189099     0.02   0.987    -.0367532    .0373722
                  Shar_SCST |  -.0042573   .0084262    -0.51   0.613    -.0207723    .0122578
    fs_dam_used_farming_new |  -.3904179   .3327213    -1.17   0.241     -1.04254    .2617038
                      _cons |   .2176365   1.285065     0.17   0.866    -2.301045    2.736318
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *Panel B: Determinants of Maintenance & Rules in treatment villages
. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    5.69
         Prob > chi2 =    0.3372

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0155107   .1128008     0.14   0.891    -.2055747    .2365962
                  No_HH |   .0006364    .000667     0.95   0.340     -.000671    .0019437
               FES_site |   .2535619   .1190204     2.13   0.033     .0202863    .4868375
               Shar_Lit |   .0104802   .0073445     1.43   0.154    -.0039148    .0248753
              Shar_SCST |  -.0013654   .0032785    -0.42   0.677    -.0077912    .0050604
fs_dam_used_farming_new |   .0739168   .1125436     0.66   0.511    -.1466646    .2944981
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) rep
> lace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. est store panelB1

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.930422  
Iteration 2:   log pseudolikelihood = -47.916021  
Iteration 3:   log pseudolikelihood = -47.916019  

Probit regression                               Number of obs     =         82
                                                Wald chi2(6)      =       3.45
                                                Prob > chi2       =     0.7505
Log pseudolikelihood = -47.916019               Pseudo R2         =     0.0498

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .2172909    .417357     0.52   0.603    -.6007139    1.035296
                      No_HH |  -.0022857    .001671    -1.37   0.171    -.0055608    .0009894
                   FES_site |    .127537   .3095946     0.41   0.680    -.4792572    .7343311
                   Shar_Lit |   .0003095   .0189099     0.02   0.987    -.0367532    .0373722
                  Shar_SCST |  -.0042573   .0084262    -0.51   0.613    -.0207723    .0122578
    fs_dam_used_farming_new |  -.3904179   .3327213    -1.17   0.241     -1.04254    .2617038
                      _cons |   .2176365   1.285065     0.17   0.866    -2.301045    2.736318
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.44
         Prob > chi2 =    0.6321

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .0725061   .1381831     0.52   0.600    -.1983279    .3433401
                      No_HH |  -.0007627   .0005347    -1.43   0.154    -.0018107    .0002853
                   FES_site |   .0425568   .1025562     0.41   0.678    -.1584496    .2435632
                   Shar_Lit |   .0001033   .0063097     0.02   0.987    -.0122636    .0124701
                  Shar_SCST |  -.0014206   .0027891    -0.51   0.611     -.006887    .0040459
    fs_dam_used_farming_new |  -.1302755   .1077923    -1.21   0.227    -.3415446    .0809935
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2
               leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-
unmatched quote
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    5.69
         Prob > chi2 =    0.3372

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0155107   .1128008     0.14   0.891    -.2055747    .2365962
                  No_HH |   .0006364    .000667     0.95   0.340     -.000671    .0019437
               FES_site |   .2535619   .1190204     2.13   0.033     .0202863    .4868375
               Shar_Lit |   .0104802   .0073445     1.43   0.154    -.0039148    .0248753
              Shar_SCST |  -.0013654   .0032785    -0.42   0.677    -.0077912    .0050604
fs_dam_used_farming_new |   .0739168   .1125436     0.66   0.511    -.1466646    .2944981
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) rep
> lace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. est store panelB1

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.930422  
Iteration 2:   log pseudolikelihood = -47.916021  
Iteration 3:   log pseudolikelihood = -47.916019  

Probit regression                               Number of obs     =         82
                                                Wald chi2(6)      =       3.45
                                                Prob > chi2       =     0.7505
Log pseudolikelihood = -47.916019               Pseudo R2         =     0.0498

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .2172909    .417357     0.52   0.603    -.6007139    1.035296
                      No_HH |  -.0022857    .001671    -1.37   0.171    -.0055608    .0009894
                   FES_site |    .127537   .3095946     0.41   0.680    -.4792572    .7343311
                   Shar_Lit |   .0003095   .0189099     0.02   0.987    -.0367532    .0373722
                  Shar_SCST |  -.0042573   .0084262    -0.51   0.613    -.0207723    .0122578
    fs_dam_used_farming_new |  -.3904179   .3327213    -1.17   0.241     -1.04254    .2617038
                      _cons |   .2176365   1.285065     0.17   0.866    -2.301045    2.736318
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.44
         Prob > chi2 =    0.6321

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .0725061   .1381831     0.52   0.600    -.1983279    .3433401
                      No_HH |  -.0007627   .0005347    -1.43   0.154    -.0018107    .0002853
                   FES_site |   .0425568   .1025562     0.41   0.678    -.1584496    .2435632
                   Shar_Lit |   .0001033   .0063097     0.02   0.987    -.0122636    .0124701
                  Shar_SCST |  -.0014206   .0027891    -0.51   0.611     -.006887    .0040459
    fs_dam_used_farming_new |  -.1302755   .1077923    -1.21   0.227    -.3415446    .0809935
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2
               leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. 
. *plot coefficients
. coefplot (panelB1) (panelB2),   keep(FES_site  share_female_percent2 )  coeflabels(FES_site = "FES present" share_female_percent2 = "S
> hare of women participating in %") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B } Determinants (Treatment villages only)", span p
> os(11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6
> ) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.
> 2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_b.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_b.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. coefplot (panelB1) (panelB2),   keep(FES_site  share_female_percent2 )  coeflabels(FES_site = "FES present" share_female_percent2 = "S
> hare of women participating in %") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B } Determinants (Treatment villages only)", span p
> os(11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6
> ) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.
> 2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_b.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_b.gph saved)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition , robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100))  vsquish

Predictive margins                              Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
1._at        : share_fema~2    =           0
2._at        : share_fema~2    =          10
3._at        : share_fema~2    =          20
4._at        : share_fema~2    =          30
5._at        : share_fema~2    =          40
6._at        : share_fema~2    =          50
7._at        : share_fema~2    =          60
8._at        : share_fema~2    =          70
9._at        : share_fema~2    =          80
10._at       : share_fema~2    =          90
11._at       : share_fema~2    =         100

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .467856   .1272335     3.68   0.000     .2184829    .7172291
          2  |   .5909126    .085153     6.94   0.000     .4240157    .7578095
          3  |   .7060441   .0571872    12.35   0.000     .5939592    .8181291
          4  |   .8041368   .0562712    14.29   0.000     .6938473    .9144263
          5  |   .8799598   .0606909    14.50   0.000     .7610079    .9989118
          6  |   .9328615   .0556124    16.77   0.000     .8238631     1.04186
          7  |   .9659868   .0425981    22.68   0.000     .8824961    1.049478
          8  |   .9844976   .0276249    35.64   0.000     .9303538    1.038641
          9  |   .9936815   .0153056    64.92   0.000     .9636831     1.02368
         10  |   .9977089   .0072816   137.02   0.000     .9834371    1.011981
         11  |   .9992642   .0029827   335.02   0.000     .9934183     1.00511
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women pa
> rticipating in games (percent)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted maintenance") ///
>                 recastci(rarea) ciopts(fcolor(%60) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%30) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Per
> cent", axis(2)) legend(rows(1) order(2 "Predicted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(bl
> ack) horizontal(left) vertical(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(
> 1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow
> _pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztyp
> e(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) linestyle( width( sztype(relati
> ve) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. gr save "$working_ANALYSIS/results/intermediate/figure1_c.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_c.gph saved)

. di  .7060441 -.467856
.2381881

. *around the median value of women share we estimate an increased likelihood of maintenance of about 23pp compared to sessions with no 
> female participants
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *Panel D: Determinants of rule existence
. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100))  vsquish

Predictive margins                              Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
1._at        : share_fema~2    =           0
2._at        : share_fema~2    =          10
3._at        : share_fema~2    =          20
4._at        : share_fema~2    =          30
5._at        : share_fema~2    =          40
6._at        : share_fema~2    =          50
7._at        : share_fema~2    =          60
8._at        : share_fema~2    =          70
9._at        : share_fema~2    =          80
10._at       : share_fema~2    =          90
11._at       : share_fema~2    =         100

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .1067676   .0570869     1.87   0.061    -.0051206    .2186558
          2  |   .1748024   .0596955     2.93   0.003     .0578013    .2918035
          3  |   .2647646   .0575409     4.60   0.000     .1519866    .3775426
          4  |   .3731598   .0616785     6.05   0.000     .2522721    .4940475
          5  |   .4924098   .0798037     6.17   0.000     .3359974    .6488222
          6  |   .6123331   .1023734     5.98   0.000      .411685    .8129813
          7  |   .7225846   .1168241     6.19   0.000     .4936136    .9515556
          8  |   .8151532   .1167903     6.98   0.000     .5862485    1.044058
          9  |   .8859952   .1026858     8.63   0.000     .6847347    1.087256
         10  |   .9352803   .0797617    11.73   0.000     .7789502     1.09161
         11  |   .9663565   .0548775    17.61   0.000     .8587985    1.073914
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:D } Rule existence", span pos(11) size()) xtitle("Share of women pa
> rticipating in games (percent)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted rule existence") ///
>                 recastci(rarea) ciopts(fcolor(%60) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%30) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Per
> cent", axis(2)) legend(rows(1) order(2 "Predicted rule existence" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(bl
> ack) horizontal(left) vertical(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(
> 1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow
> _pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztyp
> e(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) linestyle( width( sztype(relati
> ve) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion1.added_text[1].DragBy .7700581653703878 -1.003999819168964

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr save "$working_ANALYSIS/results/intermediate/figure1_d.gph", replace
(note: file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_d.gph not found)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_d.gph saved)

. di  .2681938-.1389518 
.129242

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph" "$working_AN
> ALYSIS/results/intermediate/figure1_c.gph" "$working_ANALYSIS/results/intermediate/figure1_d.gph", rows(2) saving("$working_ANALYSIS\r
> esults\intermediate\figure1.gph", replace)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.05

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy
Graph.plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy: class type not found
r(4018);

end of do-file

r(4018);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *plot coefficients
. coefplot (main1) (main2),   keep(treatment FES_site)  coeflabels(treatment  = "Games Intervention" FES_site = "FES present") xline(0, 
> lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effects", span pos(11) size()) xtitle("Impact relative to control villages in pp"
> )  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 
> 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*
> ", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. coefplot (main1) (main2),   keep(treatment FES_site)  coeflabels(treatment  = "Games Intervention" FES_site = "FES present") xline(0, 
> lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effects", span pos(11) size()) xtitle("Regression estimated impact in pp")  legen
> d(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciop
> ts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))
> )  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *plot coefficients
. coefplot (panelB1) (panelB2),   keep(FES_site  share_female_percent2 )  coeflabels(FES_site = "FES present" share_female_percent2 = "S
> hare of women participating in %") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B } Determinants (Treatment villages only)", span p
> os(11) size()) xtitle("Regression estimated impact in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) ms
> ymbol(d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(
> @pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_b.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_b.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph" "$working_AN
> ALYSIS/results/intermediate/figure1_c.gph" "$working_ANALYSIS/results/intermediate/figure1_d.gph", rows(2) saving("$working_ANALYSIS\r
> esults\intermediate\figure1.gph", replace)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.05

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy
Graph.plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy: class type not found
r(4018);

end of do-file

r(4018);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph" "$working_AN
> ALYSIS/results/intermediate/figure1_c.gph" "$working_ANALYSIS/results/intermediate/figure1_d.gph", rows(2) saving("$working_ANALYSIS\r
> esults\intermediate\figure1.gph", replace)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit plotregion1.graph3.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy

. gr_edit plotregion1.graph4.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy

. gr_edit plotregion1.graph3.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph" "$working_AN
> ALYSIS/results/intermediate/figure1_c.gph" "$working_ANALYSIS/results/intermediate/figure1_d.gph", rows(2) saving("$working_ANALYSIS\r
> esults\intermediate\figure1.gph", replace)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit plotregion1.graph3.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy

. gr_edit plotregion1.graph4.plotregion1.added_text[1].style.editstyle size(8-pt) editcopy

. gr_edit plotregion1.graph3.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr_edit plotregion1.graph4.plotregion1.added_text[1].DragBy .1832307316884621 1.209405440951938

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2
               leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2
               leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *Panel B: Determinants of Maintenance & Rules in treatment villages
. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    5.69
         Prob > chi2 =    0.3372

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0155107   .1128008     0.14   0.891    -.2055747    .2365962
                  No_HH |   .0006364    .000667     0.95   0.340     -.000671    .0019437
               FES_site |   .2535619   .1190204     2.13   0.033     .0202863    .4868375
               Shar_Lit |   .0104802   .0073445     1.43   0.154    -.0039148    .0248753
              Shar_SCST |  -.0013654   .0032785    -0.42   0.677    -.0077912    .0050604
fs_dam_used_farming_new |   .0739168   .1125436     0.66   0.511    -.1466646    .2944981
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) rep
> lace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. est store panelB1

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.930422  
Iteration 2:   log pseudolikelihood = -47.916021  
Iteration 3:   log pseudolikelihood = -47.916019  

Probit regression                               Number of obs     =         82
                                                Wald chi2(6)      =       3.45
                                                Prob > chi2       =     0.7505
Log pseudolikelihood = -47.916019               Pseudo R2         =     0.0498

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .2172909    .417357     0.52   0.603    -.6007139    1.035296
                      No_HH |  -.0022857    .001671    -1.37   0.171    -.0055608    .0009894
                   FES_site |    .127537   .3095946     0.41   0.680    -.4792572    .7343311
                   Shar_Lit |   .0003095   .0189099     0.02   0.987    -.0367532    .0373722
                  Shar_SCST |  -.0042573   .0084262    -0.51   0.613    -.0207723    .0122578
    fs_dam_used_farming_new |  -.3904179   .3327213    -1.17   0.241     -1.04254    .2617038
                      _cons |   .2176365   1.285065     0.17   0.866    -2.301045    2.736318
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.44
         Prob > chi2 =    0.6321

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .0725061   .1381831     0.52   0.600    -.1983279    .3433401
                      No_HH |  -.0007627   .0005347    -1.43   0.154    -.0018107    .0002853
                   FES_site |   .0425568   .1025562     0.41   0.678    -.1584496    .2435632
                   Shar_Lit |   .0001033   .0063097     0.02   0.987    -.0122636    .0124701
                  Shar_SCST |  -.0014206   .0027891    -0.51   0.611     -.006887    .0040459
    fs_dam_used_farming_new |  -.1302755   .1077923    -1.21   0.227    -.3415446    .0809935
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control $session_composition, robust

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2
               leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |          0  (omitted)
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *Panel B: Determinants of Maintenance & Rules in treatment villages
. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    5.69
         Prob > chi2 =    0.3372

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0155107   .1128008     0.14   0.891    -.2055747    .2365962
                  No_HH |   .0006364    .000667     0.95   0.340     -.000671    .0019437
               FES_site |   .2535619   .1190204     2.13   0.033     .0202863    .4868375
               Shar_Lit |   .0104802   .0073445     1.43   0.154    -.0039148    .0248753
              Shar_SCST |  -.0013654   .0032785    -0.42   0.677    -.0077912    .0050604
fs_dam_used_farming_new |   .0739168   .1125436     0.66   0.511    -.1466646    .2944981
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) rep
> lace
file using "C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf" is read-only; can
> not be modified or erased
The file needs to be closed if being used by another software such as Word.
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *Panel B: Determinants of Maintenance & Rules in treatment villages
. probit fs_maintenance_12m_new bs_maintenance_12m_new $control if treatment == 1,  robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -28.626687  
Iteration 2:   log pseudolikelihood = -28.588821  
Iteration 3:   log pseudolikelihood = -28.588816  
Iteration 4:   log pseudolikelihood = -28.588816  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       5.80
                                                Prob > chi2       =     0.4462
Log pseudolikelihood = -28.588816               Pseudo R2         =     0.1215

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0536083    .391017     0.14   0.891    -.7127709    .8199875
                  No_HH |   .0021994   .0023292     0.94   0.345    -.0023658    .0067645
               FES_site |   .8763623   .4595357     1.91   0.057    -.0243111    1.777036
               Shar_Lit |   .0362218   .0272138     1.33   0.183    -.0171163    .0895599
              Shar_SCST |  -.0047191   .0113472    -0.42   0.677    -.0269592     .017521
fs_dam_used_farming_new |   .2554716   .3960238     0.65   0.519    -.5207208    1.031664
                  _cons |  -1.889898   1.905753    -0.99   0.321    -5.625106     1.84531
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    5.69
         Prob > chi2 =    0.3372

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0155107   .1128008     0.14   0.891    -.2055747    .2365962
                  No_HH |   .0006364    .000667     0.95   0.340     -.000671    .0019437
               FES_site |   .2535619   .1190204     2.13   0.033     .0202863    .4868375
               Shar_Lit |   .0104802   .0073445     1.43   0.154    -.0039148    .0248753
              Shar_SCST |  -.0013654   .0032785    -0.42   0.677    -.0077912    .0050604
fs_dam_used_farming_new |   .0739168   .1125436     0.66   0.511    -.1466646    .2944981
-----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) rep
> lace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.67
         Prob > chi2 =    0.1229

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_maintenance_12m_new]share_female_percent2 = 0
 ( 2)  [fs_maintenance_12m_new]leader2_2 = 0
 ( 3)  [fs_maintenance_12m_new]leader2_3 = 0
 ( 4)  [fs_maintenance_12m_new]d_illiterate = 0

           chi2(  4) =    5.98
         Prob > chi2 =    0.2003

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |     .02238   .1108641     0.20   0.840    -.1949096    .2396697
                  No_HH |    .000817   .0006686     1.22   0.222    -.0004933    .0021274
               FES_site |   .2185569   .1026978     2.13   0.033     .0172729    .4198408
               Shar_Lit |   .0083982   .0066169     1.27   0.204    -.0045706    .0213671
              Shar_SCST |  -.0029757   .0038921    -0.76   0.445    -.0106042    .0046527
fs_dam_used_farming_new |   .1081894   .1005144     1.08   0.282    -.0888152     .305194
  share_female_percent2 |   .0099188   .0041307     2.40   0.016     .0018228    .0180147
              leader2_2 |   .0686978   .1240654     0.55   0.580    -.1744659    .3118616
              leader2_3 |  -.0793557   .1399133    -0.57   0.571    -.3535807    .1948693
           d_illiterate |   .1278462   .1062114     1.20   0.229    -.0803243    .3360168
-----------------------------------------------------------------------------------------

. est store panelB1

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control if treatment == 1, robust

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -32.231667  
Iteration 2:   log pseudolikelihood = -32.215512  
Iteration 3:   log pseudolikelihood = -32.215508  
Iteration 4:   log pseudolikelihood = -32.215508  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.42
                                                Prob > chi2       =     0.6201
Log pseudolikelihood = -32.215508               Pseudo R2         =     0.0839

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .2179315   .4946255     0.44   0.660    -.7515166     1.18738
                      No_HH |   -.001151   .0025687    -0.45   0.654    -.0061855    .0038834
                   FES_site |   .5272578   .3795943     1.39   0.165    -.2167333    1.271249
                   Shar_Lit |  -.0080071   .0239183    -0.33   0.738    -.0548862    .0388719
                  Shar_SCST |  -.0036524   .0118569    -0.31   0.758    -.0268915    .0195867
    fs_dam_used_farming_new |  -.5875984   .4019583    -1.46   0.144    -1.375422    .2002254
                      _cons |   .2348381   1.738522     0.14   0.893    -3.172603    3.642279
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control 

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    4.41
         Prob > chi2 =    0.4916

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   .0717359   .1614684     0.44   0.657    -.2447364    .3882081
                      No_HH |  -.0003789   .0008304    -0.46   0.648    -.0020065    .0012487
                   FES_site |   .1735559   .1190297     1.46   0.145     -.059738    .4068498
                   Shar_Lit |  -.0026357    .007865    -0.34   0.738    -.0180508    .0127794
                  Shar_SCST |  -.0012022   .0038801    -0.31   0.757     -.008807    .0064025
    fs_dam_used_farming_new |   -.193418   .1231882    -1.57   0.116    -.4348625    .0480265
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new bs_dam_maintenance_rule_new $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -28.288569  
Iteration 2:   log pseudolikelihood = -28.126051  
Iteration 3:   log pseudolikelihood = -28.125714  
Iteration 4:   log pseudolikelihood = -28.125714  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      18.55
                                                Prob > chi2       =     0.0463
Log pseudolikelihood = -28.125714               Pseudo R2         =     0.2002

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |  -.0659772   .5554589    -0.12   0.905    -1.154657    1.022702
                      No_HH |  -.0015973   .0028955    -0.55   0.581    -.0072724    .0040779
                   FES_site |   .5857444   .4359941     1.34   0.179    -.2687883    1.440277
                   Shar_Lit |  -.0262382   .0232432    -1.13   0.259     -.071794    .0193177
                  Shar_SCST |  -.0106216   .0134569    -0.79   0.430    -.0369967    .0157535
    fs_dam_used_farming_new |  -.4731477   .4152509    -1.14   0.255    -1.287024     .340729
      share_female_percent2 |   .0356374   .0116496     3.06   0.002     .0128046    .0584701
                  leader2_2 |   .3595024   .4112809     0.87   0.382    -.4465933    1.165598
                  leader2_3 |  -.0480816    .528328    -0.09   0.927    -1.083586    .9874224
               d_illiterate |   .3922933    .405527     0.97   0.333     -.402525    1.187112
                      _cons |   .5379007   1.844966     0.29   0.771    -3.078166    4.153967
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    6.92
         Prob > chi2 =    0.2264

. local F1 = r(p)

. testparm $session_composition

 ( 1)  [fs_dam_maintenance_rule_new]share_female_percent2 = 0
 ( 2)  [fs_dam_maintenance_rule_new]leader2_2 = 0
 ( 3)  [fs_dam_maintenance_rule_new]leader2_3 = 0
 ( 4)  [fs_dam_maintenance_rule_new]d_illiterate = 0

           chi2(  4) =   11.44
         Prob > chi2 =    0.0220

. local F2 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new share_female_percent2 leader2_2
               leader2_3 d_illiterate

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
bs_dam_maintenance_rule_new |   -.018694   .1574539    -0.12   0.905     -.327298      .28991
                      No_HH |  -.0004526   .0008015    -0.56   0.572    -.0020235    .0011184
                   FES_site |   .1659649   .1188109     1.40   0.162    -.0669002      .39883
                   Shar_Lit |  -.0074343   .0065936    -1.13   0.260    -.0203575    .0054889
                  Shar_SCST |  -.0030095      .0038    -0.79   0.428    -.0104574    .0044383
    fs_dam_used_farming_new |  -.1340618   .1148326    -1.17   0.243    -.3591296     .091006
      share_female_percent2 |   .0100975   .0028079     3.60   0.000     .0045941    .0156009
                  leader2_2 |   .1018615   .1151107     0.88   0.376    -.1237513    .3274742
                  leader2_3 |  -.0136234   .1495217    -0.09   0.927    -.3066806    .2794338
               d_illiterate |   .1111525   .1162188     0.96   0.339    -.1166322    .3389372
---------------------------------------------------------------------------------------------

. est store panelB2

. outreg2 using "$working_ANALYSIS/results/tables/tableS4", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1', "F-Test: Session compos
> ition", `F2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. *Panel A: Treatment effects
. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new, robust

Iteration 0:   log pseudolikelihood = -53.058719  
Iteration 1:   log pseudolikelihood = -49.439039  
Iteration 2:   log pseudolikelihood = -49.428948  
Iteration 3:   log pseudolikelihood = -49.428947  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       6.68
                                                Prob > chi2       =     0.0354
Log pseudolikelihood = -49.428947               Pseudo R2         =     0.0684

----------------------------------------------------------------------------------------
                       |               Robust
fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .5686503   .3036249     1.87   0.061    -.0264436    1.163744
bs_maintenance_12m_new |   .5538217   .2943742     1.88   0.060     -.023141    1.130784
                 _cons |   -.238478   .2840203    -0.84   0.401    -.7951476    .3181915
----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new

----------------------------------------------------------------------------------------
                       |            Delta-method
                       |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .1929771   .0959755     2.01   0.044     .0048686    .3810855
bs_maintenance_12m_new |   .1879449   .0929958     2.02   0.043     .0056764    .3702133
----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2') adec(2) word dec(2) replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new $control, robust

Iteration 0:   log pseudolikelihood = -52.644113  
Iteration 1:   log pseudolikelihood = -45.117314  
Iteration 2:   log pseudolikelihood = -45.070712  
Iteration 3:   log pseudolikelihood =  -45.07068  
Iteration 4:   log pseudolikelihood =  -45.07068  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =      13.04
                                                Prob > chi2       =     0.0711
Log pseudolikelihood =  -45.07068               Pseudo R2         =     0.1439

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .6446241    .334522     1.93   0.054    -.0110269    1.300275
 bs_maintenance_12m_new |    .442477   .3158484     1.40   0.161    -.1765746    1.061529
                  No_HH |   .0000721   .0014733     0.05   0.961    -.0028155    .0029596
               FES_site |   .2549761   .3465333     0.74   0.462    -.4242168    .9341689
               Shar_Lit |   .0223016   .0197229     1.13   0.258    -.0163545    .0609578
              Shar_SCST |   -.020116   .0091652    -2.19   0.028    -.0380794   -.0021525
fs_dam_used_farming_new |  -.0427218   .3216812    -0.13   0.894    -.6732054    .5877618
                  _cons |   .0599992   1.473972     0.04   0.968    -2.828932    2.948931
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.47
         Prob > chi2 =    0.1320

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .2010772   .0958373     2.10   0.036     .0132395    .3889148
 bs_maintenance_12m_new |   .1380216   .0943051     1.46   0.143     -.046813    .3228561
                  No_HH |   .0000225   .0004597     0.05   0.961    -.0008785    .0009235
               FES_site |   .0795345   .1071444     0.74   0.458    -.1304646    .2895336
               Shar_Lit |   .0069565   .0060276     1.15   0.248    -.0048574    .0187705
              Shar_SCST |  -.0062748   .0026519    -2.37   0.018    -.0114724   -.0010771
fs_dam_used_farming_new |  -.0133262    .100369    -0.13   0.894    -.2100458    .1833934
-----------------------------------------------------------------------------------------

. est store main1

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new, robust

Iteration 0:   log pseudolikelihood = -51.599338  
Iteration 1:   log pseudolikelihood = -51.386211  
Iteration 2:   log pseudolikelihood = -51.386165  
Iteration 3:   log pseudolikelihood = -51.386165  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       0.43
                                                Prob > chi2       =     0.8079
Log pseudolikelihood = -51.386165               Pseudo R2         =     0.0041

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0828411   .3106302     0.27   0.790     -.525983    .6916651
bs_dam_maintenance_rule_new |    .237315   .3898897     0.61   0.543    -.5268548    1.001485
                      _cons |   -.581681    .266548    -2.18   0.029    -1.104105   -.0592565
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0292277   .1094712     0.27   0.789     -.185332    .2437874
bs_dam_maintenance_rule_new |   .0837286   .1366674     0.61   0.540    -.1841345    .3515918
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.858142  
Iteration 2:   log pseudolikelihood = -47.840102  
Iteration 3:   log pseudolikelihood = -47.840096  
Iteration 4:   log pseudolikelihood = -47.840096  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =       3.70
                                                Prob > chi2       =     0.8135
Log pseudolikelihood = -47.840096               Pseudo R2         =     0.0513

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .1317343   .3391044     0.39   0.698    -.5328982    .7963667
bs_dam_maintenance_rule_new |   .2178599   .4191106     0.52   0.603    -.6035818    1.039302
                      No_HH |  -.0022962    .001682    -1.37   0.172     -.005593    .0010005
                   FES_site |   .0929715   .3105338     0.30   0.765    -.5156636    .7016066
                   Shar_Lit |   .0006083   .0189441     0.03   0.974    -.0365214     .037738
                  Shar_SCST |  -.0041951   .0084126    -0.50   0.618    -.0206835    .0122934
    fs_dam_used_farming_new |  -.4083287   .3399753    -1.20   0.230    -1.074668    .2580106
                      _cons |   .1359511   1.307531     0.10   0.917    -2.426762    2.698664
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.52
         Prob > chi2 =    0.6201

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0438927   .1127663     0.39   0.697    -.1771253    .2649107
bs_dam_maintenance_rule_new |    .072589   .1385918     0.52   0.600    -.1990459     .344224
                      No_HH |  -.0007651   .0005388    -1.42   0.156    -.0018211     .000291
                   FES_site |   .0309773   .1029149     0.30   0.763    -.1707321    .2326867
                   Shar_Lit |   .0002027   .0063116     0.03   0.974    -.0121679    .0125733
                  Shar_SCST |  -.0013978   .0027801    -0.50   0.615    -.0068467    .0040511
    fs_dam_used_farming_new |  -.1360516   .1097955    -1.24   0.215    -.3512469    .0791437
---------------------------------------------------------------------------------------------

. est store main2

. outreg2 using "$working_ANALYSIS/results/tables/tableS3", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) app
> end
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS3.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *Table S6.      Determinants of female participation in games
. global leading_example leader2_1 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS5",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') a
> dec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS5.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       0.07
                                                Prob > F          =     0.9353
                                                R-squared         =     0.0019
                                                Root MSE          =     2.4994

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0399576   .6603341     0.06   0.952    -1.284505     1.36442
          BS_any_rule_ |   .2316124   .6377057     0.36   0.718    -1.047463    1.510688
                 _cons |   3.344413   .5297071     6.31   0.000     2.281955    4.406871
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0

       F(  2,    53) =    0.07
            Prob > F =    0.9353

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') 
> adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_1 |    .081448   .6092252     0.13   0.894    -1.140503    1.303399
   leader2_3 |   2.696833   .8470096     3.18   0.002     .9979466    4.395719
       _cons |   2.764706   .4147894     6.67   0.000     1.932744    3.596668
------------------------------------------------------------------------------

. testparm leader2_2 leader2_3, equal
too few variables specified
r(102);

end of do-file

r(102);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new 
. global session_composition      share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill bs_maintenance_12m_new bs_dam_maintenance_rule_new $control, robust

Linear regression                               Number of obs     =         56
                                                F(7, 48)          =       1.25
                                                Prob > F          =     0.2954
                                                R-squared         =     0.1310
                                                Root MSE          =     2.4506

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
     bs_maintenance_12m_new |   .1561684   .7870416     0.20   0.844    -1.426285    1.738622
bs_dam_maintenance_rule_new |   1.280604   .6437523     1.99   0.052    -.0137471    2.574954
                      No_HH |   .0042504   .0040561     1.05   0.300    -.0039049    .0124057
                   FES_site |    .049627    .866986     0.06   0.955    -1.693565    1.792819
                   Shar_Lit |   .0568611   .0485976     1.17   0.248     -.040851    .1545732
                  Shar_SCST |   .0193032   .0239104     0.81   0.423    -.0287719    .0673784
    fs_dam_used_farming_new |  -1.339189   .7036695    -1.90   0.063    -2.754012    .0756331
                      _cons |  -1.428276    3.20195    -0.45   0.658    -7.866229    5.009677
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $session_composition, robust

Linear regression                               Number of obs     =         56
                                                F(4, 51)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     1.0000
                                                Root MSE          =          0

---------------------------------------------------------------------------------------
                      |               Robust
no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
share_female_percent2 |        .14   2.04e-09  6.9e+07   0.000          .14         .14
            leader2_2 |  -9.97e-09   2.90e-08    -0.34   0.732    -6.81e-08    4.82e-08
            leader2_3 |  -3.10e-08   3.87e-08    -0.80   0.427    -1.09e-07    4.67e-08
         d_illiterate |  -8.13e-09   2.81e-08    -0.29   0.774    -6.46e-08    4.83e-08
                _cons |  -1.07e-07   4.24e-08    -2.52   0.015    -1.92e-07   -2.17e-08
---------------------------------------------------------------------------------------

. testparm $session_composition

 ( 1)  share_female_percent2 = 0
 ( 2)  leader2_2 = 0
 ( 3)  leader2_3 = 0
 ( 4)  d_illiterate = 0

       F(  4,    51) = 1.3e+15
            Prob > F =    0.0000

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. global baseline_characteristics bs_maintenance_12m_new bs_dam_maintenance_rule_new

. global leading_example leader2_2 leader2_3 d_illiterate

. reg no_leader_female_vill  $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       0.80
                                                Prob > F          =     0.4541
                                                R-squared         =     0.0144
                                                Root MSE          =     2.4836

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
     bs_maintenance_12m_new |   .1384615   .6764687     0.20   0.839    -1.218363    1.495286
bs_dam_maintenance_rule_new |   .8413462   .6708215     1.25   0.215    -.5041515    2.186844
                      _cons |   3.231731   .5335625     6.06   0.000      2.16154    4.301922
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       4.01
                                                Prob > F          =     0.0122
                                                R-squared         =     0.2315
                                                Root MSE          =     2.2141

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   .0071174   .6454439     0.01   0.991    -1.288061    1.302295
   leader2_3 |   2.697509   .8885771     3.04   0.004     .9144484    4.480569
d_illiterate |  -.7117438   .6437664    -1.11   0.274    -2.003556    .5800681
       _cons |   3.092527   .4288675     7.21   0.000     2.231941    3.953112
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_2 |   .0497985   .6645892     0.07   0.941    -1.288753     1.38835
                  leader2_3 |    2.40736   .9457904     2.55   0.014     .5024404     4.31228
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   .5540413   2.931276     0.19   0.851    -5.349852    6.457934
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. global baseline_characteristics bs_maintenance_12m_new bs_dam_maintenance_rule_new

. global leading_example leader2_2 leader2_3 d_illiterate

. reg no_leader_female_vill  $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS5",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') a
> dec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS5.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       0.80
                                                Prob > F          =     0.4541
                                                R-squared         =     0.0144
                                                Root MSE          =     2.4836

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
     bs_maintenance_12m_new |   .1384615   .6764687     0.20   0.839    -1.218363    1.495286
bs_dam_maintenance_rule_new |   .8413462   .6708215     1.25   0.215    -.5041515    2.186844
                      _cons |   3.231731   .5335625     6.06   0.000      2.16154    4.301922
---------------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  bs_dam_maintenance_rule_new = 0

       F(  2,    53) =    0.80
            Prob > F =    0.4541

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') 
> adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       4.01
                                                Prob > F          =     0.0122
                                                R-squared         =     0.2315
                                                Root MSE          =     2.2141

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   .0071174   .6454439     0.01   0.991    -1.288061    1.302295
   leader2_3 |   2.697509   .8885771     3.04   0.004     .9144484    4.480569
d_illiterate |  -.7117438   .6437664    -1.11   0.274    -2.003556    .5800681
       _cons |   3.092527   .4288675     7.21   0.000     2.231941    3.953112
------------------------------------------------------------------------------

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0
 ( 3)  d_illiterate = 0

       F(  3,    52) =    4.01
            Prob > F =    0.0122

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2
> ) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_2 |   .0497985   .6645892     0.07   0.941    -1.288753     1.38835
                  leader2_3 |    2.40736   .9457904     2.55   0.014     .5024404     4.31228
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   .5540413   2.931276     0.19   0.851    -5.349852    6.457934
---------------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.62
            Prob > F =    0.6862

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  bs_dam_maintenance_rule_new = 0

       F(  2,    45) =    1.37
            Prob > F =    0.2652

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0
 ( 3)  d_illiterate = 0

       F(  3,    45) =    3.97
            Prob > F =    0.0136

. local F3 = r(p)

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =   11.13
            Prob > F =    0.0017

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1', "
> F-Test: Baseline characteristics", `F2', "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. 
. *Table S6.      Determinants of female participation in games
. global baseline_characteristics bs_maintenance_12m_new bs_dam_maintenance_rule_new

. global leading_example leader2_2 leader2_3 d_illiterate

. reg no_leader_female_vill  $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS6",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') a
> dec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS6.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       0.80
                                                Prob > F          =     0.4541
                                                R-squared         =     0.0144
                                                Root MSE          =     2.4836

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
     bs_maintenance_12m_new |   .1384615   .6764687     0.20   0.839    -1.218363    1.495286
bs_dam_maintenance_rule_new |   .8413462   .6708215     1.25   0.215    -.5041515    2.186844
                      _cons |   3.231731   .5335625     6.06   0.000      2.16154    4.301922
---------------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  bs_dam_maintenance_rule_new = 0

       F(  2,    53) =    0.80
            Prob > F =    0.4541

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS6",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') 
> adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS6.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       4.01
                                                Prob > F          =     0.0122
                                                R-squared         =     0.2315
                                                Root MSE          =     2.2141

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   .0071174   .6454439     0.01   0.991    -1.288061    1.302295
   leader2_3 |   2.697509   .8885771     3.04   0.004     .9144484    4.480569
d_illiterate |  -.7117438   .6437664    -1.11   0.274    -2.003556    .5800681
       _cons |   3.092527   .4288675     7.21   0.000     2.231941    3.953112
------------------------------------------------------------------------------

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0
 ( 3)  d_illiterate = 0

       F(  3,    52) =    4.01
            Prob > F =    0.0122

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS6",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2
> ) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS6.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_2 |   .0497985   .6645892     0.07   0.941    -1.288753     1.38835
                  leader2_3 |    2.40736   .9457904     2.55   0.014     .5024404     4.31228
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   .5540413   2.931276     0.19   0.851    -5.349852    6.457934
---------------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.62
            Prob > F =    0.6862

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  bs_dam_maintenance_rule_new = 0

       F(  2,    45) =    1.37
            Prob > F =    0.2652

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0
 ( 3)  d_illiterate = 0

       F(  3,    45) =    3.97
            Prob > F =    0.0136

. local F3 = r(p)

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =   11.13
            Prob > F =    0.0017

. outreg2 using  "$working_ANALYSIS/results/tables/tableS6",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1', "
> F-Test: Baseline characteristics", `F2', "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS6.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS6.rtf"'

. tab Illiterate participants (=1)
variable Illiterate not found
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =   11.13
            Prob > F =    0.0017

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $control $baseline_characteristics leader2_2 leader2_1 d_illiterate, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_2 |  -2.357562   .7066039    -3.34   0.002    -3.780735   -.9343882
                  leader2_1 |   -2.40736   .9457904    -2.55   0.014     -4.31228   -.5024404
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   2.961401   3.214308     0.92   0.362    -3.512548    9.435351
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $control $baseline_characteristics leader2_3 leader2_1 d_illiterate, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_3 |   2.357562   .7066039     3.34   0.002     .9343882    3.780735
                  leader2_1 |  -.0497985   .6645892    -0.07   0.941     -1.38835    1.288753
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   .6038398   2.984639     0.20   0.841    -5.407531    6.615211
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDf6c_000000.tmp"

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.51
                                                Prob > F          =     0.0173
                                                R-squared         =     0.2851
                                                Root MSE          =     2.2956

---------------------------------------------------------------------------------------------
                            |               Robust
      no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                      No_HH |   .0007571    .003973     0.19   0.850    -.0072449    .0087592
                   FES_site |   .0016406   .8186189     0.00   0.998    -1.647142    1.650424
                   Shar_Lit |   .0436856   .0407752     1.07   0.290    -.0384399     .125811
                  Shar_SCST |    .005011   .0245575     0.20   0.839    -.0444503    .0544722
    fs_dam_used_farming_new |   -.912984   .6373986    -1.43   0.159    -2.196771    .3708026
     bs_maintenance_12m_new |   .0671816   .7406989     0.09   0.928    -1.424663    1.559026
bs_dam_maintenance_rule_new |   .9699659    .617971     1.57   0.124    -.2746915    2.214623
                  leader2_2 |   .0497985   .6645892     0.07   0.941    -1.288753     1.38835
                  leader2_3 |    2.40736   .9457904     2.55   0.014     .5024404     4.31228
               d_illiterate |  -.5899665   .7220499    -0.82   0.418     -2.04425    .8643166
                      _cons |   .5540413   2.931276     0.19   0.851    -5.349852    6.457934
---------------------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
