----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2022.06.21-11.02.23.log.txt
  log type:  text
 opened on:  21 Jun 2022, 11:02:23

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 21 Jun 2022 11:02:23

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmatasp;l
> matasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
end of do-file

. tab fs_dam_maintenance_rule_new

 Identifier |
  whether a |
maintenance |
       rule |
    exists. |
      (Y/N) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       68.67       68.67
          1 |         26       31.33      100.00
------------+-----------------------------------
      Total |         83      100.00

. tab bs_dam_maintenance_rule_new

 Identifier |
  whether a |
maintenance |
       rule |
    exists. |
      (Y/N) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       84.34       84.34
          1 |         13       15.66      100.00
------------+-----------------------------------
      Total |         83      100.00

. bys treatment: sum bs_dam_maintenance_rule_new fs_dam_maintenance_rule_new

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
bs_dam_mai~w |         27    .1851852    .3958474          0          1
fs_dam_mai~w |         27    .2962963    .4653216          0          1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
bs_dam_mai~w |         56    .1428571    .3530939          0          1
fs_dam_mai~w |         56    .3214286    .4712514          0          1


. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gen leader_present = 0

. replace leader_present = 1 if leader_female_vill == 1 & leader_male_vill==0
(11 real changes made)

. replace leader_present = 2 if leader_female_vill == 0 & leader_male_vill==1
(17 real changes made)

. replace leader_present = 3 if leader_female_vill == 1 & leader_male_vill==1
(2 real changes made)

. replace leader_present = . if treatment==0
(27 real changes made, 27 to missing)

. lab def leader_lab 0 "None" 1 "Female" 2 "Male" 3 "Both", replace

. lab val leader_present leader_lab

. tab leader_present, gen(leader_)

leader_pres |
        ent |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |         26       46.43       46.43
     Female |         11       19.64       66.07
       Male |         17       30.36       96.43
       Both |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

. 
. gen leader_present2 = 0 if leader_present==0
(57 missing values generated)

. replace leader_present2 = 1 if leader_present==2
(17 real changes made)

. replace leader_present2 = 2 if leader_present==1 | leader_present==3
(13 real changes made)

. lab def leader_lab2 0 "None" 1 "Only male" 2 "Only female or both", replace

. lab val leader_present2 leader_lab2

. tab leader_present2, gen(leader2_)

    leader_present2 |      Freq.     Percent        Cum.
--------------------+-----------------------------------
               None |         26       46.43       46.43
          Only male |         17       30.36       76.79
Only female or both |         13       23.21      100.00
--------------------+-----------------------------------
              Total |         56      100.00

. 
. gen share_female_percent2 = share_no_leader_female_vill*100
(27 missing values generated)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new 
. global session_composition      share_female_percent2 leader2_2 leader2_3 d_illiterate
. global ingame_behavior          total_com_male total_com_female game_almost_opt_invest_r9_10
. global facilitation                     game_lead_facil count_intervention come_back_dummy com_outside_game             
. }

. *----------------------------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(0, 55)          =       0.00
                                                Prob > F          =          .
                                                R-squared         =     0.0000
                                                Root MSE          =     2.4558

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   3.428571   .3281759    10.45   0.000     2.770892    4.086251
------------------------------------------------------------------------------

. testparm $baseline_characteristics
varlist required
r(100);

end of do-file

r(100);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_2 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_ bs_any_conflict

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.04
                                                Prob > F          =     0.9872
                                                R-squared         =     0.0019
                                                Root MSE          =     2.5233

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0435686   .6945139     0.06   0.950    -1.350076    1.437213
          BS_any_rule_ |   .2295305   .6453925     0.36   0.724    -1.065544    1.524605
       bs_any_conflict |   .0438283   .6652146     0.07   0.948    -1.291023    1.378679
                 _cons |   3.341406   .5609152     5.96   0.000     2.215848    4.466965
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    52) =    0.04
            Prob > F =    0.9872

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   -.081448   .6092252    -0.13   0.894    -1.303399    1.140503
   leader2_3 |   2.615385   .8628326     3.03   0.004     .8847617    4.346008
       _cons |   2.846154    .446212     6.38   0.000     1.951166    3.741142
------------------------------------------------------------------------------

. testparm leader_2 leader_4, equal
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_2 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_ bs_any_conflict

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.04
                                                Prob > F          =     0.9872
                                                R-squared         =     0.0019
                                                Root MSE          =     2.5233

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0435686   .6945139     0.06   0.950    -1.350076    1.437213
          BS_any_rule_ |   .2295305   .6453925     0.36   0.724    -1.065544    1.524605
       bs_any_conflict |   .0438283   .6652146     0.07   0.948    -1.291023    1.378679
                 _cons |   3.341406   .5609152     5.96   0.000     2.215848    4.466965
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    52) =    0.04
            Prob > F =    0.9872

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   -.081448   .6092252    -0.13   0.894    -1.303399    1.140503
   leader2_3 |   2.615385   .8628326     3.03   0.004     .8847617    4.346008
       _cons |   2.846154    .446212     6.38   0.000     1.951166    3.741142
------------------------------------------------------------------------------

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    53) =   10.14
            Prob > F =    0.0024

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.00
                                                Prob > F          =     0.0561
                                                R-squared         =     0.2664
                                                Root MSE          =     2.3255

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0013962   .0037876     0.37   0.714    -.0062324    .0090247
               FES_site |   .1765802   .8114389     0.22   0.829    -1.457742    1.810902
               Shar_Lit |    .049535   .0404738     1.22   0.227    -.0319834    .1310533
              Shar_SCST |   .0063533   .0271289     0.23   0.816    -.0482871    .0609938
fs_dam_used_farming_new |   -1.00419   .6594558    -1.52   0.135    -2.332402    .3240221
 bs_maintenance_12m_new |   .0417596   .7413878     0.06   0.955    -1.451472    1.534991
           BS_any_rule_ |   -.123536   .6688714    -0.18   0.854    -1.470712     1.22364
        bs_any_conflict |   1.732961   1.175309     1.47   0.147    -.6342322    4.100154
              leader2_2 |   .1464814   .6971963     0.21   0.835    -1.257744    1.550707
              leader2_3 |   2.492195   .9983666     2.50   0.016     .4813818    4.503009
                  _cons |  -.2063173   3.296481    -0.06   0.950    -6.845772    6.433137
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.69
            Prob > F =    0.6353

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    45) =    0.83
            Prob > F =    0.4849

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0

       F(  2,    45) =    4.36
            Prob > F =    0.0186

. local F3 = r(p)

. testparm leader_2 leader_3, equal
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_2 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_ bs_any_conflict

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.04
                                                Prob > F          =     0.9872
                                                R-squared         =     0.0019
                                                Root MSE          =     2.5233

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0435686   .6945139     0.06   0.950    -1.350076    1.437213
          BS_any_rule_ |   .2295305   .6453925     0.36   0.724    -1.065544    1.524605
       bs_any_conflict |   .0438283   .6652146     0.07   0.948    -1.291023    1.378679
                 _cons |   3.341406   .5609152     5.96   0.000     2.215848    4.466965
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    52) =    0.04
            Prob > F =    0.9872

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   -.081448   .6092252    -0.13   0.894    -1.303399    1.140503
   leader2_3 |   2.615385   .8628326     3.03   0.004     .8847617    4.346008
       _cons |   2.846154    .446212     6.38   0.000     1.951166    3.741142
------------------------------------------------------------------------------

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    53) =   10.14
            Prob > F =    0.0024

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.00
                                                Prob > F          =     0.0561
                                                R-squared         =     0.2664
                                                Root MSE          =     2.3255

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0013962   .0037876     0.37   0.714    -.0062324    .0090247
               FES_site |   .1765802   .8114389     0.22   0.829    -1.457742    1.810902
               Shar_Lit |    .049535   .0404738     1.22   0.227    -.0319834    .1310533
              Shar_SCST |   .0063533   .0271289     0.23   0.816    -.0482871    .0609938
fs_dam_used_farming_new |   -1.00419   .6594558    -1.52   0.135    -2.332402    .3240221
 bs_maintenance_12m_new |   .0417596   .7413878     0.06   0.955    -1.451472    1.534991
           BS_any_rule_ |   -.123536   .6688714    -0.18   0.854    -1.470712     1.22364
        bs_any_conflict |   1.732961   1.175309     1.47   0.147    -.6342322    4.100154
              leader2_2 |   .1464814   .6971963     0.21   0.835    -1.257744    1.550707
              leader2_3 |   2.492195   .9983666     2.50   0.016     .4813818    4.503009
                  _cons |  -.2063173   3.296481    -0.06   0.950    -6.845772    6.433137
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.69
            Prob > F =    0.6353

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    45) =    0.83
            Prob > F =    0.4849

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0

       F(  2,    45) =    4.36
            Prob > F =    0.0186

. local F3 = r(p)

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =    8.37
            Prob > F =    0.0058

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1', "F-Test: Baseline characteristics", `
> F2', "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_2 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_ bs_any_conflict

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.04
                                                Prob > F          =     0.9872
                                                R-squared         =     0.0019
                                                Root MSE          =     2.5233

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0435686   .6945139     0.06   0.950    -1.350076    1.437213
          BS_any_rule_ |   .2295305   .6453925     0.36   0.724    -1.065544    1.524605
       bs_any_conflict |   .0438283   .6652146     0.07   0.948    -1.291023    1.378679
                 _cons |   3.341406   .5609152     5.96   0.000     2.215848    4.466965
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    52) =    0.04
            Prob > F =    0.9872

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   -.081448   .6092252    -0.13   0.894    -1.303399    1.140503
   leader2_3 |   2.615385   .8628326     3.03   0.004     .8847617    4.346008
       _cons |   2.846154    .446212     6.38   0.000     1.951166    3.741142
------------------------------------------------------------------------------

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    53) =   10.14
            Prob > F =    0.0024

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.00
                                                Prob > F          =     0.0561
                                                R-squared         =     0.2664
                                                Root MSE          =     2.3255

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0013962   .0037876     0.37   0.714    -.0062324    .0090247
               FES_site |   .1765802   .8114389     0.22   0.829    -1.457742    1.810902
               Shar_Lit |    .049535   .0404738     1.22   0.227    -.0319834    .1310533
              Shar_SCST |   .0063533   .0271289     0.23   0.816    -.0482871    .0609938
fs_dam_used_farming_new |   -1.00419   .6594558    -1.52   0.135    -2.332402    .3240221
 bs_maintenance_12m_new |   .0417596   .7413878     0.06   0.955    -1.451472    1.534991
           BS_any_rule_ |   -.123536   .6688714    -0.18   0.854    -1.470712     1.22364
        bs_any_conflict |   1.732961   1.175309     1.47   0.147    -.6342322    4.100154
              leader2_2 |   .1464814   .6971963     0.21   0.835    -1.257744    1.550707
              leader2_3 |   2.492195   .9983666     2.50   0.016     .4813818    4.503009
                  _cons |  -.2063173   3.296481    -0.06   0.950    -6.845772    6.433137
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.69
            Prob > F =    0.6353

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    45) =    0.83
            Prob > F =    0.4849

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0

       F(  2,    45) =    4.36
            Prob > F =    0.0186

. local F3 = r(p)

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =    8.37
            Prob > F =    0.0058

. outreg2 using  "$working_ANALYSIS/results/tables/tableS2",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1', "F-Test: Baseline characteristics", `
> F2', "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_2 leader2_3

. global baseline_characteristics bs_maintenance_12m_new BS_any_rule_ bs_any_conflict

. reg no_leader_female_vill $control, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =       0.95
                                                Prob > F          =     0.4564
                                                R-squared         =     0.0995
                                                Root MSE          =     2.4442

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0036796   .0039717     0.93   0.359    -.0042977     .011657
               FES_site |   .0761439   .7322727     0.10   0.918    -1.394669    1.546957
               Shar_Lit |   .0562163   .0476676     1.18   0.244    -.0395269    .1519596
              Shar_SCST |   .0195957   .0243247     0.81   0.424     -.029262    .0684533
fs_dam_used_farming_new |  -1.184474   .6707473    -1.77   0.084    -2.531709     .162762
                  _cons |   -1.13979   3.262106    -0.35   0.728    -7.691923    5.412343
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    50) =    0.95
            Prob > F =    0.4564

. local F1 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1') adec(2) dec(2) word replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $baseline_characteristics, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.04
                                                Prob > F          =     0.9872
                                                R-squared         =     0.0019
                                                Root MSE          =     2.5233

----------------------------------------------------------------------------------------
                       |               Robust
 no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
bs_maintenance_12m_new |   .0435686   .6945139     0.06   0.950    -1.350076    1.437213
          BS_any_rule_ |   .2295305   .6453925     0.36   0.724    -1.065544    1.524605
       bs_any_conflict |   .0438283   .6652146     0.07   0.948    -1.291023    1.378679
                 _cons |   3.341406   .5609152     5.96   0.000     2.215848    4.466965
----------------------------------------------------------------------------------------

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    52) =    0.04
            Prob > F =    0.9872

. local F2 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Baseline characteristics", `F2') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_2 |   -.081448   .6092252    -0.13   0.894    -1.303399    1.140503
   leader2_3 |   2.615385   .8628326     3.03   0.004     .8847617    4.346008
       _cons |   2.846154    .446212     6.38   0.000     1.951166    3.741142
------------------------------------------------------------------------------

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    53) =   10.14
            Prob > F =    0.0024

. local F3 = r(p)

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. reg no_leader_female_vill $control $baseline_characteristics $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(10, 45)         =       2.00
                                                Prob > F          =     0.0561
                                                R-squared         =     0.2664
                                                Root MSE          =     2.3255

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0013962   .0037876     0.37   0.714    -.0062324    .0090247
               FES_site |   .1765802   .8114389     0.22   0.829    -1.457742    1.810902
               Shar_Lit |    .049535   .0404738     1.22   0.227    -.0319834    .1310533
              Shar_SCST |   .0063533   .0271289     0.23   0.816    -.0482871    .0609938
fs_dam_used_farming_new |   -1.00419   .6594558    -1.52   0.135    -2.332402    .3240221
 bs_maintenance_12m_new |   .0417596   .7413878     0.06   0.955    -1.451472    1.534991
           BS_any_rule_ |   -.123536   .6688714    -0.18   0.854    -1.470712     1.22364
        bs_any_conflict |   1.732961   1.175309     1.47   0.147    -.6342322    4.100154
              leader2_2 |   .1464814   .6971963     0.21   0.835    -1.257744    1.550707
              leader2_3 |   2.492195   .9983666     2.50   0.016     .4813818    4.503009
                  _cons |  -.2063173   3.296481    -0.06   0.950    -6.845772    6.433137
-----------------------------------------------------------------------------------------

. testparm $control

 ( 1)  No_HH = 0
 ( 2)  FES_site = 0
 ( 3)  Shar_Lit = 0
 ( 4)  Shar_SCST = 0
 ( 5)  fs_dam_used_farming_new = 0

       F(  5,    45) =    0.69
            Prob > F =    0.6353

. local F1 = r(p)

. testparm $baseline_characteristics

 ( 1)  bs_maintenance_12m_new = 0
 ( 2)  BS_any_rule_ = 0
 ( 3)  bs_any_conflict = 0

       F(  3,    45) =    0.83
            Prob > F =    0.4849

. local F2 = r(p)

. testparm $leading_example

 ( 1)  leader2_2 = 0
 ( 2)  leader2_3 = 0

       F(  2,    45) =    4.36
            Prob > F =    0.0186

. local F3 = r(p)

. testparm leader2_2 leader2_3, equal

 ( 1)  - leader2_2 + leader2_3 = 0

       F(  1,    45) =    8.37
            Prob > F =    0.0058

. outreg2 using  "$working_ANALYSIS/results/tables/tableS4",  addstat("Adjusted R2", e(r2_a), "F-Test: Village characteristics", `F1', "F-Test: Baseline characteristics", `
> F2', "F-Test: Leading by example", `F3') adec(2) dec(2) word append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS4.rtf"'

. tab leader2
leader2 ambiguous abbreviation
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. global leading_example leader2_1 leader2_3

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. reg no_leader_female_vill $leading_example, robust

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       5.55
                                                Prob > F          =     0.0065
                                                R-squared         =     0.2111
                                                Root MSE          =      2.222

------------------------------------------------------------------------------
             |               Robust
n~emale_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   leader2_1 |    .081448   .6092252     0.13   0.894    -1.140503    1.303399
   leader2_3 |   2.696833   .8470096     3.18   0.002     .9979466    4.395719
       _cons |   2.764706   .4147894     6.67   0.000     1.932744    3.596668
------------------------------------------------------------------------------

. 
end of do-file

. sum share_female_percent2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
share_fema~2 |         56     24.4898    17.54174          0   92.85714

. di 56*14
784

. tab treatment

 Identifier |
        for |
   villages |
where games |
       were |
    played. |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         27       32.53       32.53
      Games |         56       67.47      100.00
------------+-----------------------------------
      Total |         83      100.00

. help medeff

. ssc install mediation
checking mediation consistency and verifying not already installed...
all files already exist and are up to date.

. help mediation

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. mediate (regress no_leader_female_vill i.leader_present2 $control)  (regress fs_maintenance_12m_new i.leader_present2 no_leader_female_vill $control) , treat(i.leader_pre
> sent2) mediate(no_leader_female_vill) sims(1000)
command mediate is unrecognized
r(199);

end of do-file

r(199);

. ssc install mediate
ssc install: "mediate" not found at SSC, type search mediate
(To find all packages at SSC that start with m, type ssc describe m)
r(601);

. findit mediate

. findit mediate

. findit medeff

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. *--------------------------------------------------
. * This script installs all necessary Stata packages into /libraries/stata
. * To do a fresh install of all Stata packages, delete the entire /libraries/stata folder
. * Note: this script has been provided for pedagogical purposes only. It should NOT be included as part of your replication materials, since these add-ons are already avai
> lable in /libraries/stata
. *--------------------------------------------------
. 
. *******
. 
. * Create and define a local installation directory for the packages
. cap mkdir "$working_ANALYSIS/scripts/libraries"

. cap mkdir "$working_ANALYSIS/scripts/libraries/stata"

. net set ado "$working_ANALYSIS/scripts/libraries/stata"

. 
. 
. * install grc1leg - combine graphs into one graph with a common legend
. net install grc1leg, from("http://www.stata.com/users/vwiggins") replace
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. net install mediate, from("http://www.stata-journal.com/software/sj12-2/"") replace
unmatched quote
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. *--------------------------------------------------
. * This script installs all necessary Stata packages into /libraries/stata
. * To do a fresh install of all Stata packages, delete the entire /libraries/stata folder
. * Note: this script has been provided for pedagogical purposes only. It should NOT be included as part of your replication materials, since these add-ons are already avai
> lable in /libraries/stata
. *--------------------------------------------------
. 
. *******
. 
. * Create and define a local installation directory for the packages
. cap mkdir "$working_ANALYSIS/scripts/libraries"

. cap mkdir "$working_ANALYSIS/scripts/libraries/stata"

. net set ado "$working_ANALYSIS/scripts/libraries/stata"

. 
. 
. * install grc1leg - combine graphs into one graph with a common legend
. net install grc1leg, from("http://www.stata.com/users/vwiggins") replace
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. net install mediate, from("http://www.stata-journal.com/software/sj12-2/") replace
file http://www.stata-journal.com/software/sj12-2/mediate.pkg not found
could not load mediate.pkg from http://www.stata-journal.com/software/sj12-2/
r(601);

end of do-file

r(601);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. *--------------------------------------------------
. * This script installs all necessary Stata packages into /libraries/stata
. * To do a fresh install of all Stata packages, delete the entire /libraries/stata folder
. * Note: this script has been provided for pedagogical purposes only. It should NOT be included as part of your replication materials, since these add-ons are already avai
> lable in /libraries/stata
. *--------------------------------------------------
. 
. *******
. 
. * Create and define a local installation directory for the packages
. cap mkdir "$working_ANALYSIS/scripts/libraries"

. cap mkdir "$working_ANALYSIS/scripts/libraries/stata"

. net set ado "$working_ANALYSIS/scripts/libraries/stata"

. 
. 
. * install grc1leg - combine graphs into one graph with a common legend
. net install grc1leg, from("http://www.stata.com/users/vwiggins") replace
checking grc1leg consistency and verifying not already installed...
all files already exist and are up to date.

. 
. 
. * install package directly from Github
. net install ietoolkit , from("https://raw.githubusercontent.com/worldbank/ietoolkit/master/src") replace
checking ietoolkit consistency and verifying not already installed...
all files already exist and are up to date.

. net install palettes, replace from("https://raw.githubusercontent.com/benjann/palettes/master/")
checking palettes consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\colorpalette.ado
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\colorpalette.sthlp

installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.

. net install colrspace, replace from("https://raw.githubusercontent.com/benjann/colrspace/master/")
checking colrspace consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\l\lcolrspace.mlib
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\colrspace_source.sthlp
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\colrspace_library_palettes.sthlp
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\colrspace.sthlp

installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.

. 
. * Install packages from SSC
. foreach p in catplot cibar coefplot distplot estout geo2xy grstyle mediation mif2dta  moss mylabels outreg2 schemepack shp2dta spmap {
  2.         local ltr = substr(`"`p'"',1,1)
  3.         qui net from "http://fmwww.bc.edu/repec/bocode/`ltr'"
  4.         net install `p', replace
  5. }
checking catplot consistency and verifying not already installed...
all files already exist and are up to date.
checking cibar consistency and verifying not already installed...
all files already exist and are up to date.
checking coefplot consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\c\coefplot.sthlp

installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.
checking distplot consistency and verifying not already installed...
all files already exist and are up to date.
checking estout consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\e\estout.ado
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\e\esttab.hlp

installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.
checking geo2xy consistency and verifying not already installed...
all files already exist and are up to date.
checking grstyle consistency and verifying not already installed...
all files already exist and are up to date.
checking mediation consistency and verifying not already installed...
installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.
checking mif2dta consistency and verifying not already installed...
all files already exist and are up to date.
checking moss consistency and verifying not already installed...
all files already exist and are up to date.
checking mylabels consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\m\mylabels.ado
    C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\m\mylabels.sthlp

installing into C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata\...
installation complete.
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.
checking schemepack consistency and verifying not already installed...
all files already exist and are up to date.
checking shp2dta consistency and verifying not already installed...
all files already exist and are up to date.
checking spmap consistency and verifying not already installed...
all files already exist and are up to date.

. 
. 
. ** EOF
. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. mediate (regress no_leader_female_vill i.leader_present2 $control)  (regress fs_maintenance_12m_new i.leader_present2 no_leader_female_vill $control) , treat(i.leader_pre
> sent2) mediate(no_leader_female_vill) sims(1000)
command mediate is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. medeff (regress no_leader_female_vill i.leader_present2 $control)  (regress fs_maintenance_12m_new i.leader_present2 no_leader_female_vill $control) , treat(i.leader_pres
> ent2) mediate(no_leader_female_vill) sims(1000)
Using 0 and 1 as treatment values
factor-variable operators not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. 
. medeff (regress no_leader_female_vill leader2_3 $control)  (regress fs_maintenance_12m_new leader2_3 no_leader_female_vill $control) , treat(leader2_3) mediate(no_leader_
> female_vill) sims(1000)
Using 0 and 1 as treatment values

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(6, 49)        =      2.74
       Model |  83.2872069         6  13.8812012   Prob > F        =    0.0225
    Residual |  248.427079        49  5.06994038   R-squared       =    0.2511
-------------+----------------------------------   Adj R-squared   =    0.1594
       Total |  331.714286        55  6.03116883   Root MSE        =    2.2517

-----------------------------------------------------------------------------------------
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |   2.371895   .7531174     3.15   0.003     .8584488    3.885341
                  No_HH |   .0008958   .0037595     0.24   0.813    -.0066592    .0084509
               FES_site |    .055712   .7126507     0.08   0.938    -1.376413    1.487837
               Shar_Lit |   .0428325   .0378491     1.13   0.263    -.0332281    .1188931
              Shar_SCST |   .0074103   .0196214     0.38   0.707    -.0320205     .046841
fs_dam_used_farming_new |  -.8458624   .6311987    -1.34   0.186    -2.114304    .4225789
                  _cons |   .2773028   2.883452     0.10   0.924    -5.517211    6.071817
-----------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(7, 48)        =      1.55
       Model |  2.02939203         7  .289913147   Prob > F        =    0.1721
    Residual |  8.95275083        48  .186515642   R-squared       =    0.1848
-------------+----------------------------------   Adj R-squared   =    0.0659
       Total |  10.9821429        55  .199675325   Root MSE        =    .43187

-----------------------------------------------------------------------------------------
 fs_maintenance_12m_new |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |  -.0673027   .1583975    -0.42   0.673    -.3857822    .2511768
  no_leader_female_vill |   .0467567   .0274005     1.71   0.094    -.0083357     .101849
                  No_HH |    .000612   .0007215     0.85   0.401    -.0008387    .0020627
               FES_site |   .2808811   .1366973     2.05   0.045     .0060327    .5557295
               Shar_Lit |   .0079975   .0073538     1.09   0.282    -.0067884    .0227834
              Shar_SCST |  -.0016948   .0037689    -0.45   0.655    -.0092728    .0058831
fs_dam_used_farming_new |   .1164805   .1232646     0.94   0.349    -.1313596    .3643205
                  _cons |  -.0358011    .553108    -0.06   0.949    -1.147899    1.076297
-----------------------------------------------------------------------------------------
The number of observations in the data is less than the number of simulations. Expanding the data to the number of simulations
------------------------------------------------------------------------------------
        Effect                 |  Mean           [95% Conf. Interval]
-------------------------------+----------------------------------------------------
        ACME                   |  .1090231     -.0143955       .275957
        Direct Effect          |  -.072964     -.3700273      .2341812
        Total Effect           |  .0360591     -.2457395      .3455566
        % of Tot Eff mediated  |  .4207696     -12.07687      7.789968
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. medeff (regress no_leader_female_vill leader2_3 $control)  (regress fs_maintenance_12m_new leader2_3 no_leader_female_vill $control) , seed(12345)  vce(robust) treat(lead
> er2_3) mediate(no_leader_female_vill) sims(1000)
Using 0 and 1 as treatment values

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       2.78
                                                Prob > F          =     0.0207
                                                R-squared         =     0.2511
                                                Root MSE          =     2.2517

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |   2.371895   .7287675     3.25   0.002     .9073818    3.836408
                  No_HH |   .0008958   .0034216     0.26   0.795    -.0059801    .0077718
               FES_site |    .055712   .6894985     0.08   0.936    -1.329887    1.441311
               Shar_Lit |   .0428325   .0390639     1.10   0.278    -.0356693    .1213343
              Shar_SCST |   .0074103   .0238451     0.31   0.757    -.0405082    .0553287
fs_dam_used_farming_new |  -.8458624   .5859795    -1.44   0.155    -2.023432    .3317074
                  _cons |   .2773028   3.031692     0.09   0.927    -5.815111    6.369716
-----------------------------------------------------------------------------------------

Linear regression                               Number of obs     =         56
                                                F(7, 48)          =       2.26
                                                Prob > F          =     0.0450
                                                R-squared         =     0.1848
                                                Root MSE          =     .43187

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |  -.0673027   .1417374    -0.47   0.637    -.3522847    .2176794
  no_leader_female_vill |   .0467567   .0221241     2.11   0.040     .0022732    .0912402
                  No_HH |    .000612    .000731     0.84   0.407    -.0008579    .0020818
               FES_site |   .2808811   .1452728     1.93   0.059    -.0112095    .5729717
               Shar_Lit |   .0079975   .0077259     1.04   0.306    -.0075365    .0235315
              Shar_SCST |  -.0016948   .0041798    -0.41   0.687    -.0100989    .0067092
fs_dam_used_farming_new |   .1164805   .1127709     1.03   0.307    -.1102606    .3432216
                  _cons |  -.0358011   .6538732    -0.05   0.957    -1.350501    1.278899
-----------------------------------------------------------------------------------------
The number of observations in the data is less than the number of simulations. Expanding the data to the number of simulations
------------------------------------------------------------------------------------
        Effect                 |  Mean           [95% Conf. Interval]
-------------------------------+----------------------------------------------------
        ACME                   |  .1102906       .008568      .2463687
        Direct Effect          | -.0746748     -.3332169      .2025087
        Total Effect           |  .0356158     -.2123281      .2860863
        % of Tot Eff mediated  |  .5590301      -13.7656      11.48342
------------------------------------------------------------------------------------

. mat a1 = r(delta0)

. mat b1 = r(zeta0)

. mat c1 = r(tau)

. mat a2 = r(delta0 lo)

. mat b2 = r(zeta0 lo)

. mat c2 = r(tau lo)

. mat a3 = r(delta0 hi)

. mat b3 = r(zeta0 hi)

. mat c3 = r(tau hi)

. matrix med = a1,a2,a3\b1,b2,b3\c1,c2,c3

. matrix coln med = mean ll95 ul95

. matrix rown med = ACME ADE ATE

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (matrix(med[.,1]), ci((med[.,2] med_1[.,3]))),xline(0, lpattern(dash) lcolor(gs3))  xtitle("Estimate female leader effect in pp relative") msymbol(d) xla(-.1(0.1
> ).5) levels(95) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(string(@b, "%5.2f")) mlabposition(12) mlabsize(6pt) xsize(3.465) ysize(3) pos(6) ring(
> 1) rows(4) rowgap(tiny) size(6pt) bmargin(small))
option ) not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (matrix(med[.,1]), ci((med[.,2] med_1[.,3]))),xline(0, lpattern(dash) lcolor(gs3))  xtitle("Estimate female leader effect in pp relative") msymbol(d) xla(-.1(0.1
> ).5) levels(95) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(string(@b, "%5.2f")) mlabposition(12) mlabsize(6pt) xsize(3.465) ysize(3)
(med: med_1 not found)
(med: CI1 missing for some coefficients)
(note:  named style medthin not found in class linestyle, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (matrix(med[.,1]), ci((med[.,2] med[.,3]))),xline(0, lpattern(dash) lcolor(gs3))  xtitle("Estimate female leader effect in pp relative") msymbol(d) xla(-.1(0.1).
> 5) levels(95) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(string(@b, "%5.2f")) mlabposition(12) mlabsize(6pt) xsize(3.465) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. medeff (regress no_leader_female_vill leader2_3 $control)  (regress fs_maintenance_12m_new leader2_3 no_leader_female_vill $control) , seed(12345)  vce(robust) treat(lead
> er2_3) mediate(no_leader_female_vill) sims(1000)
Using 0 and 1 as treatment values

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       2.78
                                                Prob > F          =     0.0207
                                                R-squared         =     0.2511
                                                Root MSE          =     2.2517

-----------------------------------------------------------------------------------------
                        |               Robust
  no_leader_female_vill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |   2.371895   .7287675     3.25   0.002     .9073818    3.836408
                  No_HH |   .0008958   .0034216     0.26   0.795    -.0059801    .0077718
               FES_site |    .055712   .6894985     0.08   0.936    -1.329887    1.441311
               Shar_Lit |   .0428325   .0390639     1.10   0.278    -.0356693    .1213343
              Shar_SCST |   .0074103   .0238451     0.31   0.757    -.0405082    .0553287
fs_dam_used_farming_new |  -.8458624   .5859795    -1.44   0.155    -2.023432    .3317074
                  _cons |   .2773028   3.031692     0.09   0.927    -5.815111    6.369716
-----------------------------------------------------------------------------------------

Linear regression                               Number of obs     =         56
                                                F(7, 48)          =       2.26
                                                Prob > F          =     0.0450
                                                R-squared         =     0.1848
                                                Root MSE          =     .43187

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              leader2_3 |  -.0673027   .1417374    -0.47   0.637    -.3522847    .2176794
  no_leader_female_vill |   .0467567   .0221241     2.11   0.040     .0022732    .0912402
                  No_HH |    .000612    .000731     0.84   0.407    -.0008579    .0020818
               FES_site |   .2808811   .1452728     1.93   0.059    -.0112095    .5729717
               Shar_Lit |   .0079975   .0077259     1.04   0.306    -.0075365    .0235315
              Shar_SCST |  -.0016948   .0041798    -0.41   0.687    -.0100989    .0067092
fs_dam_used_farming_new |   .1164805   .1127709     1.03   0.307    -.1102606    .3432216
                  _cons |  -.0358011   .6538732    -0.05   0.957    -1.350501    1.278899
-----------------------------------------------------------------------------------------
The number of observations in the data is less than the number of simulations. Expanding the data to the number of simulations
------------------------------------------------------------------------------------
        Effect                 |  Mean           [95% Conf. Interval]
-------------------------------+----------------------------------------------------
        ACME                   |  .1102906       .008568      .2463687
        Direct Effect          | -.0746748     -.3332169      .2025087
        Total Effect           |  .0356158     -.2123281      .2860863
        % of Tot Eff mediated  |  .5590301      -13.7656      11.48342
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (matrix(med[.,1]), ci((med[.,2] med[.,3]))),xline(0, lpattern(dash) lcolor(gs3))  xtitle("Estimate female leader effect in pp relative") msymbol(d) xla(-.1(0.1).
> 5) levels(95) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(string(@b, "%5.2f")) mlabposition(12) mlabsize(6pt) xsize(3.465) ysize(3)

. 
end of do-file

. doedit "C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\scripts\02_analysis.do"

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) scale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.1

. gr_edit gmetric_mult = 1.2

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(6-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(4-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(small) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].DragBy .0192344756311785 .3714312066533156

. gr_edit plotregion1.graph1.xaxis1.title.DragBy .1083514229419924 -8.234708143591391

. gr_edit plotregion1.graph1.xaxis1.title.DragBy 0 3.033839842375797

. gr_edit plotregion1.graph2.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(6-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(4-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(small) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].DragBy .0192344756311785 .3714312066533156

. gr_edit plotregion1.graph1.xaxis1.title.DragBy .1083514229419924 -8.234708143591391

. gr_edit plotregion1.graph1.xaxis1.title.DragBy 0 3.033839842375797

. gr_edit plotregion1.graph2.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.05

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(6-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(4-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(small) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].DragBy .0192344756311785 .3714312066533156

. gr_edit plotregion1.graph1.xaxis1.title.DragBy .1083514229419924 -8.234708143591391

. gr_edit plotregion1.graph1.xaxis1.title.DragBy 0 3.033839842375797

. gr_edit plotregion1.graph2.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d) 
>  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, 
> "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 
estimation result main1 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. *Panel A: Maintenance & Rules
. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new, robust

Iteration 0:   log pseudolikelihood = -53.058719  
Iteration 1:   log pseudolikelihood = -49.439039  
Iteration 2:   log pseudolikelihood = -49.428948  
Iteration 3:   log pseudolikelihood = -49.428947  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       6.68
                                                Prob > chi2       =     0.0354
Log pseudolikelihood = -49.428947               Pseudo R2         =     0.0684

----------------------------------------------------------------------------------------
                       |               Robust
fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .5686503   .3036249     1.87   0.061    -.0264436    1.163744
bs_maintenance_12m_new |   .5538217   .2943742     1.88   0.060     -.023141    1.130784
                 _cons |   -.238478   .2840203    -0.84   0.401    -.7951476    .3181915
----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new

----------------------------------------------------------------------------------------
                       |            Delta-method
                       |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |   .1929771   .0959755     2.01   0.044     .0048686    .3810855
bs_maintenance_12m_new |   .1879449   .0929958     2.02   0.043     .0056764    .3702133
----------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2') adec(2) word dec(2) replace
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. probit fs_maintenance_12m_new treatment bs_maintenance_12m_new $control, robust

Iteration 0:   log pseudolikelihood = -52.644113  
Iteration 1:   log pseudolikelihood = -45.117314  
Iteration 2:   log pseudolikelihood = -45.070712  
Iteration 3:   log pseudolikelihood =  -45.07068  
Iteration 4:   log pseudolikelihood =  -45.07068  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =      13.04
                                                Prob > chi2       =     0.0711
Log pseudolikelihood =  -45.07068               Pseudo R2         =     0.1439

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .6446241    .334522     1.93   0.054    -.0110269    1.300275
 bs_maintenance_12m_new |    .442477   .3158484     1.40   0.161    -.1765746    1.061529
                  No_HH |   .0000721   .0014733     0.05   0.961    -.0028155    .0029596
               FES_site |   .2549761   .3465333     0.74   0.462    -.4242168    .9341689
               Shar_Lit |   .0223016   .0197229     1.13   0.258    -.0163545    .0609578
              Shar_SCST |   -.020116   .0091652    -2.19   0.028    -.0380794   -.0021525
fs_dam_used_farming_new |  -.0427218   .3216812    -0.13   0.894    -.6732054    .5877618
                  _cons |   .0599992   1.473972     0.04   0.968    -2.828932    2.948931
-----------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_maintenance_12m_new]No_HH = 0
 ( 2)  [fs_maintenance_12m_new]FES_site = 0
 ( 3)  [fs_maintenance_12m_new]Shar_Lit = 0
 ( 4)  [fs_maintenance_12m_new]Shar_SCST = 0
 ( 5)  [fs_maintenance_12m_new]fs_dam_used_farming_new = 0

           chi2(  5) =    8.47
         Prob > chi2 =    0.1320

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
dy/dx w.r.t. : treatment bs_maintenance_12m_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |   .2010772   .0958373     2.10   0.036     .0132395    .3889148
 bs_maintenance_12m_new |   .1380216   .0943051     1.46   0.143     -.046813    .3228561
                  No_HH |   .0000225   .0004597     0.05   0.961    -.0008785    .0009235
               FES_site |   .0795345   .1071444     0.74   0.458    -.1304646    .2895336
               Shar_Lit |   .0069565   .0060276     1.15   0.248    -.0048574    .0187705
              Shar_SCST |  -.0062748   .0026519    -2.37   0.018    -.0114724   -.0010771
fs_dam_used_farming_new |  -.0133262    .100369    -0.13   0.894    -.2100458    .1833934
-----------------------------------------------------------------------------------------

. est store main1

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new, robust

Iteration 0:   log pseudolikelihood = -51.599338  
Iteration 1:   log pseudolikelihood = -51.386211  
Iteration 2:   log pseudolikelihood = -51.386165  
Iteration 3:   log pseudolikelihood = -51.386165  

Probit regression                               Number of obs     =         83
                                                Wald chi2(2)      =       0.43
                                                Prob > chi2       =     0.8079
Log pseudolikelihood = -51.386165               Pseudo R2         =     0.0041

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0828411   .3106302     0.27   0.790     -.525983    .6916651
bs_dam_maintenance_rule_new |    .237315   .3898897     0.61   0.543    -.5268548    1.001485
                      _cons |   -.581681    .266548    -2.18   0.029    -1.104105   -.0592565
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0292277   .1094712     0.27   0.789     -.185332    .2437874
bs_dam_maintenance_rule_new |   .0837286   .1366674     0.61   0.540    -.1841345    .3515918
---------------------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. probit fs_dam_maintenance_rule_new treatment bs_dam_maintenance_rule_new $control, robust

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -47.858142  
Iteration 2:   log pseudolikelihood = -47.840102  
Iteration 3:   log pseudolikelihood = -47.840096  
Iteration 4:   log pseudolikelihood = -47.840096  

Probit regression                               Number of obs     =         82
                                                Wald chi2(7)      =       3.70
                                                Prob > chi2       =     0.8135
Log pseudolikelihood = -47.840096               Pseudo R2         =     0.0513

---------------------------------------------------------------------------------------------
                            |               Robust
fs_dam_maintenance_rule_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .1317343   .3391044     0.39   0.698    -.5328982    .7963667
bs_dam_maintenance_rule_new |   .2178599   .4191106     0.52   0.603    -.6035818    1.039302
                      No_HH |  -.0022962    .001682    -1.37   0.172     -.005593    .0010005
                   FES_site |   .0929715   .3105338     0.30   0.765    -.5156636    .7016066
                   Shar_Lit |   .0006083   .0189441     0.03   0.974    -.0365214     .037738
                  Shar_SCST |  -.0041951   .0084126    -0.50   0.618    -.0206835    .0122934
    fs_dam_used_farming_new |  -.4083287   .3399753    -1.20   0.230    -1.074668    .2580106
                      _cons |   .1359511   1.307531     0.10   0.917    -2.426762    2.698664
---------------------------------------------------------------------------------------------

. local R2 = e(r2_p)

. testparm $control

 ( 1)  [fs_dam_maintenance_rule_new]No_HH = 0
 ( 2)  [fs_dam_maintenance_rule_new]FES_site = 0
 ( 3)  [fs_dam_maintenance_rule_new]Shar_Lit = 0
 ( 4)  [fs_dam_maintenance_rule_new]Shar_SCST = 0
 ( 5)  [fs_dam_maintenance_rule_new]fs_dam_used_farming_new = 0

           chi2(  5) =    3.52
         Prob > chi2 =    0.6201

. local F1 = r(p)

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(fs_dam_maintenance_rule_new), predict()
dy/dx w.r.t. : treatment bs_dam_maintenance_rule_new No_HH FES_site Shar_Lit Shar_SCST fs_dam_used_farming_new

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                  treatment |   .0438927   .1127663     0.39   0.697    -.1771253    .2649107
bs_dam_maintenance_rule_new |    .072589   .1385918     0.52   0.600    -.1990459     .344224
                      No_HH |  -.0007651   .0005388    -1.42   0.156    -.0018211     .000291
                   FES_site |   .0309773   .1029149     0.30   0.763    -.1707321    .2326867
                   Shar_Lit |   .0002027   .0063116     0.03   0.974    -.0121679    .0125733
                  Shar_SCST |  -.0013978   .0027801    -0.50   0.615    -.0068467    .0040511
    fs_dam_used_farming_new |  -.1360516   .1097955    -1.24   0.215    -.3512469    .0791437
---------------------------------------------------------------------------------------------

. est store main2

. outreg2 using "$working_ANALYSIS/results/tables/tableS2", addstat("Pseudo R2", `R2', "F-Test: Controls", `F1') adec(2) word dec(2) append
C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/tableS2.rtf
dir : seeout

. 
. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d) 
>  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, 
> "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size(8pt) ) msymbol(
> d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.0
> 5, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size(8pt) ) msymbol(
> d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.0
> 5, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. 
. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size(8pt) ) msymbol(
> d)  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", co
> nd(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effect", span pos
> (11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d) 
>  xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(
> @pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(2) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(1.7) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.05

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(6-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(4-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(small) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].DragBy .0192344756311785 .3714312066533156

. gr_edit plotregion1.graph1.xaxis1.title.DragBy .1083514229419924 -8.234708143591391

. gr_edit plotregion1.graph1.xaxis1.title.DragBy 0 3.033839842375797

. gr_edit plotregion1.graph2.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. probit fs_maintenance_12m_new bs_maintenance_12m_new $control $session_composition , robust

Iteration 0:   log pseudolikelihood = -32.542487  
Iteration 1:   log pseudolikelihood = -25.984584  
Iteration 2:   log pseudolikelihood = -25.593172  
Iteration 3:   log pseudolikelihood = -25.588984  
Iteration 4:   log pseudolikelihood = -25.588983  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      13.36
                                                Prob > chi2       =     0.2044
Log pseudolikelihood = -25.588983               Pseudo R2         =     0.2137

-----------------------------------------------------------------------------------------
                        |               Robust
 fs_maintenance_12m_new |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
 bs_maintenance_12m_new |   .0870289    .431325     0.20   0.840    -.7583526    .9324104
                  No_HH |   .0031772   .0026263     1.21   0.226    -.0019701    .0083246
               FES_site |   .8498988   .4518964     1.88   0.060    -.0358018    1.735599
               Shar_Lit |   .0326581   .0269368     1.21   0.225     -.020137    .0854532
              Shar_SCST |  -.0115717   .0152878    -0.76   0.449    -.0415352    .0183919
fs_dam_used_farming_new |   .4207145   .3908315     1.08   0.282    -.3453012     1.18673
  share_female_percent2 |   .0385709   .0173661     2.22   0.026     .0045341    .0726078
              leader2_2 |   .2671443   .4861174     0.55   0.583    -.6856284    1.219917
              leader2_3 |  -.3085892   .5456724    -0.57   0.572    -1.378087     .760909
           d_illiterate |   .4971537    .418359     1.19   0.235    -.3228148    1.317122
                  _cons |  -2.420145   2.158114    -1.12   0.262     -6.64997     1.80968
-----------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100))  vsquish

Predictive margins                              Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(fs_maintenance_12m_new), predict()
1._at        : share_fema~2    =           0
2._at        : share_fema~2    =          10
3._at        : share_fema~2    =          20
4._at        : share_fema~2    =          30
5._at        : share_fema~2    =          40
6._at        : share_fema~2    =          50
7._at        : share_fema~2    =          60
8._at        : share_fema~2    =          70
9._at        : share_fema~2    =          80
10._at       : share_fema~2    =          90
11._at       : share_fema~2    =         100

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .467856   .1272335     3.68   0.000     .2184829    .7172291
          2  |   .5909126    .085153     6.94   0.000     .4240157    .7578095
          3  |   .7060441   .0571872    12.35   0.000     .5939592    .8181291
          4  |   .8041368   .0562712    14.29   0.000     .6938473    .9144263
          5  |   .8799598   .0606909    14.50   0.000     .7610079    .9989118
          6  |   .9328615   .0556124    16.77   0.000     .8238631     1.04186
          7  |   .9659868   .0425981    22.68   0.000     .8824961    1.049478
          8  |   .9844976   .0276249    35.64   0.000     .9303538    1.038641
          9  |   .9936815   .0153056    64.92   0.000     .9636831     1.02368
         10  |   .9977089   .0072816   137.02   0.000     .9834371    1.011981
         11  |   .9992642   .0029827   335.02   0.000     .9934183     1.00511
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:B } Games villages only: Female participation", span pos(11) size()) xtitle("Share of women participati
> ng in games (percent)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted maintenance") ///
>                 recastci(rarea) ciopts(fcolor(%60) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%30) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Percent", axis(2)) legend(order(2 "Pred
> icted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(black) horizontal(left) vertical(middl
> e) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative
> ) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow_pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0)
>  allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) linestyle( width( sztype(relative) val(.1
> 5) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. gr save "$working_ANALYSIS/results/intermediate/figure1_b.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_b.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. coefplot (main1) (main2),   keep(treatment)  coeflabels(treatment  = "Games Intervention") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Treatment effects", span po
> s(11) size()) xtitle("Regression estimated impact relative to control villages in pp")  legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1) size() ) msymbol(d)
>   xla(-.2 "-20" 0 "0" .2 "20" .4 "40") levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond
> (@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4140_000000.tmp"

. 
. gr combine  "$working_ANALYSIS/results/intermediate/figure1_a.gph" "$working_ANALYSIS/results/intermediate/figure1_b.gph", rows(1) saving("$working_ANALYSIS\results\inter
> mediate\figure1.gph", replace) xsize(3.465) ysize(1.7) iscale(1.05)
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr display

. gr_edit style.editstyle margin(zero) editcopy

. gr_edit gmetric_mult = 1.05

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(6-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(4-pt) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].style.editstyle size(small) editcopy

. gr_edit plotregion1.graph2.plotregion1.added_text[1].DragBy .0192344756311785 .3714312066533156

. gr_edit plotregion1.graph1.xaxis1.title.DragBy .1083514229419924 -8.234708143591391

. gr_edit plotregion1.graph1.xaxis1.title.DragBy 0 3.033839842375797

. gr_edit plotregion1.graph2.style.editstyle boxstyle(shadestyle(color(none))) editcopy

. gr save "$working_ANALYSIS\results\intermediate\figure1.gph", replace
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\intermediate\figure1.gph saved)

. gr export "$working_ANALYSIS\results\figures\figure1.tif", replace width(3465)
(file C:\Users\istei\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\figure1.tif written in TIFF format)

. 
end of do-file

. exit, clear
