-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2023.03.23-11.16.21.log.txt
  log type:  text
 opened on:  23 Mar 2023, 11:16:21

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 23 Mar 2023 11:16:21

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. 
. alpha game_propose_rule game_agree_rule game_reject_rule

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. egen total_rule_communication = rowtotal(game_propose_rule game_agree_rule game_reject_rule) if treatment==1
(28 missing values generated)

. egen z_rule_communication = std(total_rule_communication)
(28 missing values generated)

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. gen exp_shared_formal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_formal = 1 if survey_share_exp_comm_meet_FS==1 | survey_share_exp_vc_meet_FS==1
(24 real changes made)

. 
. gen exp_shared_informal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_informal = 1 if survey_share_exp_family_FS==1 | survey_share_exp_friends_FS==1 | survey_share_exp_others_FS==1
(35 real changes made)

. 
. 
. *white person part of the facilitation team
. gen lara = regexm(game_Facilitationteam, "Lara")

. gen thomas = regexm(game_Facilitationteam, "Thomas")

. gen sonja = regexm(game_Facilitationteam, "Sonja")

. gen white_present = 0 if treatment==1
(28 missing values generated)

. replace white_present = 1 if lara==1 | thomas==1 | sonja==1
(12 real changes made)

. lab var white_present "White researcher present during games (=1)"

. 
. * Setting globals
. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS 

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS share_participants_primary

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS share_participants_primary

. global game                     white_present game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication  exp_shared_formal exp_shared_informal

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS survey_maint_rule_FS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -27.772203  
Iteration 2:   log pseudolikelihood = -27.674003  
Iteration 3:   log pseudolikelihood = -27.673777  
Iteration 4:   log pseudolikelihood = -27.673777  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =      12.02
                                                Prob > chi2       =     0.1000
Log pseudolikelihood = -27.673777               Pseudo R2         =     0.1740

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0495933   .3996518     0.12   0.901    -.7337098    .8328964
        survey_maint_rule_FS |   1.103942   .4485138     2.46   0.014     .2248711    1.983013
                       No_HH |   .0011422   .0024626     0.46   0.643    -.0036843    .0059687
                    FES_site |    .475338   .4422249     1.07   0.282    -.3914069    1.342083
                    Shar_Lit |   .0389017   .0272902     1.43   0.154    -.0145861    .0923895
                   Shar_SCST |  -.0054867   .0127311    -0.43   0.666    -.0304391    .0194658
survey_dam_for_irrigation_FS |   .5416438   .3902332     1.39   0.165    -.2231992    1.306487
                       _cons |  -1.992883   2.118844    -0.94   0.347    -6.145741    2.159974
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. test $village

 ( 1)  [survey_maint_2017_FS]No_HH = 0
 ( 2)  [survey_maint_2017_FS]FES_site = 0
 ( 3)  [survey_maint_2017_FS]Shar_Lit = 0
 ( 4)  [survey_maint_2017_FS]Shar_SCST = 0
 ( 5)  [survey_maint_2017_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    5.82
         Prob > chi2 =    0.3241

. local F= r(p)  

. eststo maint1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS survey_maint_rule_FS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0137106   .1103654     0.12   0.901    -.2026017    .2300228
        survey_maint_rule_FS |   .3051956   .1175603     2.60   0.009     .0747815    .5356096
                       No_HH |   .0003158   .0006809     0.46   0.643    -.0010188    .0016504
                    FES_site |   .1314118     .11726     1.12   0.262    -.0984135    .3612372
                    Shar_Lit |   .0107548   .0072035     1.49   0.135    -.0033638    .0248733
                   Shar_SCST |  -.0015168   .0034921    -0.43   0.664    -.0083612    .0053275
survey_dam_for_irrigation_FS |   .1497427   .1030294     1.45   0.146    -.0521912    .3516767
----------------------------------------------------------------------------------------------

. 
end of do-file

. pwcorr survey_maint_rule_FS survey_maint_2017_FS

             | su~le_FS sur~7_FS
-------------+------------------
survey~le_FS |   1.0000 
survey_~7_FS |   0.1766   1.0000 

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS survey_maint_rule_FS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.917931  
Iteration 2:   log pseudolikelihood = -29.839247  
Iteration 3:   log pseudolikelihood = -29.838957  
Iteration 4:   log pseudolikelihood = -29.838957  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       7.92
                                                Prob > chi2       =     0.2442
Log pseudolikelihood = -29.838957               Pseudo R2         =     0.1094

--------------------------------------------------------------------------------------------
                           |               Robust
      survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
       survey_maint_12m_BS |   .4272817   .3937003     1.09   0.278    -.3443567     1.19892
      survey_maint_rule_FS |    .720408   .4614664     1.56   0.118    -.1840495    1.624865
  share_female_percent3_BS |   .1869985   .1292257     1.45   0.148    -.0662793    .4402764
              leader2_2_BS |  -.1360801   .4446621    -0.31   0.760    -1.007602    .7354415
              leader2_3_BS |  -.4131444   .4938699    -0.84   0.403    -1.381112    .5548228
share_participants_primary |   -.146222   .1112574    -1.31   0.189    -.3642825    .0718385
                     _cons |   .7475437   .7266435     1.03   0.304    -.6766514    2.171739
--------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. eststo maint2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS survey_maint_rule_FS share_female_percent3_BS leader2_2_BS leader2_3_BS share_participants_primary

--------------------------------------------------------------------------------------------
                           |            Delta-method
                           |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
       survey_maint_12m_BS |   .1290415     .11782     1.10   0.273    -.1018814    .3599644
      survey_maint_rule_FS |   .2175673   .1292287     1.68   0.092    -.0357164     .470851
  share_female_percent3_BS |   .0564746   .0386292     1.46   0.144    -.0192372    .1321864
              leader2_2_BS |   -.041097   .1355499    -0.30   0.762    -.3067698    .2245759
              leader2_3_BS |   -.124772    .148352    -0.84   0.400    -.4155365    .1659926
share_participants_primary |  -.0441599   .0326378    -1.35   0.176    -.1081289    .0198091
--------------------------------------------------------------------------------------------

. 
end of do-file

. sem (leader2_3_BS -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_rule_FS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (surve
> y_maint_rule_FS -> survey_maint_2017_FS, ), nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS

Fitting target model:

Iteration 0:   log likelihood = -201.50843  
Iteration 1:   log likelihood = -201.50843  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -201.50843

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0856159   .0340274     2.52   0.012     .0189233    .1523084
                         _cons |   .1117571   .1021938     1.09   0.274    -.0885391    .3120533
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0217849   .0351956     0.62   0.536    -.0471972    .0907669
          survey_maint_rule_FS |   .2314666   .1310111     1.77   0.077    -.0253105    .4882437
                         _cons |   .5865351   .1012547     5.79   0.000     .3880794    .7849907
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1959595   .0370329                       .135302    .2838103
    var(e.survey_maint_2017_FS)|   .1883522   .0355952                      .1300495    .2727926
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(2)   =      0.95, Prob > chi2 = 0.6226
. 
. estat teffects


Direct effects
--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |   .0856159   .0340274     2.52   0.012     .0189233    .1523084
              leader2_3_BS |          0  (no path)
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |   .0217849   .0351956     0.62   0.536    -.0471972    .0907669
      survey_maint_rule_FS |   .2314666   .1310111     1.77   0.077    -.0253105    .4882437
              leader2_3_BS |          0  (no path)
--------------------------------------------------------------------------------------------


Indirect effects
--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |          0  (no path)
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |          0  (no path)
              leader2_3_BS |   .1619109   .0767599     2.11   0.035     .0114642    .3123575
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |   .0198172   .0137057     1.45   0.148    -.0070456      .04668
      survey_maint_rule_FS |          0  (no path)
              leader2_3_BS |    .078675   .0679377     1.16   0.247    -.0544805    .2118305
--------------------------------------------------------------------------------------------


Total effects
--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |   .0856159   .0340274     2.52   0.012     .0189233    .1523084
              leader2_3_BS |   .1619109   .0767599     2.11   0.035     .0114642    .3123575
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |   .0416021   .0342776     1.21   0.225    -.0255807    .1087848
      survey_maint_rule_FS |   .2314666   .1310111     1.77   0.077    -.0253105    .4882437
              leader2_3_BS |    .078675   .0679377     1.16   0.247    -.0544805    .2118305
--------------------------------------------------------------------------------------------

. estat gof

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Likelihood ratio     |
          chi2_ms(2) |      0.948   model vs. saturated
            p > chi2 |      0.623
          chi2_bs(6) |     24.704   baseline vs. saturated
            p > chi2 |      0.000
----------------------------------------------------------------------------

. 
. tab game_edu_fem_prim_vill

     Sum of |
    females |
  that have |
    primary |
  education |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       14.29       14.29
          1 |         13       23.21       37.50
          2 |         11       19.64       57.14
          3 |          9       16.07       73.21
          4 |          6       10.71       83.93
          5 |          5        8.93       92.86
          6 |          1        1.79       94.64
          7 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. bys Village: sum game_edu_fem_illit_vill

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aouri Rayat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atarchuha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aurai Mal.(Ourai Mal.)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Baghraudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bamhani Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Banijagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bariha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Barkheda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Batwar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhapsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawartal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhimpuri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Birsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Budhanwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chandiya Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           2           .          2          2

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Changariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chatuwakhar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chouranga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Danitola

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Deori

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dhamangaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dharampuri Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dilwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dudka

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           2           .          2          2

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungaria

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungariya Ramnagar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungravt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Fonk

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ghont

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gubri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunehara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhagul

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhulup

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Kalan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Khurd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kata Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katajar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khalaudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khamrauti

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khatiya Narangi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khirahani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kosampani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kurwahi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Lohta F.V.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Magdha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Malara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manikpur Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manoharpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mataval

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Medhatal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           2           .          2          2

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mubala_Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Muhad

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mulwalasani Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Newsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Padariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Patpara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rajo Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rata

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ratanpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Samaiya Bhagpur FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Saradoli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarasdoli

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarhi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sautia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Shahapur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Taktuwa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Thonda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Tilari

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Umariya FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Vishanpura Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_edu_f.. |          0


. tab game_edu_fem_illit_vill

     Sum of |
    females |
   that are |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         48       85.71       85.71
          1 |          5        8.93       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. egen number_educated_women = rowtotal(game_edu_fem_sec_vill game_edu_fem_uni_vill)

. tab number_educated_women

number_educ |
 ated_women |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         46       54.76       54.76
          1 |          1        1.19       55.95
          2 |         22       26.19       82.14
          3 |          1        1.19       83.33
          4 |          8        9.52       92.86
          6 |          3        3.57       96.43
          8 |          1        1.19       97.62
         10 |          1        1.19       98.81
         14 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab game_no_leader_fem_vill

     Sum of |
    females |
that are no |
 leaders in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
          1 |          5        8.93       21.43
          2 |          8       14.29       35.71
          3 |         11       19.64       55.36
          4 |          7       12.50       67.86
          5 |         10       17.86       85.71
          6 |          4        7.14       92.86
          7 |          2        3.57       96.43
          9 |          1        1.79       98.21
         13 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. gen share_educated_women = number_educated_women/ game_total_fem
(31 missing values generated)

. tab share_educated_women

share_educa |
  ted_women |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         15       28.30       28.30
        .25 |          1        1.89       30.19
   .3333333 |          3        5.66       35.85
         .4 |          5        9.43       45.28
   .4285714 |          1        1.89       47.17
         .5 |          4        7.55       54.72
   .6666667 |          5        9.43       64.15
         .8 |          3        5.66       69.81
          1 |          7       13.21       83.02
        1.2 |          2        3.77       86.79
   1.333333 |          2        3.77       90.57
   1.666667 |          1        1.89       92.45
          2 |          4        7.55      100.00
------------+-----------------------------------
      Total |         53      100.00

. drop share_educated_women

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gen share_educated_women = number_educated_women / game_total_fem
(31 missing values generated)

. 
end of do-file

. help egen

. drop number_educated_women

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. egen total_rule_communication = rowtotal(game_propose_rule game_agree_rule game_reject_rule) if treatment==1
(28 missing values generated)

. egen z_rule_communication = std(total_rule_communication)
(28 missing values generated)

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. gen exp_shared_formal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_formal = 1 if survey_share_exp_comm_meet_FS==1 | survey_share_exp_vc_meet_FS==1
(24 real changes made)

. 
. gen exp_shared_informal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_informal = 1 if survey_share_exp_family_FS==1 | survey_share_exp_friends_FS==1 | survey_share_exp_others_FS==1
(35 real changes made)

. 
. 
. *
. egen number_educated_women = rowmax(game_edu_fem_sec_vill game_edu_fem_uni_vill)
(28 missing values generated)

. gen share_educated_women = number_educated_women / game_total_fem
(31 missing values generated)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. tab share_educated_women

share_educa |
  ted_women |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         15       28.30       28.30
       .125 |          1        1.89       30.19
   .1666667 |          2        3.77       33.96
         .2 |          5        9.43       43.40
        .25 |          4        7.55       50.94
   .2857143 |          1        1.89       52.83
   .3333333 |          6       11.32       64.15
         .4 |          3        5.66       69.81
         .5 |          7       13.21       83.02
         .6 |          2        3.77       86.79
   .6666667 |          2        3.77       90.57
   .8333333 |          1        1.89       92.45
          1 |          4        7.55      100.00
------------+-----------------------------------
      Total |         53      100.00

. 
end of do-file

. sem (leader2_3_BS -> share_educated_women, ) (share_educated_women -> survey_maint_rule_FS, ) (share_educated_women -> survey_maint_2017_FS, ) (survey_maint_rule
> _FS -> survey_maint_2017_FS, ), nocapslatent
(31 observations with missing values excluded)

Endogenous variables

Observed:  share_educated_women survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS

Fitting target model:

Iteration 0:   log likelihood = -105.02267  
Iteration 1:   log likelihood = -105.02267  

Structural equation model                       Number of obs     =         53
Estimation method  = ml
Log likelihood     = -105.02267

--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_educated_women     |
              leader2_3_BS |  -.0879258   .0919331    -0.96   0.339    -.2681115    .0922598
                     _cons |     .33875   .0455309     7.44   0.000     .2495112    .4279888
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
      share_educated_women |  -.1655771     .22282    -0.74   0.457    -.6022963    .2711421
                     _cons |   .3921409   .0958278     4.09   0.000     .2043219      .57996
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
      share_educated_women |   .2731938   .2025292     1.35   0.177    -.1237562    .6701437
      survey_maint_rule_FS |   .2773306   .1242066     2.23   0.026     .0338901    .5207712
                     _cons |   .5361409    .099402     5.39   0.000     .3413166    .7309651
---------------------------+----------------------------------------------------------------
var(e.share_educated_women)|   .0829224   .0161083                      .0566656    .1213455
var(e.survey_maint_rule_FS)|   .2219665   .0431186                      .1516825    .3248175
var(e.survey_maint_2017_FS)|   .1814901   .0352558                      .1240226    .2655858
--------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(2)   =      0.13, Prob > chi2 = 0.9388
. 
. estat teffects


Direct effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |  -.0879258   .0919331    -0.96   0.339    -.2681115    .0922598
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |  -.1655771     .22282    -0.74   0.457    -.6022963    .2711421
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .2731938   .2025292     1.35   0.177    -.1237562    .6701437
  survey_maint_rule_FS |   .2773306   .1242066     2.23   0.026     .0338901    .5207712
          leader2_3_BS |          0  (no path)
----------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |          0  (no path)
          leader2_3_BS |   .0145585   .0248101     0.59   0.557    -.0340684    .0631855
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |  -.0459196   .0651272    -0.71   0.481    -.1735666    .0817273
  survey_maint_rule_FS |          0  (no path)
          leader2_3_BS |  -.0199833   .0279271    -0.72   0.474    -.0747193    .0347528
----------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |  -.0879258   .0919331    -0.96   0.339    -.2681115    .0922598
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |  -.1655771     .22282    -0.74   0.457    -.6022963    .2711421
          leader2_3_BS |   .0145585   .0248101     0.59   0.557    -.0340684    .0631855
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .2272742   .2107456     1.08   0.281    -.1857797     .640328
  survey_maint_rule_FS |   .2773306   .1242066     2.23   0.026     .0338901    .5207712
          leader2_3_BS |  -.0199833   .0279271    -0.72   0.474    -.0747193    .0347528
----------------------------------------------------------------------------------------

. tab game_total_all

      Total |
communicati |
      on in |
    village |
     during |
 discussion |
      slots |      Freq.     Percent        Cum.
------------+-----------------------------------
         15 |          1        1.79        1.79
         53 |          1        1.79        3.57
         60 |          1        1.79        5.36
         64 |          1        1.79        7.14
         67 |          1        1.79        8.93
         69 |          2        3.57       12.50
         70 |          1        1.79       14.29
         72 |          1        1.79       16.07
         75 |          1        1.79       17.86
         77 |          1        1.79       19.64
         79 |          1        1.79       21.43
         81 |          1        1.79       23.21
         83 |          1        1.79       25.00
         84 |          1        1.79       26.79
         85 |          2        3.57       30.36
         86 |          1        1.79       32.14
         89 |          2        3.57       35.71
         90 |          1        1.79       37.50
         92 |          1        1.79       39.29
         94 |          1        1.79       41.07
         95 |          1        1.79       42.86
         97 |          1        1.79       44.64
        102 |          1        1.79       46.43
        103 |          1        1.79       48.21
        106 |          1        1.79       50.00
        107 |          1        1.79       51.79
        108 |          2        3.57       55.36
        109 |          1        1.79       57.14
        111 |          2        3.57       60.71
        112 |          1        1.79       62.50
        121 |          1        1.79       64.29
        123 |          2        3.57       67.86
        126 |          1        1.79       69.64
        132 |          1        1.79       71.43
        133 |          2        3.57       75.00
        134 |          1        1.79       76.79
        137 |          1        1.79       78.57
        138 |          2        3.57       82.14
        140 |          1        1.79       83.93
        143 |          1        1.79       85.71
        145 |          1        1.79       87.50
        149 |          1        1.79       89.29
        153 |          1        1.79       91.07
        155 |          1        1.79       92.86
        159 |          1        1.79       94.64
        166 |          1        1.79       96.43
        169 |          1        1.79       98.21
        174 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. egen total_rule_communication = rowtotal(game_propose_rule game_agree_rule game_reject_rule) if treatment==1
(28 missing values generated)

. egen z_rule_communication = std(total_rule_communication)
(28 missing values generated)

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. gen exp_shared_formal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_formal = 1 if survey_share_exp_comm_meet_FS==1 | survey_share_exp_vc_meet_FS==1
(24 real changes made)

. 
. gen exp_shared_informal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_informal = 1 if survey_share_exp_family_FS==1 | survey_share_exp_friends_FS==1 | survey_share_exp_others_FS==1
(35 real changes made)

. 
. 
. *
. egen number_educated_women = rowmax(game_edu_fem_sec_vill game_edu_fem_uni_vill)
(28 missing values generated)

. gen share_educated_women = number_educated_women / 14
(28 missing values generated)

. tab share_educated_women

share_educa |
  ted_women |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         18       32.14       32.14
   .0714286 |         23       41.07       73.21
   .1428571 |          9       16.07       89.29
   .2142857 |          3        5.36       94.64
   .2857143 |          1        1.79       96.43
   .3571429 |          1        1.79       98.21
         .5 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. 
end of do-file

. sem (leader2_3_BS -> share_educated_women, ) (share_educated_women -> survey_maint_rule_FS, ) (share_educated_women -> survey_maint_2017_FS, ) (survey_maint_rule
> _FS -> survey_maint_2017_FS, ), nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_educated_women survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS

Fitting target model:

Iteration 0:   log likelihood = -44.845428  
Iteration 1:   log likelihood = -44.845428  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -44.845428

--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_educated_women     |
              leader2_3_BS |   .0477894   .0292511     1.63   0.102    -.0095417    .1051205
                     _cons |   .0730897   .0140935     5.19   0.000     .0454669    .1007125
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
      share_educated_women |   .9672727   .6469662     1.50   0.135    -.3007578    2.235303
                     _cons |        .24   .0819249     2.93   0.003     .0794302    .4005698
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
      share_educated_women |   .9058823   .6155537     1.47   0.141    -.3005808    2.112345
      survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
                     _cons |   .5668731   .0820848     6.91   0.000     .4059897    .7277564
---------------------------+----------------------------------------------------------------
var(e.share_educated_women)|    .008541   .0016141                      .0058972      .01237
var(e.survey_maint_rule_FS)|   .2097403   .0396372                      .1448171    .3037692
var(e.survey_maint_2017_FS)|   .1825796   .0345043                      .1260638    .2644321
--------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(2)   =      0.53, Prob > chi2 = 0.7662
. 
. estat teffects


Direct effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |   .0477894   .0292511     1.63   0.102    -.0095417    .1051205
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |   .9672727   .6469662     1.50   0.135    -.3007578    2.235303
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .9058823   .6155537     1.47   0.141    -.3005808    2.112345
  survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
          leader2_3_BS |          0  (no path)
----------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |          0  (no path)
          leader2_3_BS |   .0462254   .0419103     1.10   0.270    -.0359172     .128368
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .2141176   .1872274     1.14   0.253    -.1528413    .5810766
  survey_maint_rule_FS |          0  (no path)
          leader2_3_BS |   .0535242   .0441846     1.21   0.226    -.0330762    .1401245
----------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |   .0477894   .0292511     1.63   0.102    -.0095417    .1051205
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |   .9672727   .6469662     1.50   0.135    -.3007578    2.235303
          leader2_3_BS |   .0462254   .0419103     1.10   0.270    -.0359172     .128368
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |       1.12   .6203811     1.81   0.071    -.0959246    2.335925
  survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
          leader2_3_BS |   .0535242   .0441846     1.21   0.226    -.0330762    .1401245
----------------------------------------------------------------------------------------

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. egen total_rule_communication = rowtotal(game_propose_rule game_agree_rule game_reject_rule) if treatment==1
(28 missing values generated)

. egen z_rule_communication = std(total_rule_communication)
(28 missing values generated)

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. gen exp_shared_formal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_formal = 1 if survey_share_exp_comm_meet_FS==1 | survey_share_exp_vc_meet_FS==1
(24 real changes made)

. 
. gen exp_shared_informal = 0 if treatment==1
(28 missing values generated)

. replace exp_shared_informal = 1 if survey_share_exp_family_FS==1 | survey_share_exp_friends_FS==1 | survey_share_exp_others_FS==1
(35 real changes made)

. 
. 
. *
. egen number_educated_women = rowmax(game_edu_fem_sec_vill game_edu_fem_uni_vill)
(28 missing values generated)

. gen share_educated_women = (number_educated_women / 14)*10
(28 missing values generated)

. tab share_educated_women

share_educa |
  ted_women |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         18       32.14       32.14
   .7142857 |         23       41.07       73.21
   1.428571 |          9       16.07       89.29
   2.142857 |          3        5.36       94.64
   2.857143 |          1        1.79       96.43
   3.571429 |          1        1.79       98.21
          5 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. 
end of do-file

. sem (leader2_3_BS -> share_educated_women, ) (share_educated_women -> survey_maint_rule_FS, ) (share_educated_women -> survey_maint_2017_FS, ) (survey_maint_rule
> _FS -> survey_maint_2017_FS, ), nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_educated_women survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS

Fitting target model:

Iteration 0:   log likelihood = -173.79019  
Iteration 1:   log likelihood = -173.79019  (backed up)

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -173.79019

--------------------------------------------------------------------------------------------
                           |                 OIM
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_educated_women     |
              leader2_3_BS |   .4778942   .2925111     1.63   0.102     -.095417    1.051205
                     _cons |    .730897   .1409354     5.19   0.000     .4546687    1.007125
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
      share_educated_women |   .0967273   .0646966     1.50   0.135    -.0300758    .2235303
                     _cons |        .24   .0819249     2.93   0.003     .0794302    .4005698
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
      share_educated_women |   .0905882   .0615554     1.47   0.141    -.0300581    .2112345
      survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
                     _cons |   .5668731   .0820848     6.91   0.000     .4059897    .7277564
---------------------------+----------------------------------------------------------------
var(e.share_educated_women)|   .8540996   .1614097                       .589721    1.237002
var(e.survey_maint_rule_FS)|   .2097403   .0396372                      .1448171    .3037692
var(e.survey_maint_2017_FS)|   .1825796   .0345043                      .1260638    .2644321
--------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(2)   =      0.53, Prob > chi2 = 0.7662
. 
. estat teffects


Direct effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |   .4778942   .2925111     1.63   0.102     -.095417    1.051205
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |   .0967273   .0646966     1.50   0.135    -.0300758    .2235303
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .0905882   .0615554     1.47   0.141    -.0300581    .2112345
  survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
          leader2_3_BS |          0  (no path)
----------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |          0  (no path)
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |          0  (no path)
          leader2_3_BS |   .0462254   .0419103     1.10   0.270    -.0359172     .128368
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |   .0214118   .0187227     1.14   0.253    -.0152841    .0581077
  survey_maint_rule_FS |          0  (no path)
          leader2_3_BS |   .0535242   .0441846     1.21   0.226    -.0330762    .1401245
----------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------
                       |                 OIM
                       |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
Structural             |
  share_educated_women |
          leader2_3_BS |   .4778942   .2925111     1.63   0.102     -.095417    1.051205
  ---------------------+----------------------------------------------------------------
  survey_maint_rule_FS |
  share_educated_women |   .0967273   .0646966     1.50   0.135    -.0300758    .2235303
          leader2_3_BS |   .0462254   .0419103     1.10   0.270    -.0359172     .128368
  ---------------------+----------------------------------------------------------------
  survey_maint_2017_FS |
  share_educated_women |       .112   .0620381     1.81   0.071    -.0095925    .2335925
  survey_maint_rule_FS |   .2213622   .1246784     1.78   0.076    -.0230029    .4657274
          leader2_3_BS |   .0535242   .0441846     1.21   0.226    -.0330762    .1401245
----------------------------------------------------------------------------------------

.  mata: sg__global.signal("SEM_1", "Selected", `"4"', "select objects")

.  mata: sg__global.signal("SEM_1", "SelectionsDlg", `""', "")

.  mata: sg__global.signal("SEM_1", "ModeChange", `"GeneralizedResponseVariable"', "")

.  mata: sg__global.signal("SEM_1", "AddObserved", `"21904.637492 5141.737427 21904.637492 5141.737427 1"', "Add observed variable")

.  mata: sg__global.signal("SEM_1", "Selected", `""', "select objects")

.  mata: sg__global.signal("SEM_1", "AddObserved", `"7775.310255 15864.141084 7775.310255 15864.141084 1"', "Add observed variable")

.  mata: sg__global.signal("SEM_1", "ModeChange", `"Pointer"', "")

.  mata: sg__global.signal("SEM_1", "SelectionsDlg", `""', "")

. note: survey_main_rule_FS not in dataset
 
.  
.  
. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS 

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS share_participants_primary

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS share_participants_primary

. global game                     white_present game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication  exp_shared_formal exp_shared_informal

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS, ) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS ->, probit ) (survey_maint_2017_FS <- survey_main
> t_rule_FS leader2_3_BS share_female_percent3_BS  $village , probit ) , nocapslatent
invalid path specification;
'->' found where options expected
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS, ) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS, probit ) (survey_maint_2017_FS <- survey_maint_r
> ule_FS leader2_3_BS share_female_percent3_BS  $village , probit ) , nocapslatent
option probit not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gsem (share_female_percent3_BS <- leader2_3_BS, ) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS, probit ) (survey_maint_2017_FS <- survey_maint_
> rule_FS leader2_3_BS share_female_percent3_BS  $village , probit ) , nocapslatent

Iteration 0:   log likelihood = -163.33763  
Iteration 1:   log likelihood = -163.00107  
Iteration 2:   log likelihood = -163.00014  
Iteration 3:   log likelihood = -163.00014  

Generalized structural equation model           Number of obs     =         56

Response       : share_female_pe~3_BS
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Bernoulli
Link           : probit

Response       : survey_maint_2017_FS
Family         : Bernoulli
Link           : probit

Log likelihood = -163.00014

-------------------------------------------------------------------------------------------------
                                |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
share_female_percent3_BS        |
                   leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                          _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
--------------------------------+----------------------------------------------------------------
survey_maint_rule_FS            |
                   leader2_3_BS |  -.2936136   .4733866    -0.62   0.535    -1.221434    .6342071
       share_female_percent3_BS |    .295021   .1298253     2.27   0.023      .040568    .5494741
                          _cons |  -1.149033   .3524275    -3.26   0.001    -1.839779    -.458288
--------------------------------+----------------------------------------------------------------
survey_maint_2017_FS            |
           survey_maint_rule_FS |   .9859893   .5285633     1.87   0.062    -.0499757    2.021954
                   leader2_3_BS |  -.2837203   .5627332    -0.50   0.614    -1.386657    .8192165
       share_female_percent3_BS |   .1643802   .1653037     0.99   0.320     -.159609    .4883695
                          No_HH |   .0010811   .0023854     0.45   0.650    -.0035942    .0057564
                       FES_site |   .4894969   .4424438     1.11   0.269    -.3776769    1.356671
                       Shar_Lit |   .0361788   .0258317     1.40   0.161    -.0144504    .0868079
                      Shar_SCST |  -.0075181   .0125875    -0.60   0.550    -.0321891    .0171528
   survey_dam_for_irrigation_FS |   .6021932    .435688     1.38   0.167    -.2517396    1.456126
                          _cons |  -1.973099   1.845995    -1.07   0.285    -5.591184    1.644985
--------------------------------+----------------------------------------------------------------
 var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
-------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gsem (game_no_leader_fem_vill <- leader2_3_BS, ) (survey_maint_rule_FS <- leader2_3_BS game_no_leader_fem_vill, probit ) (survey_maint_2017_FS <- survey_maint_ru
> le_FS leader2_3_BS game_no_leader_fem_vill  $village , probit ) , nocapslatent

Iteration 0:   log likelihood = -182.18008  
Iteration 1:   log likelihood = -181.84351  
Iteration 2:   log likelihood = -181.84258  
Iteration 3:   log likelihood = -181.84258  

Generalized structural equation model           Number of obs     =         56

Response       : game_no_leader_fem~l
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Bernoulli
Link           : probit

Response       : survey_maint_2017_FS
Family         : Bernoulli
Link           : probit

Log likelihood = -181.84258

------------------------------------------------------------------------------------------------
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
game_no_leader_fem_vill        |
                  leader2_3_BS |   2.647585   .6842757     3.87   0.000     1.306429    3.988741
                         _cons |   2.813953   .3296923     8.54   0.000     2.167768    3.460139
-------------------------------+----------------------------------------------------------------
survey_maint_rule_FS           |
                  leader2_3_BS |  -.2936136   .4733866    -0.62   0.535    -1.221434    .6342071
       game_no_leader_fem_vill |   .2107293   .0927324     2.27   0.023     .0289772    .3924815
                         _cons |  -1.149033   .3524275    -3.26   0.001    -1.839779    -.458288
-------------------------------+----------------------------------------------------------------
survey_maint_2017_FS           |
          survey_maint_rule_FS |   .9859893   .5285633     1.87   0.062    -.0499757    2.021954
                  leader2_3_BS |  -.2837203   .5627332    -0.50   0.614    -1.386657    .8192165
       game_no_leader_fem_vill |   .1174145   .1180741     0.99   0.320    -.1140065    .3488354
                         No_HH |   .0010811   .0023854     0.45   0.650    -.0035942    .0057564
                      FES_site |   .4894969   .4424438     1.11   0.269    -.3776769    1.356671
                      Shar_Lit |   .0361788   .0258317     1.40   0.161    -.0144504    .0868079
                     Shar_SCST |  -.0075181   .0125875    -0.60   0.550    -.0321891    .0171528
  survey_dam_for_irrigation_FS |   .6021932    .435688     1.38   0.167    -.2517396    1.456126
                         _cons |  -1.973099   1.845995    -1.07   0.285    -5.591184    1.644985
-------------------------------+----------------------------------------------------------------
 var(e.game_no_leader_fem_vill)|   4.673971   .8832976                      3.227187    6.769366
------------------------------------------------------------------------------------------------

. 
end of do-file

. help gsem

. tab leader_present_BS

          0 |
leader_pres |
       ent_ |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |         26       46.43       46.43
     Female |         11       19.64       66.07
       Male |         17       30.36       96.43
       Both |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab leader_present2_BS

 0 leader_present2_ |      Freq.     Percent        Cum.
--------------------+-----------------------------------
               None |         26       46.43       46.43
          Only male |         17       30.36       76.79
Only female or both |         13       23.21      100.00
--------------------+-----------------------------------
              Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gsem (game_no_leader_fem_vill <- i.leader_present2_BS, ) (survey_maint_rule_FS <- i.leader_present2_BS game_no_leader_fem_vill, probit ) (survey_maint_2017_FS <-
>  survey_maint_rule_FS i.leader_present2_BS game_no_leader_fem_vill  $village , probit ) , nocapslatent

Iteration 0:   log likelihood = -181.89537  
Iteration 1:   log likelihood =  -181.5724  
Iteration 2:   log likelihood = -181.57159  
Iteration 3:   log likelihood = -181.57159  

Generalized structural equation model           Number of obs     =         56

Response       : game_no_leader_fem~l
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Bernoulli
Link           : probit

Response       : survey_maint_2017_FS
Family         : Bernoulli
Link           : probit

Log likelihood = -181.57159

------------------------------------------------------------------------------------------------
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
game_no_leader_fem_vill        |
            leader_present2_BS |
                    Only male  |   -.081448   .6742323    -0.12   0.904    -1.402919    1.240023
          Only female or both  |   2.615385   .7342778     3.56   0.000     1.176227    4.054543
                               |
                         _cons |   2.846154   .4239355     6.71   0.000     2.015256    3.677052
-------------------------------+----------------------------------------------------------------
survey_maint_rule_FS           |
            leader_present2_BS |
                    Only male  |   .2825743   .4213128     0.67   0.502    -.5431836    1.108332
          Only female or both  |  -.1790257   .5032911    -0.36   0.722    -1.165458    .8074067
                               |
       game_no_leader_fem_vill |   .2128122   .0928022     2.29   0.022     .0309232    .3947012
                         _cons |  -1.274654   .4039385    -3.16   0.002    -2.066359   -.4829493
-------------------------------+----------------------------------------------------------------
survey_maint_2017_FS           |
          survey_maint_rule_FS |   .9549089   .5357236     1.78   0.075    -.0950902    2.004908
                               |
            leader_present2_BS |
                    Only male  |   .1313444   .4724838     0.28   0.781    -.7947067    1.057396
          Only female or both  |  -.2343079    .587888    -0.40   0.690    -1.386547    .9179314
                               |
       game_no_leader_fem_vill |   .1175278   .1177037     1.00   0.318    -.1131672    .3482228
                         No_HH |   .0010807   .0023747     0.46   0.649    -.0035736     .005735
                      FES_site |   .4896296   .4430445     1.11   0.269    -.3787216    1.357981
                      Shar_Lit |   .0366357   .0258646     1.42   0.157    -.0140579    .0873294
                     Shar_SCST |  -.0081434   .0127327    -0.64   0.522     -.033099    .0168121
  survey_dam_for_irrigation_FS |   .5868781   .4391247     1.34   0.181    -.2737904    1.447547
                         _cons |  -1.985598   1.841816    -1.08   0.281    -5.595492    1.624296
-------------------------------+----------------------------------------------------------------
 var(e.game_no_leader_fem_vill)|   4.672754   .8830674                      3.226346    6.767603
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. 
. gsem (share_female_percent3_BS <- i.leader_present2_BS, ) (survey_maint_rule_FS <- i.leader_present2_BS share_female_percent3_BS, probit ) (survey_maint_2017_FS 
> <- survey_maint_rule_FS i.leader_present2_BS share_female_percent3_BS  $village , probit ) , nocapslatent

Iteration 0:   log likelihood = -163.05292  
Iteration 1:   log likelihood = -162.72996  
Iteration 2:   log likelihood = -162.72914  
Iteration 3:   log likelihood = -162.72914  

Generalized structural equation model           Number of obs     =         56

Response       : share_female_pe~3_BS
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Bernoulli
Link           : probit

Response       : survey_maint_2017_FS
Family         : Bernoulli
Link           : probit

Log likelihood = -162.72914

-------------------------------------------------------------------------------------------------
                                |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
share_female_percent3_BS        |
             leader_present2_BS |
                     Only male  |  -.0581771   .4815945    -0.12   0.904    -1.002085    .8857307
           Only female or both  |   1.868132   .5244841     3.56   0.000     .8401618    2.896102
                                |
                          _cons |   2.032967   .3028111     6.71   0.000     1.439468    2.626466
--------------------------------+----------------------------------------------------------------
survey_maint_rule_FS            |
             leader_present2_BS |
                     Only male  |   .2825743   .4213128     0.67   0.502    -.5431836    1.108332
           Only female or both  |  -.1790257   .5032911    -0.36   0.722    -1.165458    .8074067
                                |
       share_female_percent3_BS |   .2979371   .1299231     2.29   0.022     .0432924    .5525817
                          _cons |  -1.274654   .4039385    -3.16   0.002    -2.066359   -.4829493
--------------------------------+----------------------------------------------------------------
survey_maint_2017_FS            |
           survey_maint_rule_FS |   .9549089   .5357236     1.78   0.075    -.0950902    2.004908
                                |
             leader_present2_BS |
                     Only male  |   .1313444   .4724838     0.28   0.781    -.7947067    1.057396
           Only female or both  |  -.2343079    .587888    -0.40   0.690    -1.386547    .9179314
                                |
       share_female_percent3_BS |   .1645389   .1647851     1.00   0.318     -.158434    .4875119
                          No_HH |   .0010807   .0023747     0.46   0.649    -.0035736     .005735
                       FES_site |   .4896296   .4430445     1.11   0.269    -.3787216    1.357981
                       Shar_Lit |   .0366357   .0258646     1.42   0.157    -.0140579    .0873294
                      Shar_SCST |  -.0081434   .0127327    -0.64   0.522     -.033099    .0168121
   survey_dam_for_irrigation_FS |   .5868781   .4391247     1.34   0.181    -.2737904    1.447547
                          _cons |  -1.985598   1.841816    -1.08   0.281    -5.595492    1.624296
--------------------------------+----------------------------------------------------------------
 var(e.share_female_percent3_BS)|   2.384058   .4505446                      1.646095    3.452859
-------------------------------------------------------------------------------------------------

. 
end of do-file

. estat teffects
estat teffects not valid
r(321);

. estat tffects
estat tffects not valid
r(321);

. estat teffect
estat teffect not valid
r(321);

. estat teeffect
estat teeffect not valid
r(321);

. estat teeffects
estat teeffects not valid
r(321);

. help gsem

.  estat summarize

  Estimation sample gsem                   Number of obs =         56

  -------------------------------------------------------------------
      Variable |         Mean      Std. Dev.         Min          Max
  -------------+-----------------------------------------------------
  share_f~3_BS |      2.44898      1.754174            0     9.285714
  survey~le_FS |     .3214286      .4712514            0            1
  survey_~7_FS |     .7142857      .4558423            0            1
               |
  leader~t2_BS |
    Only male  |     .3035714      .4639609            0            1
  Only fema..  |     .2321429      .4260205            0            1
               |
         No_HH |     164.1964      98.70736           24          418
      FES_site |     .6964286      .4639609            0            1
      Shar_Lit |     51.27821      8.432409     35.53299     69.11977
     Shar_SCST |      78.3905      17.44676     34.62658          100
  survey_da~FS |     .4285714      .4993502            0            1
  -------------------------------------------------------------------

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gsem (share_female_percent3_BS <- i.leader_present2_BS, ) (survey_maint_rule_FS <- i.leader_present2_BS share_female_percent3_BS, probit ) (survey_maint_2017_FS 
> <- survey_maint_rule_FS i.leader_present2_BS share_female_percent3_BS  No_HH i.FES_site Shar_Lit Shar_SCST i.survey_dam_for_irrigation_FS  , probit ) , nocapslat
> ent

Iteration 0:   log likelihood = -163.05292  
Iteration 1:   log likelihood = -162.72996  
Iteration 2:   log likelihood = -162.72914  
Iteration 3:   log likelihood = -162.72914  

Generalized structural equation model           Number of obs     =         56

Response       : share_female_pe~3_BS
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Bernoulli
Link           : probit

Response       : survey_maint_2017_FS
Family         : Bernoulli
Link           : probit

Log likelihood = -162.72914

-------------------------------------------------------------------------------------------------
                                |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
share_female_percent3_BS        |
             leader_present2_BS |
                     Only male  |  -.0581771   .4815945    -0.12   0.904    -1.002085    .8857307
           Only female or both  |   1.868132   .5244841     3.56   0.000     .8401618    2.896102
                                |
                          _cons |   2.032967   .3028111     6.71   0.000     1.439468    2.626466
--------------------------------+----------------------------------------------------------------
survey_maint_rule_FS            |
             leader_present2_BS |
                     Only male  |   .2825743   .4213128     0.67   0.502    -.5431836    1.108332
           Only female or both  |  -.1790257   .5032911    -0.36   0.722    -1.165458    .8074067
                                |
       share_female_percent3_BS |   .2979371   .1299231     2.29   0.022     .0432924    .5525817
                          _cons |  -1.274654   .4039385    -3.16   0.002    -2.066359   -.4829493
--------------------------------+----------------------------------------------------------------
survey_maint_2017_FS            |
           survey_maint_rule_FS |   .9549089   .5357236     1.78   0.075    -.0950902    2.004908
                                |
             leader_present2_BS |
                     Only male  |   .1313444   .4724838     0.28   0.781    -.7947067    1.057396
           Only female or both  |  -.2343079    .587888    -0.40   0.690    -1.386547    .9179314
                                |
       share_female_percent3_BS |   .1645389   .1647851     1.00   0.318     -.158434    .4875119
                          No_HH |   .0010807   .0023747     0.46   0.649    -.0035736     .005735
                                |
                       FES_site |
         NGO active in village  |   .4896296   .4430445     1.11   0.269    -.3787216    1.357981
                       Shar_Lit |   .0366357   .0258646     1.42   0.157    -.0140579    .0873294
                      Shar_SCST |  -.0081434   .0127327    -0.64   0.522     -.033099    .0168121
 1.survey_dam_for_irrigation_FS |   .5868781   .4391247     1.34   0.181    -.2737904    1.447547
                          _cons |  -1.985598   1.841816    -1.08   0.281    -5.595492    1.624296
--------------------------------+----------------------------------------------------------------
 var(e.share_female_percent3_BS)|   2.384058   .4505446                      1.646095    3.452859
-------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gsem (share_female_percent3_BS <- i.leader_present2_BS, ) (survey_maint_rule_FS <- i.leader_present2_BS share_female_percent3_BS, ) (survey_maint_2017_FS <- surv
> ey_maint_rule_FS i.leader_present2_BS share_female_percent3_BS  No_HH i.FES_site Shar_Lit Shar_SCST i.survey_dam_for_irrigation_FS  , vce(robust)) , nocapslatent

Iteration 0:   log pseudolikelihood = -165.78805  
Iteration 1:   log pseudolikelihood = -165.78805  

Generalized structural equation model           Number of obs     =         56

Response       : share_female_pe~3_BS
Family         : Gaussian
Link           : identity

Response       : survey_maint_rule_FS
Family         : Gaussian
Link           : identity

Response       : survey_maint_2017_FS
Family         : Gaussian
Link           : identity

Log pseudolikelihood = -165.78805

-------------------------------------------------------------------------------------------------
                                |               Robust
                                |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
share_female_percent3_BS        |
             leader_present2_BS |
                     Only male  |  -.0581771   .4271756    -0.14   0.892    -.8954259    .7790717
           Only female or both  |   1.868132   .6049996     3.09   0.002     .6823545    3.053909
                                |
                          _cons |   2.032967   .3128742     6.50   0.000     1.419745    2.646189
--------------------------------+----------------------------------------------------------------
survey_maint_rule_FS            |
       share_female_percent3_BS |   .0972713   .0313945     3.10   0.002     .0357393    .1588033
                                |
             leader_present2_BS |
                     Only male  |   .0893694   .1416115     0.63   0.528     -.188184    .3669227
           Only female or both  |   -.066331   .1682765    -0.39   0.693    -.3961469    .2634848
                                |
                          _cons |   .0714814   .0968101     0.74   0.460    -.1182629    .2612257
--------------------------------+----------------------------------------------------------------
survey_maint_2017_FS            |
       share_female_percent3_BS |   .0341675   .0310668     1.10   0.271    -.0267223    .0950573
           survey_maint_rule_FS |   .2539219   .1114048     2.28   0.023     .0355726    .4722713
                                |
             leader_present2_BS |
                     Only male  |    .058669   .1501229     0.39   0.696    -.2355663    .3529044
           Only female or both  |  -.0750512   .1466354    -0.51   0.609    -.3624514     .212349
                                |
                          No_HH |   .0003519   .0007939     0.44   0.658    -.0012041    .0019079
                                |
                       FES_site |
         NGO active in village  |   .1715133   .1444283     1.19   0.235    -.1115608    .4545875
                       Shar_Lit |   .0095353   .0071855     1.33   0.185     -.004548    .0236186
                      Shar_SCST |  -.0024825   .0044116    -0.56   0.574     -.011129     .006164
 1.survey_dam_for_irrigation_FS |   .1629319    .115759     1.41   0.159    -.0639516    .3898153
                          _cons |   .0072016   .6397241     0.01   0.991    -1.246635    1.261038
--------------------------------+----------------------------------------------------------------
 var(e.share_female_percent3_BS)|   2.384058   .6182656                      1.434075    3.963343
     var(e.survey_maint_rule_FS)|   .1930617   .0250645                      .1496882    .2490031
     var(e.survey_maint_2017_FS)|   .1625633   .0248493                      .1204781    .2193494
-------------------------------------------------------------------------------------------------

. 
end of do-file

. estat teffects
estat teffects not valid
r(321);

. estat teffect
estat teffect not valid
r(321);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- i.leader_present2_BS, ) (survey_maint_rule_FS <- i.leader_present2_BS share_female_percent3_BS, vce(robust) ) (survey_maint_2017
> _FS <- survey_maint_rule_FS i.leader_present2_BS share_female_percent3_BS  No_HH i.FES_site Shar_Lit Shar_SCST i.survey_dam_for_irrigation_FS, vce(robust)) , noc
> apslatent
factor variables not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS, ) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS, vce(robust) ) (survey_maint_2017_FS <- survey_ma
> int_rule_FS leader2_3_BS share_female_percent3_BS  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS, vce(robust)) , nocapslatent
option vce() not allowed
r(198);

end of do-file

r(198);

. help sem

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS, robust) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS, robust ) (survey_maint_2017_FS <- survey_m
> aint_rule_FS leader2_3_BS share_female_percent3_BS  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS, robust) , nocapslatent
option robust not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS,) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS, ) (survey_maint_2017_FS <- survey_maint_rule_FS l
> eader2_3_BS share_female_percent3_BS  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

Fitting target model:

Iteration 0:   log likelihood =  -1031.723  
Iteration 1:   log likelihood =  -1031.723  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     =  -1031.723

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0968711   .0381664     2.54   0.011     .0220663    .1716759
                  leader2_3_BS |  -.1009063   .1571533    -0.64   0.521    -.4089211    .2071085
                         _cons |   .1076179   .1020236     1.05   0.292    -.0923447    .3075804
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0339174   .0380877     0.89   0.373    -.0407331     .108568
          survey_maint_rule_FS |   .2599737    .130096     2.00   0.046     .0049903    .5149571
                  leader2_3_BS |  -.0976348   .1482699    -0.66   0.510    -.3882384    .1929689
                         No_HH |   .0003592    .000681     0.53   0.598    -.0009755     .001694
                      FES_site |   .1731251    .129592     1.34   0.182    -.0808704    .4271207
                      Shar_Lit |   .0093384   .0069374     1.35   0.178    -.0042587    .0229355
                     Shar_SCST |  -.0021206    .003539    -0.60   0.549    -.0090569    .0048156
  survey_dam_for_irrigation_FS |   .1726793   .1162029     1.49   0.137    -.0550741    .4004327
                         _cons |   .0041418   .5250769     0.01   0.994     -1.02499    1.033274
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1945273   .0367622                      .1343132    .2817362
    var(e.survey_maint_2017_FS)|   .1631239   .0308275                      .1126304    .2362543
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(10)  =      9.78, Prob > chi2 = 0.4599

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat teffect


Direct effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0968711   .0381664     2.54   0.011     .0220663    .1716759
                  leader2_3_BS |  -.1009063   .1571533    -0.64   0.521    -.4089211    .2071085
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0339174   .0380877     0.89   0.373    -.0407331     .108568
          survey_maint_rule_FS |   .2599737    .130096     2.00   0.046     .0049903    .5149571
                  leader2_3_BS |  -.0976348   .1482699    -0.66   0.510    -.3882384    .1929689
                         No_HH |   .0003592    .000681     0.53   0.598    -.0009755     .001694
                      FES_site |   .1731251    .129592     1.34   0.182    -.0808704    .4271207
                      Shar_Lit |   .0093384   .0069374     1.35   0.178    -.0042587    .0229355
                     Shar_SCST |  -.0021206    .003539    -0.60   0.549    -.0090569    .0048156
  survey_dam_for_irrigation_FS |   .1726793   .1162029     1.49   0.137    -.0550741    .4004327
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |          0  (no path)
                  leader2_3_BS |   .1831961   .0863216     2.12   0.034     .0140089    .3523832
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0251839   .0160398     1.57   0.116    -.0062535    .0566214
          survey_maint_rule_FS |          0  (no path)
                  leader2_3_BS |   .0855355   .0832843     1.03   0.304    -.0776987    .2487697
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0968711   .0381664     2.54   0.011     .0220663    .1716759
                  leader2_3_BS |   .0822898   .1474087     0.56   0.577    -.2066259    .3712055
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0591014    .037222     1.59   0.112    -.0138524    .1320551
          survey_maint_rule_FS |   .2599737    .130096     2.00   0.046     .0049903    .5149571
                  leader2_3_BS |  -.0120992   .1431815    -0.08   0.933    -.2927297    .2685312
                         No_HH |   .0003592    .000681     0.53   0.598    -.0009755     .001694
                      FES_site |   .1731251    .129592     1.34   0.182    -.0808704    .4271207
                      Shar_Lit |   .0093384   .0069374     1.35   0.178    -.0042587    .0229355
                     Shar_SCST |  -.0021206    .003539    -0.60   0.549    -.0090569    .0048156
  survey_dam_for_irrigation_FS |   .1726793   .1162029     1.49   0.137    -.0550741    .4004327
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS,) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 
> z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_rule_FS leader2_3_BS share_female_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 z_r
> ule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication

Fitting target model:

Iteration 0:   log likelihood = -521.48223  
Iteration 1:   log likelihood = -521.48223  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -521.48223

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
                  leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
       game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
     game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
          z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
                         _cons |  -.0270899    .214122    -0.13   0.899    -.4467613    .3925816
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
          survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
                  leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
       game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
     game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
          z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
                         _cons |   .3444079   .2030147     1.70   0.090    -.0534936    .7423095
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1923797   .0363563                      .1328303    .2786257
    var(e.survey_maint_2017_FS)|    .172889    .032673                      .1193728    .2503971
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(3)   =      9.03, Prob > chi2 = 0.0288

. estat teffect


Direct effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
               leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
    game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
  game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
       z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
       survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
               leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
    game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
  game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
       z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
---------------------------------------------------------------------------------------------


Indirect effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |          0  (no path)
               leader2_3_BS |   .1737885   .0898417     1.93   0.053    -.0022981    .3498751
    game_count_intervention |          0  (no path)
  game_almost_opt_inv_r9_10 |          0  (no path)
       z_rule_communication |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .018363   .0142519     1.29   0.198    -.0095702    .0462962
       survey_maint_rule_FS |          0  (no path)
               leader2_3_BS |   .0399375   .0834632     0.48   0.632    -.1236473    .2035223
    game_count_intervention |   .0003331   .0009146     0.36   0.716    -.0014596    .0021257
  game_almost_opt_inv_r9_10 |   .0255567   .0387742     0.66   0.510    -.0504392    .1015527
       z_rule_communication |  -.0040758   .0130973    -0.31   0.756     -.029746    .0215943
---------------------------------------------------------------------------------------------


Total effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
               leader2_3_BS |   .0418529    .160841     0.26   0.795    -.2733896    .3570955
    game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
  game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
       z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .035059   .0398608     0.88   0.379    -.0430668    .1131847
       survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
               leader2_3_BS |  -.1697682   .1506049    -1.13   0.260    -.4649483     .125412
    game_count_intervention |   .0058196   .0043147     1.35   0.177     -.002637    .0142762
  game_almost_opt_inv_r9_10 |   .2204712   .1707941     1.29   0.197    -.1142792    .5552216
       z_rule_communication |  -.0939244   .0622528    -1.51   0.131    -.2159378    .0280889
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS ,) (survey_maint_rule_FS <- leader2_3_BS share_femal
> e_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_rule_FS leader2_3_BS share_female_p
> ercent3_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication

Fitting target model:

Iteration 0:   log likelihood = -1340.2709  
Iteration 1:   log likelihood = -1340.2709  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -1340.2709

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.694211   .5031977     3.37   0.001     .7079612     2.68046
                         No_HH |   .0006399   .0025119     0.25   0.799    -.0042834    .0055632
                      FES_site |   .0397942   .4761598     0.08   0.933    -.8934618    .9730503
                      Shar_Lit |   .0305946    .025289     1.21   0.226    -.0189709    .0801601
                     Shar_SCST |   .0052931   .0131101     0.40   0.686    -.0204023    .0309884
  survey_dam_for_irrigation_FS |  -.6041875   .4217374    -1.43   0.152    -1.430778    .2224026
                         _cons |   .1980736   1.926587     0.10   0.918    -3.577968    3.974116
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
                  leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
       game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
     game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
          z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
                         _cons |  -.0270899    .214122    -0.13   0.899    -.4467613    .3925816
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
          survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
                  leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
       game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
     game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
          z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
                         _cons |   .3444079   .2030147     1.70   0.090    -.0534936    .7423095
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.263366    .427736                      1.562762    3.278059
    var(e.survey_maint_rule_FS)|   .1923797   .0363563                      .1328303    .2786257
    var(e.survey_maint_2017_FS)|    .172889    .032673                      .1193728    .2503971
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(13)  =     26.79, Prob > chi2 = 0.0133

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat teffect


Direct effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.694211   .5031977     3.37   0.001     .7079612     2.68046
                         No_HH |   .0006399   .0025119     0.25   0.799    -.0042834    .0055632
                      FES_site |   .0397942   .4761598     0.08   0.933    -.8934618    .9730503
                      Shar_Lit |   .0305946    .025289     1.21   0.226    -.0189709    .0801601
                     Shar_SCST |   .0052931   .0131101     0.40   0.686    -.0204023    .0309884
  survey_dam_for_irrigation_FS |  -.6041875   .4217374    -1.43   0.152    -1.430778    .2224026
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
                  leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
       game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
     game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
          z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
          survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
                  leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
       game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
     game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
          z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |          0  (no path)
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |          0  (no path)
                  leader2_3_BS |   .1556921   .0836496     1.86   0.063     -.008258    .3196423
                         No_HH |   .0000588   .0002323     0.25   0.800    -.0003966    .0005142
                      FES_site |    .003657   .0437881     0.08   0.933    -.0821661      .08948
                      Shar_Lit |   .0028115    .002643     1.06   0.287    -.0023686    .0079917
                     Shar_SCST |   .0004864   .0012243     0.40   0.691    -.0019132     .002886
  survey_dam_for_irrigation_FS |  -.0555227   .0460433    -1.21   0.228     -.145766    .0347205
       game_count_intervention |          0  (no path)
     game_almost_opt_inv_r9_10 |          0  (no path)
          z_rule_communication |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .018363   .0142519     1.29   0.198    -.0095702    .0462962
          survey_maint_rule_FS |          0  (no path)
                  leader2_3_BS |   .0330336   .0768282     0.43   0.667    -.1175468    .1836141
                         No_HH |   .0000224   .0000917     0.24   0.807    -.0001573    .0002021
                      FES_site |   .0013951   .0167689     0.08   0.934    -.0314712    .0342615
                      Shar_Lit |   .0010726   .0015078     0.71   0.477    -.0018825    .0040278
                     Shar_SCST |   .0001856   .0005057     0.37   0.714    -.0008057    .0011768
  survey_dam_for_irrigation_FS |  -.0211822     .02826    -0.75   0.454    -.0765708    .0342063
       game_count_intervention |   .0003331   .0009146     0.36   0.716    -.0014596    .0021257
     game_almost_opt_inv_r9_10 |   .0255567   .0387742     0.66   0.510    -.0504392    .1015527
          z_rule_communication |  -.0040758   .0130973    -0.31   0.756     -.029746    .0215943
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.694211   .5031977     3.37   0.001     .7079612     2.68046
                         No_HH |   .0006399   .0025119     0.25   0.799    -.0042834    .0055632
                      FES_site |   .0397942   .4761598     0.08   0.933    -.8934618    .9730503
                      Shar_Lit |   .0305946    .025289     1.21   0.226    -.0189709    .0801601
                     Shar_SCST |   .0052931   .0131101     0.40   0.686    -.0204023    .0309884
  survey_dam_for_irrigation_FS |  -.6041875   .4217374    -1.43   0.152    -1.430778    .2224026
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
                  leader2_3_BS |   .0237565   .1606679     0.15   0.882    -.2911467    .3386598
                         No_HH |   .0000588   .0002323     0.25   0.800    -.0003966    .0005142
                      FES_site |    .003657   .0437881     0.08   0.933    -.0821661      .08948
                      Shar_Lit |   .0028115    .002643     1.06   0.287    -.0023686    .0079917
                     Shar_SCST |   .0004864   .0012243     0.40   0.691    -.0019132     .002886
  survey_dam_for_irrigation_FS |  -.0555227   .0460433    -1.21   0.228     -.145766    .0347205
       game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
     game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
          z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .035059   .0398608     0.88   0.379    -.0430668    .1131847
          survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
                  leader2_3_BS |  -.1766721   .1501124    -1.18   0.239    -.4708869    .1175428
                         No_HH |   .0000224   .0000917     0.24   0.807    -.0001573    .0002021
                      FES_site |   .0013951   .0167689     0.08   0.934    -.0314712    .0342615
                      Shar_Lit |   .0010726   .0015078     0.71   0.477    -.0018825    .0040278
                     Shar_SCST |   .0001856   .0005057     0.37   0.714    -.0008057    .0011768
  survey_dam_for_irrigation_FS |  -.0211822     .02826    -0.75   0.454    -.0765708    .0342063
       game_count_intervention |   .0058196   .0043147     1.35   0.177     -.002637    .0142762
     game_almost_opt_inv_r9_10 |   .2204712   .1707941     1.29   0.197    -.1142792    .5552216
          z_rule_communication |  -.0939244   .0622528    -1.51   0.131    -.2159378    .0280889
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS,) (survey_maint_rule_FS <- leader2_3_BS share_female_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 
> z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_rule_FS leader2_3_BS share_female_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 z_r
> ule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication

Fitting target model:

Iteration 0:   log likelihood = -521.48223  
Iteration 1:   log likelihood = -521.48223  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -521.48223

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
                  leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
       game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
     game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
          z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
                         _cons |  -.0270899    .214122    -0.13   0.899    -.4467613    .3925816
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
          survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
                  leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
       game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
     game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
          z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
                         _cons |   .3444079   .2030147     1.70   0.090    -.0534936    .7423095
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1923797   .0363563                      .1328303    .2786257
    var(e.survey_maint_2017_FS)|    .172889    .032673                      .1193728    .2503971
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(3)   =      9.03, Prob > chi2 = 0.0288

. 
end of do-file

. estat teffects


Direct effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
               leader2_3_BS |  -.1319356   .1660743    -0.79   0.427    -.4574353    .1935641
    game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
  game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
       z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .016696    .040704     0.41   0.682    -.0630824    .0964744
       survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
               leader2_3_BS |  -.2097057   .1583216    -1.32   0.185    -.5200104     .100599
    game_count_intervention |   .0054865   .0042272     1.30   0.194    -.0027986    .0137717
  game_almost_opt_inv_r9_10 |   .1949145   .1679054     1.16   0.246     -.134174     .524003
       z_rule_communication |  -.0898486   .0609691    -1.47   0.141    -.2093458    .0296486
---------------------------------------------------------------------------------------------


Indirect effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |          0  (no path)
               leader2_3_BS |   .1737885   .0898417     1.93   0.053    -.0022981    .3498751
    game_count_intervention |          0  (no path)
  game_almost_opt_inv_r9_10 |          0  (no path)
       z_rule_communication |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .018363   .0142519     1.29   0.198    -.0095702    .0462962
       survey_maint_rule_FS |          0  (no path)
               leader2_3_BS |   .0399375   .0834632     0.48   0.632    -.1236473    .2035223
    game_count_intervention |   .0003331   .0009146     0.36   0.716    -.0014596    .0021257
  game_almost_opt_inv_r9_10 |   .0255567   .0387742     0.66   0.510    -.0504392    .1015527
       z_rule_communication |  -.0040758   .0130973    -0.31   0.756     -.029746    .0215943
---------------------------------------------------------------------------------------------


Total effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0918966   .0411436     2.23   0.026     .0112566    .1725365
               leader2_3_BS |   .0418529    .160841     0.26   0.795    -.2733896    .3570955
    game_count_intervention |   .0016668   .0044535     0.37   0.708     -.007062    .0103955
  game_almost_opt_inv_r9_10 |   .1278972   .1762906     0.73   0.468     -.217626    .4734204
       z_rule_communication |  -.0203973   .0642562    -0.32   0.751    -.1463372    .1055426
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .035059   .0398608     0.88   0.379    -.0430668    .1131847
       survey_maint_rule_FS |   .1998224   .1266806     1.58   0.115     -.048467    .4481118
               leader2_3_BS |  -.1697682   .1506049    -1.13   0.260    -.4649483     .125412
    game_count_intervention |   .0058196   .0043147     1.35   0.177     -.002637    .0142762
  game_almost_opt_inv_r9_10 |   .2204712   .1707941     1.29   0.197    -.1142792    .5552216
       z_rule_communication |  -.0939244   .0622528    -1.51   0.131    -.2159378    .0280889
---------------------------------------------------------------------------------------------

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS,) (survey_maint_rule_FS <- survey_maint_rule_BS leader2_3_BS share_female_percent3_BS game_count_intervention game_
> almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS leader2_3_BS share_female_percent3_BS game_count_i
> ntervention game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS survey_maint_rule_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood = -576.56666  
Iteration 1:   log likelihood = -576.56666  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -576.56666

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0898618   .0427637     2.10   0.036     .0060464    .1736771
                  leader2_3_BS |   -.130309   .1662926    -0.78   0.433    -.4562366    .1956185
          survey_maint_rule_BS |   .0320246   .1841148     0.17   0.862    -.3288338     .392883
       game_count_intervention |   .0019994   .0048457     0.41   0.680     -.007498    .0114969
     game_almost_opt_inv_r9_10 |   .1301284   .1767092     0.74   0.461    -.2162153     .476472
          z_rule_communication |  -.0194201   .0644841    -0.30   0.763    -.1458066    .1069665
                         _cons |  -.0378466   .2228183    -0.17   0.865    -.4745625    .3988692
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0229145   .0415703     0.55   0.581    -.0585618    .1043907
          survey_maint_rule_FS |   .1807055   .1292997     1.40   0.162    -.0727171    .4341282
                  leader2_3_BS |  -.2197121   .1583737    -1.39   0.165    -.5301189    .0906947
       game_count_intervention |   .0045908   .0044138     1.04   0.298    -.0040601    .0132417
     game_almost_opt_inv_r9_10 |   .1989774    .167333     1.19   0.234    -.1289892     .526944
          z_rule_communication |  -.0964775   .0615092    -1.57   0.117    -.2170334    .0240783
           survey_maint_12m_BS |   .0816668   .1208483     0.68   0.499    -.1551915    .3185252
                         _cons |   .3143119   .2070386     1.52   0.129    -.0914763    .7201001
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1922758   .0363367                      .1327586    .2784752
    var(e.survey_maint_2017_FS)|   .1714905   .0324087                      .1184072    .2483717
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(7)   =     17.82, Prob > chi2 = 0.0128

. 
end of do-file

. estat teffects


Direct effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0898618   .0427637     2.10   0.036     .0060464    .1736771
               leader2_3_BS |   -.130309   .1662926    -0.78   0.433    -.4562366    .1956185
       survey_maint_rule_BS |   .0320246   .1841148     0.17   0.862    -.3288338     .392883
    game_count_intervention |   .0019994   .0048457     0.41   0.680     -.007498    .0114969
  game_almost_opt_inv_r9_10 |   .1301284   .1767092     0.74   0.461    -.2162153     .476472
       z_rule_communication |  -.0194201   .0644841    -0.30   0.763    -.1458066    .1069665
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |   .0229145   .0415703     0.55   0.581    -.0585618    .1043907
       survey_maint_rule_FS |   .1807055   .1292997     1.40   0.162    -.0727171    .4341282
               leader2_3_BS |  -.2197121   .1583737    -1.39   0.165    -.5301189    .0906947
       survey_maint_rule_BS |          0  (no path)
    game_count_intervention |   .0045908   .0044138     1.04   0.298    -.0040601    .0132417
  game_almost_opt_inv_r9_10 |   .1989774    .167333     1.19   0.234    -.1289892     .526944
       z_rule_communication |  -.0964775   .0615092    -1.57   0.117    -.2170334    .0240783
        survey_maint_12m_BS |   .0816668   .1208483     0.68   0.499    -.1551915    .3185252
---------------------------------------------------------------------------------------------


Indirect effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |          0  (no path)
               leader2_3_BS |   .1699405   .0920291     1.85   0.065    -.0104333    .3503142
       survey_maint_rule_BS |          0  (no path)
    game_count_intervention |          0  (no path)
  game_almost_opt_inv_r9_10 |          0  (no path)
       z_rule_communication |          0  (no path)
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |   .0162385   .0139542     1.16   0.245    -.0111112    .0435882
       survey_maint_rule_FS |          0  (no path)
               leader2_3_BS |   .0504959   .0842513     0.60   0.549    -.1146336    .2156254
       survey_maint_rule_BS |    .005787   .0335273     0.17   0.863    -.0599252    .0714992
    game_count_intervention |   .0003613    .000913     0.40   0.692    -.0014282    .0021508
  game_almost_opt_inv_r9_10 |   .0235149   .0360939     0.65   0.515    -.0472279    .0942578
       z_rule_communication |  -.0035093   .0119201    -0.29   0.768    -.0268723    .0198537
        survey_maint_12m_BS |          0  (no path)
---------------------------------------------------------------------------------------------


Total effects
---------------------------------------------------------------------------------------------
                            |                 OIM
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
Structural                  |
  share_female_percent3_BS  |
               leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  --------------------------+----------------------------------------------------------------
  survey_maint_rule_FS      |
   share_female_percent3_BS |   .0898618   .0427637     2.10   0.036     .0060464    .1736771
               leader2_3_BS |   .0396314   .1610333     0.25   0.806     -.275988    .3552508
       survey_maint_rule_BS |   .0320246   .1841148     0.17   0.862    -.3288338     .392883
    game_count_intervention |   .0019994   .0048457     0.41   0.680     -.007498    .0114969
  game_almost_opt_inv_r9_10 |   .1301284   .1767092     0.74   0.461    -.2162153     .476472
       z_rule_communication |  -.0194201   .0644841    -0.30   0.763    -.1458066    .1069665
  --------------------------+----------------------------------------------------------------
  survey_maint_2017_FS      |
   share_female_percent3_BS |    .039153   .0401637     0.97   0.330    -.0395664    .1178724
       survey_maint_rule_FS |   .1807055   .1292997     1.40   0.162    -.0727171    .4341282
               leader2_3_BS |  -.1692162   .1497153    -1.13   0.258    -.4626527    .1242203
       survey_maint_rule_BS |    .005787   .0335273     0.17   0.863    -.0599252    .0714992
    game_count_intervention |   .0049521   .0045121     1.10   0.272    -.0038915    .0137956
  game_almost_opt_inv_r9_10 |   .2224923   .1694962     1.31   0.189    -.1097142    .5546988
       z_rule_communication |  -.0999868   .0624667    -1.60   0.109    -.2224192    .0224456
        survey_maint_12m_BS |   .0816668   .1208483     0.68   0.499    -.1551915    .3185252
---------------------------------------------------------------------------------------------

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS,) (survey_maint_rule_FS <- survey_maint_rule_BS leader2_3_BS share_female_percent3_BS share_participants_primary ga
> me_count_intervention game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS leader2_3_BS share_part
> icipants_primary share_female_percent3_BS game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS survey_maint_rule_BS share_participants_primary game_count_intervention game_almost_opt_inv_r9_10 z_rule_communication
           survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood = -677.21764  
Iteration 1:   log likelihood = -677.21764  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -677.21764

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
                         _cons |   2.009967   .2354945     8.54   0.000     1.548406    2.471528
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0877645   .0424364     2.07   0.039     .0045907    .1709383
                  leader2_3_BS |  -.1486519   .1658312    -0.90   0.370    -.4736751    .1763713
          survey_maint_rule_BS |   .0876549   .1907293     0.46   0.646    -.2861677    .4614775
    share_participants_primary |   .0388306   .0387218     1.00   0.316    -.0370627    .1147239
       game_count_intervention |   .0014964   .0048289     0.31   0.757    -.0079681    .0109609
     game_almost_opt_inv_r9_10 |   .1701116   .1796246     0.95   0.344    -.1819461    .5221694
          z_rule_communication |  -.0251591   .0641685    -0.39   0.695    -.1509271    .1006089
                         _cons |  -.2875605   .3328366    -0.86   0.388    -.9399081    .3647872
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0210789     .04117     0.51   0.609    -.0596129    .1017707
          survey_maint_rule_FS |   .1938665   .1285153     1.51   0.131    -.0580189    .4457519
                  leader2_3_BS |  -.1982681    .157946    -1.26   0.209    -.5078366    .1113003
    share_participants_primary |  -.0386238   .0354102    -1.09   0.275    -.1080265    .0307789
       game_count_intervention |   .0054769   .0044425     1.23   0.218    -.0032304    .0141841
     game_almost_opt_inv_r9_10 |   .1616705   .1690789     0.96   0.339     -.169718    .4930589
          z_rule_communication |  -.0899358   .0611608    -1.47   0.141    -.2098088    .0299372
           survey_maint_12m_BS |   .0963772   .1203428     0.80   0.423    -.1394903    .3322447
                         _cons |   .5391382    .290618     1.86   0.064    -.0304626    1.108739
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.384679    .450662                      1.646524    3.453758
    var(e.survey_maint_rule_FS)|   .1888839   .0356957                      .1304166    .2735627
    var(e.survey_maint_2017_FS)|   .1679229   .0317344                      .1159439    .2432047
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(8)   =     18.25, Prob > chi2 = 0.0194

. estat teffect


Direct effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0877645   .0424364     2.07   0.039     .0045907    .1709383
                leader2_3_BS |  -.1486519   .1658312    -0.90   0.370    -.4736751    .1763713
        survey_maint_rule_BS |   .0876549   .1907293     0.46   0.646    -.2861677    .4614775
  share_participants_primary |   .0388306   .0387218     1.00   0.316    -.0370627    .1147239
     game_count_intervention |   .0014964   .0048289     0.31   0.757    -.0079681    .0109609
   game_almost_opt_inv_r9_10 |   .1701116   .1796246     0.95   0.344    -.1819461    .5221694
        z_rule_communication |  -.0251591   .0641685    -0.39   0.695    -.1509271    .1006089
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0210789     .04117     0.51   0.609    -.0596129    .1017707
        survey_maint_rule_FS |   .1938665   .1285153     1.51   0.131    -.0580189    .4457519
                leader2_3_BS |  -.1982681    .157946    -1.26   0.209    -.5078366    .1113003
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |  -.0386238   .0354102    -1.09   0.275    -.1080265    .0307789
     game_count_intervention |   .0054769   .0044425     1.23   0.218    -.0032304    .0141841
   game_almost_opt_inv_r9_10 |   .1616705   .1690789     0.96   0.339     -.169718    .4930589
        z_rule_communication |  -.0899358   .0611608    -1.47   0.141    -.2098088    .0299372
         survey_maint_12m_BS |   .0963772   .1203428     0.80   0.423    -.1394903    .3322447
----------------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |          0  (no path)
                leader2_3_BS |   .1659743    .090998     1.82   0.068    -.0123784     .344327
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |          0  (no path)
     game_count_intervention |          0  (no path)
   game_almost_opt_inv_r9_10 |          0  (no path)
        z_rule_communication |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0170146   .0139607     1.22   0.223    -.0103479    .0443771
        survey_maint_rule_FS |          0  (no path)
                leader2_3_BS |   .0432212   .0848906     0.51   0.611    -.1231613    .2096037
        survey_maint_rule_BS |   .0169934   .0386539     0.44   0.660     -.058767    .0927537
  share_participants_primary |    .007528   .0090142     0.84   0.404    -.0101396    .0251955
     game_count_intervention |   .0002901   .0009557     0.30   0.761    -.0015831    .0021633
   game_almost_opt_inv_r9_10 |    .032979   .0411169     0.80   0.423    -.0476087    .1135666
        z_rule_communication |  -.0048775   .0128535    -0.38   0.704    -.0300698    .0203148
         survey_maint_12m_BS |          0  (no path)
----------------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.891132   .4887684     3.87   0.000     .9331637    2.849101
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0877645   .0424364     2.07   0.039     .0045907    .1709383
                leader2_3_BS |   .0173224   .1609789     0.11   0.914    -.2981904    .3328352
        survey_maint_rule_BS |   .0876549   .1907293     0.46   0.646    -.2861677    .4614775
  share_participants_primary |   .0388306   .0387218     1.00   0.316    -.0370627    .1147239
     game_count_intervention |   .0014964   .0048289     0.31   0.757    -.0079681    .0109609
   game_almost_opt_inv_r9_10 |   .1701116   .1796246     0.95   0.344    -.1819461    .5221694
        z_rule_communication |  -.0251591   .0641685    -0.39   0.695    -.1509271    .1006089
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0380935   .0398766     0.96   0.339    -.0400632    .1162501
        survey_maint_rule_FS |   .1938665   .1285153     1.51   0.131    -.0580189    .4457519
                leader2_3_BS |   -.155047   .1495449    -1.04   0.300    -.4481497    .1380557
        survey_maint_rule_BS |   .0169934   .0386539     0.44   0.660     -.058767    .0927537
  share_participants_primary |  -.0310958   .0360826    -0.86   0.389    -.1018165    .0396249
     game_count_intervention |    .005767   .0045509     1.27   0.205    -.0031527    .0146867
   game_almost_opt_inv_r9_10 |   .1946494   .1714729     1.14   0.256    -.1414312    .5307301
        z_rule_communication |  -.0948133   .0622298    -1.52   0.128    -.2167814    .0271548
         survey_maint_12m_BS |   .0963772   .1203428     0.80   0.423    -.1394903    .3322447
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat gof

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Likelihood ratio     |
          chi2_ms(8) |     18.253   model vs. saturated
            p > chi2 |      0.019
         chi2_bs(24) |     50.498   baseline vs. saturated
            p > chi2 |      0.001
----------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  surv  shar  game  game  z_ru  surv 
    -------------+------------------------------------------------------------
             raw |  0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  surv  shar  game  game  z_ru  surv 
    -------------+------------------------------------------------------------
    share_f~3_BS |  0.0                                                       
    survey~le_FS |  0.0   0.0                                                 
    survey_~7_FS |  0.0   0.0   0.0                                           
    leader2_3_BS |  0.0   0.0   0.0   0.0                                     
    survey~le_BS |  0.1   0.0  -0.0   0.0   0.0                               
    share_part~y |  0.2   0.0   0.0   0.0   0.0   0.0                         
    game_count~n |  8.7   0.8   0.3   0.0   0.0   0.0   0.0                   
    game_al~9_10 | -0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0             
    z_rule_com~n | -0.1  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~2m_BS | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------

. 
end of do-file

. pwcorr game_count_intervention share_female_percent3_BS

             | game_c~n sha~3_BS
-------------+------------------
game_count~n |   1.0000 
share_f~3_BS |   0.4256   1.0000 

. tab game_count_intervention

  Indicates |
    the how |
    maniest |
interventio |
  n this is |
  conducted |
by the team |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.79        1.79
          3 |          1        1.79        3.57
          4 |          1        1.79        5.36
          5 |          1        1.79        7.14
          6 |          1        1.79        8.93
          7 |          1        1.79       10.71
          8 |          2        3.57       14.29
          9 |          1        1.79       16.07
         10 |          1        1.79       17.86
         11 |          1        1.79       19.64
         12 |          1        1.79       21.43
         13 |          2        3.57       25.00
         14 |          2        3.57       28.57
         15 |          1        1.79       30.36
         16 |          1        1.79       32.14
         17 |          1        1.79       33.93
         18 |          2        3.57       37.50
         20 |          1        1.79       39.29
         21 |          1        1.79       41.07
         22 |          1        1.79       42.86
         23 |          1        1.79       44.64
         24 |          1        1.79       46.43
         25 |          1        1.79       48.21
         26 |          2        3.57       51.79
         27 |          1        1.79       53.57
         28 |          1        1.79       55.36
         29 |          1        1.79       57.14
         30 |          1        1.79       58.93
         31 |          1        1.79       60.71
         32 |          1        1.79       62.50
         33 |          1        1.79       64.29
         34 |          1        1.79       66.07
         35 |          1        1.79       67.86
         36 |          1        1.79       69.64
         37 |          1        1.79       71.43
         38 |          1        1.79       73.21
         39 |          1        1.79       75.00
         40 |          1        1.79       76.79
         41 |          1        1.79       78.57
         42 |          1        1.79       80.36
         43 |          1        1.79       82.14
         44 |          1        1.79       83.93
         45 |          1        1.79       85.71
         46 |          1        1.79       87.50
         47 |          1        1.79       89.29
         48 |          1        1.79       91.07
         50 |          1        1.79       92.86
         51 |          1        1.79       94.64
         52 |          1        1.79       96.43
         53 |          1        1.79       98.21
         54 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS game_count_intervention,) (survey_maint_rule_FS <- survey_maint_rule_BS leader2_3_BS share_female_percent3_BS share
> _participants_primary  game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS leader2_3_BS share_par
> ticipants_primary share_female_percent3_BS  game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_rule_BS share_participants_primary game_almost_opt_inv_r9_10 z_rule_communication
           survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood =  -673.5859  
Iteration 1:   log likelihood =  -673.5859  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     =  -673.5859

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
       game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
                         _cons |   1.011032   .3889828     2.60   0.009     .2486394    1.773424
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                  leader2_3_BS |  -.1490825   .1659675    -0.90   0.369    -.4743728    .1762079
          survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
    share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
     game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
          z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
                         _cons |  -.2548011   .3158732    -0.81   0.420    -.8739012    .3642991
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0408469   .0384302     1.06   0.288     -.034475    .1161687
          survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                  leader2_3_BS |  -.2021395   .1600434    -1.26   0.207    -.5158187    .1115397
    share_participants_primary |  -.0306411   .0352824    -0.87   0.385    -.0997933    .0385111
     game_almost_opt_inv_r9_10 |   .1215632   .1681559     0.72   0.470    -.2080164    .4511427
          z_rule_communication |  -.0974367   .0616777    -1.58   0.114    -.2183229    .0234494
           survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
                         _cons |    .604914   .2895292     2.09   0.037     .0374472    1.172381
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758    .384722                      1.405608    2.948411
    var(e.survey_maint_rule_FS)|   .1892078   .0357569                      .1306403    .2740318
    var(e.survey_maint_2017_FS)|   .1724804   .0325957                      .1190907    .2498053
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(9)   =     10.99, Prob > chi2 = 0.2765

. estat teffect


Direct effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                leader2_3_BS |  -.1490825   .1659675    -0.90   0.369    -.4743728    .1762079
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
  share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
   game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
        z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0408469   .0384302     1.06   0.288     -.034475    .1161687
        survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                leader2_3_BS |  -.2021395   .1600434    -1.26   0.207    -.5158187    .1115397
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |  -.0306411   .0352824    -0.87   0.385    -.0997933    .0385111
   game_almost_opt_inv_r9_10 |   .1215632   .1681559     0.72   0.470    -.2080164    .4511427
        z_rule_communication |  -.0974367   .0616777    -1.58   0.114    -.2183229    .0234494
         survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
----------------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |          0  (no path)
     game_count_intervention |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |          0  (no path)
                leader2_3_BS |   .1497446   .0749615     2.00   0.046     .0028227    .2966664
     game_count_intervention |   .0037345   .0019475     1.92   0.055    -.0000825    .0075515
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |          0  (no path)
   game_almost_opt_inv_r9_10 |          0  (no path)
        z_rule_communication |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0175863   .0141378     1.24   0.214    -.0101233     .045296
        survey_maint_rule_FS |          0  (no path)
                leader2_3_BS |   .0655698   .0729977     0.90   0.369     -.077503    .2086426
     game_count_intervention |   .0023348   .0016566     1.41   0.159    -.0009121    .0055817
        survey_maint_rule_BS |   .0126527   .0348272     0.36   0.716    -.0556074    .0809127
  share_participants_primary |   .0075412   .0089341     0.84   0.399    -.0099693    .0250516
   game_almost_opt_inv_r9_10 |   .0295585   .0387269     0.76   0.445    -.0463449    .1054619
        z_rule_communication |  -.0050315   .0125392    -0.40   0.688    -.0296079     .019545
         survey_maint_12m_BS |          0  (no path)
----------------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                leader2_3_BS |   .0006621   .1577119     0.00   0.997    -.3084475    .3097717
     game_count_intervention |   .0037345   .0019475     1.92   0.055    -.0000825    .0075515
        survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
  share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
   game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
        z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0584332   .0369208     1.58   0.113    -.0139302    .1307966
        survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                leader2_3_BS |  -.1365697   .1500376    -0.91   0.363     -.430638    .1574987
     game_count_intervention |   .0023348   .0016566     1.41   0.159    -.0009121    .0055817
        survey_maint_rule_BS |   .0126527   .0348272     0.36   0.716    -.0556074    .0809127
  share_participants_primary |  -.0230999   .0359437    -0.64   0.520    -.0935483    .0473486
   game_almost_opt_inv_r9_10 |   .1511217   .1699924     0.89   0.374    -.1820574    .4843007
        z_rule_communication |  -.1024682   .0626622    -1.64   0.102    -.2252839    .0203475
         survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
----------------------------------------------------------------------------------------------

. estat gof

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Likelihood ratio     |
          chi2_ms(9) |     10.989   model vs. saturated
            p > chi2 |      0.276
         chi2_bs(24) |     50.498   baseline vs. saturated
            p > chi2 |      0.001
----------------------------------------------------------------------------

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  game  surv  shar  game  z_ru  surv 
    -------------+------------------------------------------------------------
             raw |  0.0   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  game  surv  shar  game  z_ru  surv 
    -------------+------------------------------------------------------------
    share_f~3_BS |  0.0                                                       
    survey~le_FS |  0.0   0.0                                                 
    survey_~7_FS | -0.0   0.0   0.0                                           
    leader2_3_BS |  0.0  -0.0  -0.0   0.0                                     
    game_count~n |  0.0   0.2   0.9   0.0   0.0                               
    survey~le_BS |  0.1   0.0  -0.0   0.0   0.0   0.0                         
    share_part~y | -0.1  -0.0  -0.0   0.0   0.0   0.0   0.0                   
    game_al~9_10 |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
    z_rule_com~n | -0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~2m_BS | -0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------

. estat mindices

Modification indices

--------------------------------------------------------------------------
                           |                                      Standard
                           |        MI     df   P>MI        EPC        EPC
---------------------------+----------------------------------------------
Structural                 |
  share_female_percent3_BS |
      survey_maint_rule_BS |     4.147      1   0.04    1.16546    .234593
--------------------------------------------------------------------------
EPC = expected parameter change

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS game_count_intervention,) (survey_maint_rule_FS <- survey_maint_rule_BS leader2_3_BS share_female_percent3_BS share
> _participants_primary game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS leader2_3_BS share_part
> icipants_primary share_female_percent3_BS  game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_rule_BS share_participants_primary game_almost_opt_inv_r9_10 z_rule_communication
           survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood =  -673.5859  
Iteration 1:   log likelihood =  -673.5859  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     =  -673.5859

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
       game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
                         _cons |   1.011032   .3889828     2.60   0.009     .2486394    1.773424
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                  leader2_3_BS |  -.1490825   .1659675    -0.90   0.369    -.4743728    .1762079
          survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
    share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
     game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
          z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
                         _cons |  -.2548011   .3158732    -0.81   0.420    -.8739012    .3642991
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0408469   .0384302     1.06   0.288     -.034475    .1161687
          survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                  leader2_3_BS |  -.2021395   .1600434    -1.26   0.207    -.5158187    .1115397
    share_participants_primary |  -.0306411   .0352824    -0.87   0.385    -.0997933    .0385111
     game_almost_opt_inv_r9_10 |   .1215632   .1681559     0.72   0.470    -.2080164    .4511427
          z_rule_communication |  -.0974367   .0616777    -1.58   0.114    -.2183229    .0234494
           survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
                         _cons |    .604914   .2895292     2.09   0.037     .0374472    1.172381
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758    .384722                      1.405608    2.948411
    var(e.survey_maint_rule_FS)|   .1892078   .0357569                      .1306403    .2740318
    var(e.survey_maint_2017_FS)|   .1724804   .0325957                      .1190907    .2498053
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(9)   =     10.99, Prob > chi2 = 0.2765

. estat teffect


Direct effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                leader2_3_BS |  -.1490825   .1659675    -0.90   0.369    -.4743728    .1762079
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
  share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
   game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
        z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0408469   .0384302     1.06   0.288     -.034475    .1161687
        survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                leader2_3_BS |  -.2021395   .1600434    -1.26   0.207    -.5158187    .1115397
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |  -.0306411   .0352824    -0.87   0.385    -.0997933    .0385111
   game_almost_opt_inv_r9_10 |   .1215632   .1681559     0.72   0.470    -.2080164    .4511427
        z_rule_communication |  -.0974367   .0616777    -1.58   0.114    -.2183229    .0234494
         survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
----------------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |          0  (no path)
     game_count_intervention |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |          0  (no path)
                leader2_3_BS |   .1497446   .0749615     2.00   0.046     .0028227    .2966664
     game_count_intervention |   .0037345   .0019475     1.92   0.055    -.0000825    .0075515
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |          0  (no path)
   game_almost_opt_inv_r9_10 |          0  (no path)
        z_rule_communication |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0175863   .0141378     1.24   0.214    -.0101233     .045296
        survey_maint_rule_FS |          0  (no path)
                leader2_3_BS |   .0655698   .0729977     0.90   0.369     -.077503    .2086426
     game_count_intervention |   .0023348   .0016566     1.41   0.159    -.0009121    .0055817
        survey_maint_rule_BS |   .0126527   .0348272     0.36   0.716    -.0556074    .0809127
  share_participants_primary |   .0075412   .0089341     0.84   0.399    -.0099693    .0250516
   game_almost_opt_inv_r9_10 |   .0295585   .0387269     0.76   0.445    -.0463449    .1054619
        z_rule_communication |  -.0050315   .0125392    -0.40   0.688    -.0296079     .019545
         survey_maint_12m_BS |          0  (no path)
----------------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0934613   .0382808     2.44   0.015     .0184323    .1684902
                leader2_3_BS |   .0006621   .1577119     0.00   0.997    -.3084475    .3097717
     game_count_intervention |   .0037345   .0019475     1.92   0.055    -.0000825    .0075515
        survey_maint_rule_BS |   .0672418   .1791467     0.38   0.707    -.2838792    .4183628
  share_participants_primary |    .040077   .0385453     1.04   0.298    -.0354704    .1156245
   game_almost_opt_inv_r9_10 |   .1570865   .1747875     0.90   0.369    -.1854907    .4996638
        z_rule_communication |  -.0267394   .0640204    -0.42   0.676    -.1522171    .0987382
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0584332   .0369208     1.58   0.113    -.0139302    .1307966
        survey_maint_rule_FS |   .1881669   .1301633     1.45   0.148    -.0669485    .4432822
                leader2_3_BS |  -.1365697   .1500376    -0.91   0.363     -.430638    .1574987
     game_count_intervention |   .0023348   .0016566     1.41   0.159    -.0009121    .0055817
        survey_maint_rule_BS |   .0126527   .0348272     0.36   0.716    -.0556074    .0809127
  share_participants_primary |  -.0230999   .0359437    -0.64   0.520    -.0935483    .0473486
   game_almost_opt_inv_r9_10 |   .1511217   .1699924     0.89   0.374    -.1820574    .4843007
        z_rule_communication |  -.1024682   .0626622    -1.64   0.102    -.2252839    .0203475
         survey_maint_12m_BS |   .1368649   .1173354     1.17   0.243    -.0931083     .366838
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS game_count_intervention,) (survey_maint_rule_FS <- survey_maint_rule_BS share_female_percent3_BS share_participants
> _primary game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS share_participants_primary share_fem
> ale_percent3_BS  game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_rule_BS share_participants_primary game_almost_opt_inv_r9_10 z_rule_communication
           survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood = -674.77293  
Iteration 1:   log likelihood = -674.77293  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -674.77293

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
       game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
                         _cons |   1.011032   .3889828     2.60   0.009     .2486394    1.773424
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0794571   .0352132     2.26   0.024     .0104404    .1484737
          survey_maint_rule_BS |    .070414   .1803976     0.39   0.696    -.2831588    .4239868
    share_participants_primary |   .0362673   .0385863     0.94   0.347    -.0393604    .1118951
     game_almost_opt_inv_r9_10 |   .1285834    .173117     0.74   0.458    -.2107196    .4678864
          z_rule_communication |  -.0080346   .0609738    -0.13   0.895    -.1275411    .1114719
                         _cons |  -.2085397   .3138837    -0.66   0.506    -.8237403     .406661
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0200735   .0352241     0.57   0.569    -.0489644    .0891114
          survey_maint_rule_FS |   .2099666   .1308386     1.60   0.109    -.0464723    .4664054
    share_participants_primary |  -.0361193     .03551    -1.02   0.309    -.1057176     .033479
     game_almost_opt_inv_r9_10 |   .0793863   .1671377     0.47   0.635    -.2481977    .4069702
          z_rule_communication |  -.0713555   .0589402    -1.21   0.226    -.1868762    .0441653
           survey_maint_12m_BS |   .1256468   .1186535     1.06   0.290    -.1069098    .3582034
                         _cons |   .6765085   .2879416     2.35   0.019     .1121532    1.240864
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758    .384722                      1.405608    2.948411
    var(e.survey_maint_rule_FS)|    .191934   .0362721                      .1325226    .2779802
    var(e.survey_maint_2017_FS)|   .1773937   .0335243                      .1224831    .2569214
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(11)  =     13.36, Prob > chi2 = 0.2703

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat teffect


Direct effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0794571   .0352132     2.26   0.024     .0104404    .1484737
                leader2_3_BS |          0  (no path)
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |    .070414   .1803976     0.39   0.696    -.2831588    .4239868
  share_participants_primary |   .0362673   .0385863     0.94   0.347    -.0393604    .1118951
   game_almost_opt_inv_r9_10 |   .1285834    .173117     0.74   0.458    -.2107196    .4678864
        z_rule_communication |  -.0080346   .0609738    -0.13   0.895    -.1275411    .1114719
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0200735   .0352241     0.57   0.569    -.0489644    .0891114
        survey_maint_rule_FS |   .2099666   .1308386     1.60   0.109    -.0464723    .4664054
                leader2_3_BS |          0  (no path)
     game_count_intervention |          0  (no path)
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |  -.0361193     .03551    -1.02   0.309    -.1057176     .033479
   game_almost_opt_inv_r9_10 |   .0793863   .1671377     0.47   0.635    -.2481977    .4069702
        z_rule_communication |  -.0713555   .0589402    -1.21   0.226    -.1868762    .0441653
         survey_maint_12m_BS |   .1256468   .1186535     1.06   0.290    -.1069098    .3582034
----------------------------------------------------------------------------------------------


Indirect effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |          0  (no path)
     game_count_intervention |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |          0  (no path)
                leader2_3_BS |   .1273069   .0672723     1.89   0.058    -.0045445    .2591582
     game_count_intervention |   .0031749   .0017407     1.82   0.068    -.0002367    .0065865
        survey_maint_rule_BS |          0  (no path)
  share_participants_primary |          0  (no path)
   game_almost_opt_inv_r9_10 |          0  (no path)
        z_rule_communication |          0  (no path)
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0166833   .0127571     1.31   0.191    -.0083201    .0416867
        survey_maint_rule_FS |          0  (no path)
                leader2_3_BS |   .0588921   .0574916     1.02   0.306    -.0537893    .1715736
     game_count_intervention |   .0014687   .0014498     1.01   0.311    -.0013728    .0043102
        survey_maint_rule_BS |   .0147846   .0389818     0.38   0.704    -.0616183    .0911875
  share_participants_primary |   .0076149   .0093892     0.81   0.417    -.0107875    .0260173
   game_almost_opt_inv_r9_10 |   .0269982   .0400533     0.67   0.500    -.0515049    .1055013
        z_rule_communication |   -.001687   .0128456    -0.13   0.896    -.0268638    .0234898
         survey_maint_12m_BS |          0  (no path)
----------------------------------------------------------------------------------------------


Total effects
----------------------------------------------------------------------------------------------
                             |                 OIM
                             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
Structural                   |
  share_female_percent3_BS   |
                leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
     game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
  ---------------------------+----------------------------------------------------------------
  survey_maint_rule_FS       |
    share_female_percent3_BS |   .0794571   .0352132     2.26   0.024     .0104404    .1484737
                leader2_3_BS |   .1273069   .0672723     1.89   0.058    -.0045445    .2591582
     game_count_intervention |   .0031749   .0017407     1.82   0.068    -.0002367    .0065865
        survey_maint_rule_BS |    .070414   .1803976     0.39   0.696    -.2831588    .4239868
  share_participants_primary |   .0362673   .0385863     0.94   0.347    -.0393604    .1118951
   game_almost_opt_inv_r9_10 |   .1285834    .173117     0.74   0.458    -.2107196    .4678864
        z_rule_communication |  -.0080346   .0609738    -0.13   0.895    -.1275411    .1114719
  ---------------------------+----------------------------------------------------------------
  survey_maint_2017_FS       |
    share_female_percent3_BS |   .0367568   .0342878     1.07   0.284    -.0304461    .1039597
        survey_maint_rule_FS |   .2099666   .1308386     1.60   0.109    -.0464723    .4664054
                leader2_3_BS |   .0588921   .0574916     1.02   0.306    -.0537893    .1715736
     game_count_intervention |   .0014687   .0014498     1.01   0.311    -.0013728    .0043102
        survey_maint_rule_BS |   .0147846   .0389818     0.38   0.704    -.0616183    .0911875
  share_participants_primary |  -.0285043   .0363903    -0.78   0.433     -.099828    .0428194
   game_almost_opt_inv_r9_10 |   .1063845   .1701527     0.63   0.532    -.2271086    .4398776
        z_rule_communication |  -.0730425   .0602834    -1.21   0.226    -.1911957    .0451108
         survey_maint_12m_BS |   .1256468   .1186535     1.06   0.290    -.1069098    .3582034
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat gof

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Likelihood ratio     |
         chi2_ms(11) |     13.363   model vs. saturated
            p > chi2 |      0.270
         chi2_bs(24) |     50.498   baseline vs. saturated
            p > chi2 |      0.001
----------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Likelihood ratio     |
         chi2_ms(11) |     13.363   model vs. saturated
            p > chi2 |      0.270
         chi2_bs(24) |     50.498   baseline vs. saturated
            p > chi2 |      0.001
---------------------+------------------------------------------------------
Population error     |
               RMSEA |      0.062   Root mean squared error of approximation
 90% CI, lower bound |      0.000
         upper bound |      0.162
              pclose |      0.383   Probability RMSEA <= 0.05
---------------------+------------------------------------------------------
Information criteria |
                 AIC |   1387.546   Akaike's information criterion
                 BIC |   1426.028   Bayesian information criterion
---------------------+------------------------------------------------------
Baseline comparison  |
                 CFI |      0.911   Comparative fit index
                 TLI |      0.805   Tucker-Lewis index
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.053   Standardized root mean squared residual
                  CD |      0.379   Coefficient of determination
----------------------------------------------------------------------------

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. sem (share_female_percent3_BS <- leader2_3_BS game_count_intervention,) (survey_maint_rule_FS <- survey_maint_rule_BS share_female_percent3_BS share_participants
> _primary game_almost_opt_inv_r9_10 z_rule_communication, ) (survey_maint_2017_FS <- survey_maint_12m_BS survey_maint_rule_FS share_participants_primary share_fem
> ale_percent3_BS  game_almost_opt_inv_r9_10 z_rule_communication,) , nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_rule_BS share_participants_primary game_almost_opt_inv_r9_10 z_rule_communication
           survey_maint_12m_BS

Fitting target model:

Iteration 0:   log likelihood = -674.77293  
Iteration 1:   log likelihood = -674.77293  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -674.77293

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
       game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
                         _cons |   1.011032   .3889828     2.60   0.009     .2486394    1.773424
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0794571   .0352132     2.26   0.024     .0104404    .1484737
          survey_maint_rule_BS |    .070414   .1803976     0.39   0.696    -.2831588    .4239868
    share_participants_primary |   .0362673   .0385863     0.94   0.347    -.0393604    .1118951
     game_almost_opt_inv_r9_10 |   .1285834    .173117     0.74   0.458    -.2107196    .4678864
          z_rule_communication |  -.0080346   .0609738    -0.13   0.895    -.1275411    .1114719
                         _cons |  -.2085397   .3138837    -0.66   0.506    -.8237403     .406661
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0200735   .0352241     0.57   0.569    -.0489644    .0891114
          survey_maint_rule_FS |   .2099666   .1308386     1.60   0.109    -.0464723    .4664054
    share_participants_primary |  -.0361193     .03551    -1.02   0.309    -.1057176     .033479
     game_almost_opt_inv_r9_10 |   .0793863   .1671377     0.47   0.635    -.2481977    .4069702
          z_rule_communication |  -.0713555   .0589402    -1.21   0.226    -.1868762    .0441653
           survey_maint_12m_BS |   .1256468   .1186535     1.06   0.290    -.1069098    .3582034
                         _cons |   .6765085   .2879416     2.35   0.019     .1121532    1.240864
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758    .384722                      1.405608    2.948411
    var(e.survey_maint_rule_FS)|    .191934   .0362721                      .1325226    .2779802
    var(e.survey_maint_2017_FS)|   .1773937   .0335243                      .1224831    .2569214
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(11)  =     13.36, Prob > chi2 = 0.2703

. 
end of do-file

. tab survey_maint_com_FS

          1 |
survey_main |
     t_com_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       84.34       84.34
          1 |         13       15.66      100.00
------------+-----------------------------------
      Total |         83      100.00

. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), method(adf) v
> ce(bootstrap, nodots seed(12345)) nocapslatent
convergence not achieved
convergence not achieved
an error occurred when bootstrap executed sem
r(430);
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), method(adf) v
> ce(jackknife, cluster(Village) nodots) nocapslatent
convergence not achieved
convergence not achieved
an error occurred when jackknife executed sem
r(430);
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log likelihood = -484.71244  
Iteration 1:   log likelihood = -484.71244  

Structural equation model                       Number of obs     =         56
Estimation method  = ml
Log likelihood     = -484.71244

------------------------------------------------------------------------------------------------
                               |                 OIM
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4611258     3.47   0.001     .6984194    2.505999
       game_count_intervention |   .0399574   .0128974     3.10   0.002      .014679    .0652359
                         _cons |   1.011032   .3889828     2.60   0.009     .2486394    1.773424
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0430386   .0340026     1.27   0.206    -.0236053    .1096824
           survey_maint_12m_BS |   .1191265   .1185257     1.01   0.315    -.1131796    .3514326
                         _cons |   .5450674   .1220589     4.47   0.000     .3058363    .7842985
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0342602     2.49   0.013     .0181616    .1524592
          survey_maint_rule_BS |   .0129895   .1702051     0.08   0.939    -.3206064    .3465854
                         _cons |   .1106495    .103214     1.07   0.284    -.0916463    .3129452
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758    .384722                      1.405608    2.948411
    var(e.survey_maint_2017_FS)|   .1953276   .0369134                      .1348657    .2828952
    var(e.survey_maint_rule_FS)|   .1959391    .037029                      .1352879    .2837808
------------------------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(9)   =     12.85, Prob > chi2 = 0.1693
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), vce(robust) c
> ov( e.survey_maint_2017_FS*e.survey_maint_rule_FS) nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.84789  
Iteration 1:   log pseudolikelihood = -483.44524  
Iteration 2:   log pseudolikelihood = -483.44208  
Iteration 3:   log pseudolikelihood = -483.44208  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.44208

-------------------------------------------------------------------------------------------------------------------
                                                  |               Robust
                                                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------------------------+----------------------------------------------------------------
Structural                                        |
  share_female_percent3_BS                        |
                                     leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
                          game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                                            _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_2017_FS                            |
                         share_female_percent3_BS |   .0425558    .028018     1.52   0.129    -.0123586    .0974701
                              survey_maint_12m_BS |   .0790883   .1199223     0.66   0.510    -.1559551    .3141316
                                            _cons |   .5676988    .120233     4.72   0.000     .3320465    .8033511
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_rule_FS                            |
                         share_female_percent3_BS |   .0847227   .0271729     3.12   0.002     .0314648    .1379806
                             survey_maint_rule_BS |   .0379831   .1839849     0.21   0.836    -.3226207    .3985869
                                            _cons |   .1085182   .0840682     1.29   0.197    -.0562524    .2732889
--------------------------------------------------+----------------------------------------------------------------
                   var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
                       var(e.survey_maint_2017_FS)|   .1957256   .0252916                      .1519343    .2521387
                       var(e.survey_maint_rule_FS)|   .1960145   .0250291                      .1526154    .2517549
--------------------------------------------------+----------------------------------------------------------------
cov(e.survey_maint_2017_FS,e.survey_maint_rule_FS)|   .0423127   .0237795     1.78   0.075    -.0042942    .0889196
-------------------------------------------------------------------------------------------------------------------
. 
. estat teffects


Direct effects
--------------------------------------------------------------------------------------------
                           |               Robust
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
   game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |   .0425558    .028018     1.52   0.129    -.0123586    .0974701
              leader2_3_BS |          0  (no path)
   game_count_intervention |          0  (no path)
       survey_maint_12m_BS |   .0790883   .1199223     0.66   0.510    -.1559551    .3141316
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |   .0847227   .0271729     3.12   0.002     .0314648    .1379806
              leader2_3_BS |          0  (no path)
   game_count_intervention |          0  (no path)
      survey_maint_rule_BS |   .0379831   .1839849     0.21   0.836    -.3226207    .3985869
--------------------------------------------------------------------------------------------


Indirect effects
--------------------------------------------------------------------------------------------
                           |               Robust
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |          0  (no path)
   game_count_intervention |          0  (no path)
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |          0  (no path)
              leader2_3_BS |   .0681832   .0440247     1.55   0.121    -.0181036    .1544701
   game_count_intervention |   .0017004   .0012696     1.34   0.180    -.0007879    .0041888
       survey_maint_12m_BS |          0  (no path)
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |          0  (no path)
              leader2_3_BS |   .1357435   .0612575     2.22   0.027     .0156811    .2558059
   game_count_intervention |   .0033853   .0017198     1.97   0.049     .0000145    .0067561
      survey_maint_rule_BS |          0  (no path)
--------------------------------------------------------------------------------------------


Total effects
--------------------------------------------------------------------------------------------
                           |               Robust
                           |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
Structural                 |
  share_female_percent3_BS |
              leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
   game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
  -------------------------+----------------------------------------------------------------
  survey_maint_2017_FS     |
  share_female_percent3_BS |   .0425558    .028018     1.52   0.129    -.0123586    .0974701
              leader2_3_BS |   .0681832   .0440247     1.55   0.121    -.0181036    .1544701
   game_count_intervention |   .0017004   .0012696     1.34   0.180    -.0007879    .0041888
       survey_maint_12m_BS |   .0790883   .1199223     0.66   0.510    -.1559551    .3141316
  -------------------------+----------------------------------------------------------------
  survey_maint_rule_FS     |
  share_female_percent3_BS |   .0847227   .0271729     3.12   0.002     .0314648    .1379806
              leader2_3_BS |   .1357435   .0612575     2.22   0.027     .0156811    .2558059
   game_count_intervention |   .0033853   .0017198     1.97   0.049     .0000145    .0067561
      survey_maint_rule_BS |   .0379831   .1839849     0.21   0.836    -.3226207    .3985869
--------------------------------------------------------------------------------------------

. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), vce(robust) s
> tandardized nocnsreport cov( e.survey_maint_2017_FS*e.survey_maint_rule_FS) nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.84789  
Iteration 1:   log pseudolikelihood = -483.44524  
Iteration 2:   log pseudolikelihood = -483.44208  
Iteration 3:   log pseudolikelihood = -483.44208  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.44208

-------------------------------------------------------------------------------------------------------------------
                                                  |               Robust
                                     Standardized |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------------------------+----------------------------------------------------------------
Structural                                        |
  share_female_percent3_BS                        |
                                     leader2_3_BS |   .3891142    .094519     4.12   0.000     .2038603    .5743681
                          game_count_intervention |   .3469542   .0823408     4.21   0.000     .1855692    .5083393
                                            _cons |   .5815737    .272069     2.14   0.033     .0483282    1.114819
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_2017_FS                            |
                         share_female_percent3_BS |   .1640845   .1059337     1.55   0.121    -.0435418    .3717109
                              survey_maint_12m_BS |   .0874824   .1324946     0.66   0.509    -.1722022    .3471669
                                            _cons |    1.25912   .3264692     3.86   0.000     .6192526    1.898988
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_rule_FS                            |
                         share_female_percent3_BS |   .3158067   .1167881     2.70   0.007     .0869061    .5447072
                             survey_maint_rule_BS |    .028499   .1381132     0.21   0.837    -.2421979    .2991959
                                            _cons |   .2326827   .1737072     1.34   0.180    -.1077772    .5731426
--------------------------------------------------+----------------------------------------------------------------
                   var(e.share_female_percent3_BS)|   .6736061   .0963593                      .5089108    .8916006
                       var(e.survey_maint_2017_FS)|   .9628224   .0426895                      .8826849    1.050235
                       var(e.survey_maint_rule_FS)|   .9011789   .0730467                      .7688035    1.056347
--------------------------------------------------+----------------------------------------------------------------
cov(e.survey_maint_2017_FS,e.survey_maint_rule_FS)|   .2160243   .1154728     1.87   0.061    -.0102981    .4423468
-------------------------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), vce(robust) n
> ocnsreport noci cov( e.survey_maint_2017_FS*e.survey_maint_rule_FS) nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.84789  
Iteration 1:   log pseudolikelihood = -483.44524  
Iteration 2:   log pseudolikelihood = -483.44208  
Iteration 3:   log pseudolikelihood = -483.44208  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.44208

------------------------------------------------------------------------------------------
                                                  |               Robust
                                                  |      Coef.   Std. Err.      z    P>|z|
--------------------------------------------------+---------------------------------------
Structural                                        |
  share_female_percent3_BS                        |
                                     leader2_3_BS |   1.602209   .4936331     3.25   0.001
                          game_count_intervention |   .0399574   .0128091     3.12   0.002
                                            _cons |   1.011032   .3710981     2.72   0.006
  ------------------------------------------------+---------------------------------------
  survey_maint_2017_FS                            |
                         share_female_percent3_BS |   .0425558    .028018     1.52   0.129
                              survey_maint_12m_BS |   .0790883   .1199223     0.66   0.510
                                            _cons |   .5676988    .120233     4.72   0.000
  ------------------------------------------------+---------------------------------------
  survey_maint_rule_FS                            |
                         share_female_percent3_BS |   .0847227   .0271729     3.12   0.002
                             survey_maint_rule_BS |   .0379831   .1839849     0.21   0.836
                                            _cons |   .1085182   .0840682     1.29   0.197
--------------------------------------------------+---------------------------------------
                   var(e.share_female_percent3_BS)|   2.035758   .4718715
                       var(e.survey_maint_2017_FS)|   .1957256   .0252916
                       var(e.survey_maint_rule_FS)|   .1960145   .0250291
--------------------------------------------------+---------------------------------------
cov(e.survey_maint_2017_FS,e.survey_maint_rule_FS)|   .0423127   .0237795     1.78   0.075
------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_rule_BS -> survey_maint_rule_FS, ), vce(robust) n
> ocnsreport cov( e.survey_maint_2017_FS*e.survey_maint_rule_FS) nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.84789  
Iteration 1:   log pseudolikelihood = -483.44524  
Iteration 2:   log pseudolikelihood = -483.44208  
Iteration 3:   log pseudolikelihood = -483.44208  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.44208

-------------------------------------------------------------------------------------------------------------------
                                                  |               Robust
                                                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------------------------+----------------------------------------------------------------
Structural                                        |
  share_female_percent3_BS                        |
                                     leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
                          game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                                            _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_2017_FS                            |
                         share_female_percent3_BS |   .0425558    .028018     1.52   0.129    -.0123586    .0974701
                              survey_maint_12m_BS |   .0790883   .1199223     0.66   0.510    -.1559551    .3141316
                                            _cons |   .5676988    .120233     4.72   0.000     .3320465    .8033511
  ------------------------------------------------+----------------------------------------------------------------
  survey_maint_rule_FS                            |
                         share_female_percent3_BS |   .0847227   .0271729     3.12   0.002     .0314648    .1379806
                             survey_maint_rule_BS |   .0379831   .1839849     0.21   0.836    -.3226207    .3985869
                                            _cons |   .1085182   .0840682     1.29   0.197    -.0562524    .2732889
--------------------------------------------------+----------------------------------------------------------------
                   var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
                       var(e.survey_maint_2017_FS)|   .1957256   .0252916                      .1519343    .2521387
                       var(e.survey_maint_rule_FS)|   .1960145   .0250291                      .1526154    .2517549
--------------------------------------------------+----------------------------------------------------------------
cov(e.survey_maint_2017_FS,e.survey_maint_rule_FS)|   .0423127   .0237795     1.78   0.075    -.0042942    .0889196
-------------------------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. sem (leader2_3_BS -> share_female_percent3_BS, ) (game_count_intervention -> share_female_percent3_BS, ) (share_female_percent3_BS -> survey_maint_2017_FS, ) (sh
> are_female_percent3_BS -> survey_maint_rule_FS, ) (survey_maint_rule_FS -> survey_maint_2017_FS, ) (survey_maint_12m_BS -> survey_maint_2017_FS, ) (survey_maint_
> rule_BS -> survey_maint_rule_FS, ), vce(robust) nocnsreport nocapslatent
(28 observations with missing values excluded)

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS game_count_intervention survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -483.46499  
Iteration 1:   log pseudolikelihood = -483.46499  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -483.46499

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.602209   .4936331     3.25   0.001     .6347062    2.569713
       game_count_intervention |   .0399574   .0128091     3.12   0.002     .0148521    .0650627
                         _cons |   1.011032   .3710981     2.72   0.006     .2836929    1.738371
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |    .024341   .0293745     0.83   0.407    -.0332319     .081914
          survey_maint_rule_FS |   .2129274   .1199817     1.77   0.076    -.0222323    .4480872
           survey_maint_12m_BS |   .0803531   .1208985     0.66   0.506    -.1566036    .3173098
                         _cons |   .5431877   .1193952     4.55   0.000     .3091775     .777198
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .0853104   .0272137     3.13   0.002     .0319726    .1386483
          survey_maint_rule_BS |   .0129895   .1850532     0.07   0.944    -.3497081    .3756871
                         _cons |   .1106495   .0842291     1.31   0.189    -.0544365    .2757354
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.035758   .4718715                      1.292483    3.206472
    var(e.survey_maint_2017_FS)|   .1868164   .0242473                      .1448558    .2409319
    var(e.survey_maint_rule_FS)|   .1959391   .0250007                      .1525853    .2516108
------------------------------------------------------------------------------------------------
. 
. (note: file D:\OneDrive\Desktop\games_SEM1.stsem not found)
graph export "D:\OneDrive\Desktop\games_SEM1.tif", as(tif) name("games_SEM1")
(file D:\OneDrive\Desktop\games_SEM1.tif written in TIFF format)

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. gen maint_community = survey_maint_com_FS
(1 missing value generated)

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. 
. gen maint_outsider = survey_maint_12m_BS - maint_community
(1 missing value generated)

. 
end of do-file

. tab maint_outsider

maint_outsi |
        der |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |          4        4.82        4.82
          0 |         44       53.01       57.83
          1 |         35       42.17      100.00
------------+-----------------------------------
      Total |         83      100.00

. tab survey_maint_12_FS
variable survey_maint_12_FS not found
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6bd0_000000.tmp"

. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. *maintenance outcome
. gen maint_community = survey_maint_com_FS
(1 missing value generated)

. gen maint_community_baseline = survey_maint_com_BS
(2 missing values generated)

. 
. gen maint_outsider = survey_maint_2017_FS - maint_community
(1 missing value generated)

. 
end of do-file

. tab maint_outsider

maint_outsi |
        der |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |          1        1.20        1.20
          0 |         40       48.19       49.40
          1 |         42       50.60      100.00
------------+-----------------------------------
      Total |         83      100.00

. tba maint_
command tba is unrecognized
r(199);

. tab survey_maint_2017_FS

Maintenance |
  conducted |
  (Endline) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         30       35.71       35.71
          1 |         54       64.29      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab maint_community

maint_commu |
       nity |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       84.34       84.34
          1 |         13       15.66      100.00
------------+-----------------------------------
      Total |         83      100.00

. drop of treatment==0
variable of not found
r(111);

. drop of treatment_BS==0
variable of not found
r(111);

. drop if treatment_BS==0
(28 observations deleted)

. tab survey_maint_2017_FS

Maintenance |
  conducted |
  (Endline) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         16       28.57       28.57
          1 |         40       71.43      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab maint_community

maint_commu |
       nity |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         44       80.00       80.00
          1 |         11       20.00      100.00
------------+-----------------------------------
      Total |         55      100.00

. tab maint_outsider

maint_outsi |
        der |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       47.27       47.27
          1 |         29       52.73      100.00
------------+-----------------------------------
      Total |         55      100.00

. exit, clear
