-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2023.03.16-10.34.42.log.txt
  log type:  text
 opened on:  16 Mar 2023, 10:34:42

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 16 Mar 2023 10:34:42

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_02_Survey&Game_Wide.dta", clear

. 
. *----------------------------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. bysort treatment: tab FES_site

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         16       57.14       57.14
    NGO active in village |         12       42.86      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         17       30.36       30.36
    NGO active in village |         39       69.64      100.00
--------------------------+-----------------------------------
                    Total |         56      100.00


. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. tab site_ID if No_HH ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_Lit ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_SCST ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. tab Village if site_ID == 236 // Urdali (=control)

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Urdali  |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. pwcorr share_female_percent3 game_total_all game_total_gamerelated  com_outside_game

             | share_~3 game_t~l game_t~d com_ou~e
-------------+------------------------------------
share_fema~3 |   1.0000 
game_total~l |  -0.3393   1.0000 
game_total~d |  -0.3454   0.9979   1.0000 
com_outsid~e |   0.0995   0.1667   0.1710   1.0000 

. reg com_outside_game share_female_percent3, robust

Linear regression                               Number of obs     =         56
                                                F(1, 54)          =       0.59
                                                Prob > F          =     0.4474
                                                R-squared         =     0.0099
                                                Root MSE          =     .50145

---------------------------------------------------------------------------------------
                      |               Robust
     com_outside_game |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
share_female_percent3 |   .0283376   .0370284     0.77   0.447    -.0458997     .102575
                _cons |   .3591731   .1133132     3.17   0.003     .1319938    .5863525
---------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control
variable fs_dam_used_farming_new not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1


. 
end of do-file

. use "C:\Users\istei\Dropbox\IA Paper\analysis_newdata_lba\2022_12_Survey_Baseline.dta"

. tab treatment
variable treatment not found
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. use "$working_ANALYSIS/processed/2023_02_Survey&Game_Wide.dta", clear

. 
. *----------------------------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS treatment survey_maint_12m_BS, robust

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           treatment |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_02_Survey&Game_Wide.dta", clear

. 
. *----------------------------------------------------------------------
. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1


. 
end of do-file

. tab side_ID
variable side_ID not found
r(111);

. tab village if site_ID==236
variable village not found
r(111);

. tab Village if site_ID==236

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Urdali  |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. tab Village treatment if site_ID==236

                      |     0
                      | treatment_
           0 Village_ |   Control |     Total
----------------------+-----------+----------
              Urdali  |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 

. tab treatment if site_ID==236

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab treatment

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. bysort treatment: tab FES_site

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         16       57.14       57.14
    NGO active in village |         12       42.86      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         17       30.36       30.36
    NGO active in village |         39       69.64      100.00
--------------------------+-----------------------------------
                    Total |         56      100.00


. 
end of do-file

. tab FES_site

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         33       39.29       39.29
    NGO active in village |         51       60.71      100.00
--------------------------+-----------------------------------
                    Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. egen survey_conflict_BS = rowmax(survey_conflict_alloc_BS survey_conflict_maint_BS survey_conflict_oper_BS survey_conflict_other_BS)
(84 missing values generated)

. 
end of do-file

. tabtab survey_conflict_BS
command tabtab is unrecognized
r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. *======================================================
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. 
. *--------------------------------------------------
. *LOAD DATASET
. *use "$working_ANALYSIS/processed/games_clean.dta", clear
. 
. use "C:/Users/lba/Dropbox/4_Paper Indien/IA Paper/analysis_newdata_lba/2023_02_Survey&Game_Wide", clear
file C:/Users/lba/Dropbox/4_Paper Indien/IA Paper/analysis_newdata_lba/2023_02_Survey&Game_Wide.dta not found
r(601);

end of do-file

r(601);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_02_Survey&Game_Wide.dta", clear

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. bysort treatment: tab FES_site

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Control

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         16       57.14       57.14
    NGO active in village |         12       42.86      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment = Games

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         17       30.36       30.36
    NGO active in village |         39       69.64      100.00
--------------------------+-----------------------------------
                    Total |         56      100.00


. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. egen survey_conflict_BS = rowmean(survey_conflict_alloc_BS survey_conflict_maint_BS survey_conflict_oper_BS survey_conflict_other_BS)
(84 missing values generated)

. 
end of do-file

. tab survey_conflict_alloc_BS
no observations

. tab survey_activity_any_FS
no observations

. tabtab survey_rules_maint_BS
command tabtab is unrecognized
r(199);

. tab survey_rules_extr_maint_FS

  FS: There |
        are |
maintenance |
rules/pract |
   ices for |
      water |
 etxraction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         84      100.00      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab survey_rules_extr_maint_BS

  BS: There |
        are |
maintenance |
rules/pract |
   ices for |
      water |
 etxraction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82      100.00      100.00
------------+-----------------------------------
      Total |         82      100.00

. tab survey_rules_maint_BS

  BS: There |
    are dam |
maintenance |
      rules |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         69       84.15       84.15
          1 |         13       15.85      100.00
------------+-----------------------------------
      Total |         82      100.00

. tab survey_rules_maint_all_FS

  FS: There |
  are rules |
     by the |
  community |
    for dam |
maintenance |
          ? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       23.91       23.91
          1 |         35       76.09      100.00
------------+-----------------------------------
      Total |         46      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_rule_FS treatment survey_maint_rule_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.707752  
Iteration 2:   log pseudolikelihood = -51.707685  
Iteration 3:   log pseudolikelihood = -51.707685  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       0.53
                                                Prob > chi2       =     0.7669
Log pseudolikelihood = -51.707685               Pseudo R2         =     0.0051

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           treatment |   .1130016   .3079753     0.37   0.714    -.4906188    .7166221
survey_maint_rule_BS |    .250906    .389699     0.64   0.520      -.51289    1.014702
               _cons |  -.6138882   .2628291    -2.34   0.020    -1.129024   -.0987526
--------------------------------------------------------------------------------------

. 
end of do-file

. tab survey_conflict_BS
no observations

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1) ||,  byopts(compact cols(1
> ) title("{bf: A} Game Impact")) subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) oeflabels(treatment  = "Game Intervention") xline(0, lpattern(
> dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciop
> ts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(6) mlabg
> ap(-0.2) legend(off)
) required
r(100);

end of do-file

r(100);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1) ||,  byopts(compact cols(1
> ) title("{bf: A} Game Impact")) subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Game Intervention") xline(0, lpattern
> (dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) cio
> pts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(6) mlab
> gap(-0.2) legend(off)
) required
r(100);

end of do-file

r(100);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1) ||,  byopts(compact cols(1
> )) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Game Intervention") xline(0, lpattern
> (dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) cio
> pts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(6) mlab
> gap(-0.2) legend(off)
) required
r(100);

end of do-file

r(100);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1)) ||,  byopts(compact cols(
> 1) title("{bf: A} Game Impact")) subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Game Intervention") xline(0, lpatter
> n(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ci
> opts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(6) mla
> bgap(-0.2) legend(off)
estimation result treatment2 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. *maintenance
. probit survey_maint_2017_FS treatment survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           treatment |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          treatment |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment survey_maint_12m_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |    .199991   .0980867     2.04   0.041     .0077446    .3922375
         survey_maint_12m_BS |   .1937148   .0940361     2.06   0.039     .0094075    .3780222
                       No_HH |   -.000358   .0004645    -0.77   0.441    -.0012685    .0005525
                    FES_site |   .0200957   .1104538     0.18   0.856    -.1963897    .2365811
                    Shar_Lit |   .0056405    .006322     0.89   0.372    -.0067504    .0180314
                   Shar_SCST |  -.0051376   .0027227    -1.89   0.059     -.010474    .0001988
survey_dam_for_irrigation_FS |   .0383799   .1037738     0.37   0.712     -.165013    .2417728
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11851538

. 
. *rules
. probit survey_maint_rule_FS treatment survey_maint_rule_FS, vce(robust)

outcome = survey_maint_rule_FS > 0 predicts data perfectly
r(2000);

end of do-file

r(2000);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. *rules
. probit survey_maint_rule_FS treatment survey_maint_rule_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.707752  
Iteration 2:   log pseudolikelihood = -51.707685  
Iteration 3:   log pseudolikelihood = -51.707685  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       0.53
                                                Prob > chi2       =     0.7669
Log pseudolikelihood = -51.707685               Pseudo R2         =     0.0051

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           treatment |   .1130016   .3079753     0.37   0.714    -.4906188    .7166221
survey_maint_rule_BS |    .250906    .389699     0.64   0.520      -.51289    1.014702
               _cons |  -.6138882   .2628291    -2.34   0.020    -1.129024   -.0987526
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment survey_maint_rule_BS

--------------------------------------------------------------------------------------
                     |            Delta-method
                     |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           treatment |    .039621   .1077558     0.37   0.713    -.1715765    .2508185
survey_maint_rule_BS |   .0879735   .1356664     0.65   0.517    -.1779278    .3538749
--------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .0050935

. 
. probit survey_maint_rule_FS treatment survey_maint_rule_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.78618  
Iteration 1:   log pseudolikelihood = -48.109524  
Iteration 2:   log pseudolikelihood =   -48.0902  
Iteration 3:   log pseudolikelihood = -48.090194  
Iteration 4:   log pseudolikelihood = -48.090194  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =       3.92
                                                Prob > chi2       =     0.7891
Log pseudolikelihood = -48.090194               Pseudo R2         =     0.0531

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |   .1685262   .3310294     0.51   0.611    -.4802794    .8173318
        survey_maint_rule_BS |   .2308962   .4183569     0.55   0.581    -.5890684    1.050861
                       No_HH |  -.0022713   .0016899    -1.34   0.179    -.0055834    .0010408
                    FES_site |   .0741613   .3104021     0.24   0.811    -.5342156    .6825383
                    Shar_Lit |   .0008443   .0190561     0.04   0.965    -.0365049    .0381935
                   Shar_SCST |  -.0044503   .0083918    -0.53   0.596    -.0208979    .0119974
survey_dam_for_irrigation_FS |  -.4374285   .3358966    -1.30   0.193    -1.095774    .2209167
                       _cons |   .1260744    1.31204     0.10   0.923    -2.445476    2.697625
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |   .0557472   .1091281     0.51   0.609    -.1581399    .2696344
        survey_maint_rule_BS |   .0763788    .137253     0.56   0.578    -.1926323    .3453898
                       No_HH |  -.0007513   .0005384    -1.40   0.163    -.0018066    .0003039
                    FES_site |    .024532   .1022383     0.24   0.810    -.1758513    .2249154
                    Shar_Lit |   .0002793   .0063029     0.04   0.965    -.0120742    .0126328
                   Shar_SCST |  -.0014721   .0027508    -0.54   0.593    -.0068636    .0039194
survey_dam_for_irrigation_FS |  -.1446982   .1071625    -1.35   0.177    -.3547327    .0653364
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .05308503

. 
. coefplot (vol_stay, keep(1.bias_cat 2.bias_cat z_self_efficacy)),  bylabel(Voluntary immobile) || (acq_stay, keep(1.bias_cat 2.bias_cat z_self_efficacy)),  bylab
> el(Acquiescent immobile) || (inv_stay, keep(1.bias_cat 2.bias_cat z_self_efficacy)),  bylabel(Involuntary immobile) || (pot_move, keep(1.bias_cat 2.bias_cat z_se
> lf_efficacy)),  bylabel(Potentially mobile) ||,  byopts(compact cols(1) title("{bf: A} Study 1: Barisal (2018)")) subtitle(, nobox margin(tiny) justification(cen
> ter)  bmargin(top)) coeflabels(1.bias_cat = "Ignore coastal erosion"  2.bias_cat = "Ignore accretion" z_self_efficacy = "Adaptation self-efficacy (std.)") xline(
> 0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to 'ignore none'")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  
> levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mla
> bposition(6) mlabgap(-0.2) legend(off)
estimation result vol_stay not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. 
. *plot coefficients
. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1)) ||,  byopts(compact cols(
> 1) title("{bf: A} Game Impact")) subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Game Intervention") xline(0, lpatter
> n(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ci
> opts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(6) mla
> bgap(-0.2) legend(off)
(note:  named style medthin not found in class linestyle, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2, keep(treatment)),  bylabel(Dam maintenance (=1)) || (treatment4, keep(treatment)),  bylabel(Dam rule exists (=1)) ||,  byopts(compact cols(
> 1) title("{bf: A} Game Impact")) subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Game Intervention") xline(0, lpatter
> n(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ci
> opts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) ml
> abgap(-0.2) legend(off)

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2) (treatment4),  title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(treatment  = "Gam
> e Intervention") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3(.1).3, nog
> rid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) 
> mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(off)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2) (treatment4),  keep(treatment) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(t
> reatment  = "Game Intervention") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xl
> a(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<
> .1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(off)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2) (treatment4),  keep(treatment) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(t
> reatment  = "Game Intervention") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xl
> a(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<
> .1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2) (treatment4),  keep(treatment) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(t
> reatment  = "Treated (=1)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3
> (.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "
> *", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Maintenance" 6 "Rules") pos(6) ring(1) rows(1))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. coefplot (treatment2) (treatment4),  keep(treatment) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(t
> reatment  = "Treated (=1)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize(4pt) xla(-.3
> (.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "
> *", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule exists (=1)") pos(6) ring(1) rows(2))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. esttab treatment1 treatment2 treatment3 treatment4 using "$working_ANALYSIS\results\Tables\tableSOM_treatment_effects.rtf", ci transform(ln*: exp(@) exp(@))mtitl
> es("Maintenance" "Perceived strength SLR hazards (future)" "Perceived threat on livelihoods") b(%4.2f)label tats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f
> )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust
>  standard errors. Omitted category is ‘Control villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
option tats() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. esttab treatment1 treatment2 treatment3 treatment4 using "$working_ANALYSIS\results\Tables\tableSOM_treatment_effects.rtf", ci transform(ln*: exp(@) exp(@))mtitl
> es("Maintenance" "Perceived strength SLR hazards (future)" "Perceived threat on livelihoods") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2
> f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robus
> t standard errors. Omitted category is ‘Control villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_treatment_effects.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_treatment_effects.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. esttab treatment1 treatment2 treatment3 treatment4 using "$working_ANALYSIS\results\Tables\tableSOM_treatment_effects.rtf", ci transform(ln*: exp(@) exp(@))mtitl
> es("Dam maintenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varl
> abels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. Omitted category is
>  ‘Control villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_treatment_effects.rtf)

. 
end of do-file

. tab treatment

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370247   .4028461     0.59   0.556    -.5525392    1.026589
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent3 |   .2852909   .1452183     1.96   0.049     .0006683    .5699135
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3 leader2_2 leader2_3 d_illiterate

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0665676   .1119815     0.59   0.552    -.1529121    .2860473
                       No_HH |   .0003025   .0007103     0.43   0.670    -.0010897    .0016947
                    FES_site |   .1681386    .111824     1.50   0.133    -.0510325    .3873096
                    Shar_Lit |   .0077704   .0069784     1.11   0.266    -.0059071    .0214479
                   Shar_SCST |  -.0031671   .0039141    -0.81   0.418    -.0108386    .0045044
survey_dam_for_irrigation_FS |   .1255623   .1059011     1.19   0.236        -.082    .3331246
       share_female_percent3 |    .080123   .0390508     2.05   0.040     .0035849    .1566612
                   leader2_2 |   .0636457   .1337064     0.48   0.634     -.198414    .3257054
                   leader2_3 |  -.1303871   .1387577    -0.94   0.347    -.4023472     .141573
                d_illiterate |   .1482108   .1089501     1.36   0.174    -.0653274    .3617491
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .1663105

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. *rules
. probit survey_maint_rule_FS treatment survey_maint_rule_BS $control if treatment == 1, vce(robust)

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -32.231667  
Iteration 2:   log pseudolikelihood = -32.215512  
Iteration 3:   log pseudolikelihood = -32.215508  
Iteration 4:   log pseudolikelihood = -32.215508  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.42
                                                Prob > chi2       =     0.6201
Log pseudolikelihood = -32.215508               Pseudo R2         =     0.0839

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |          0  (omitted)
        survey_maint_rule_BS |   .2179315   .4946255     0.44   0.660    -.7515166     1.18738
                       No_HH |   -.001151   .0025687    -0.45   0.654    -.0061855    .0038834
                    FES_site |   .5272578   .3795943     1.39   0.165    -.2167333    1.271249
                    Shar_Lit |  -.0080071   .0239183    -0.33   0.738    -.0548862    .0388719
                   Shar_SCST |  -.0036524   .0118569    -0.31   0.758    -.0268915    .0195867
survey_dam_for_irrigation_FS |  -.5875984   .4019583    -1.46   0.144    -1.375422    .2002254
                       _cons |   .2348381   1.738522     0.14   0.893    -3.172603    3.642279
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |          0  (omitted)
        survey_maint_rule_BS |   .0717359   .1614684     0.44   0.657    -.2447364    .3882081
                       No_HH |  -.0003789   .0008304    -0.46   0.648    -.0020065    .0012487
                    FES_site |   .1735559   .1190297     1.46   0.145     -.059738    .4068498
                    Shar_Lit |  -.0026357    .007865    -0.34   0.738    -.0180508    .0127794
                   Shar_SCST |  -.0012022   .0038801    -0.31   0.757     -.008807    .0064025
survey_dam_for_irrigation_FS |   -.193418   .1231882    -1.57   0.116    -.4348625    .0480265
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p
too few quotes
r(132);

end of do-file

r(132);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. *rules
. probit survey_maint_rule_FS treatment survey_maint_rule_BS $control if treatment == 1, vce(robust)

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -32.231667  
Iteration 2:   log pseudolikelihood = -32.215512  
Iteration 3:   log pseudolikelihood = -32.215508  
Iteration 4:   log pseudolikelihood = -32.215508  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.42
                                                Prob > chi2       =     0.6201
Log pseudolikelihood = -32.215508               Pseudo R2         =     0.0839

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |          0  (omitted)
        survey_maint_rule_BS |   .2179315   .4946255     0.44   0.660    -.7515166     1.18738
                       No_HH |   -.001151   .0025687    -0.45   0.654    -.0061855    .0038834
                    FES_site |   .5272578   .3795943     1.39   0.165    -.2167333    1.271249
                    Shar_Lit |  -.0080071   .0239183    -0.33   0.738    -.0548862    .0388719
                   Shar_SCST |  -.0036524   .0118569    -0.31   0.758    -.0268915    .0195867
survey_dam_for_irrigation_FS |  -.5875984   .4019583    -1.46   0.144    -1.375422    .2002254
                       _cons |   .2348381   1.738522     0.14   0.893    -3.172603    3.642279
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |          0  (omitted)
        survey_maint_rule_BS |   .0717359   .1614684     0.44   0.657    -.2447364    .3882081
                       No_HH |  -.0003789   .0008304    -0.46   0.648    -.0020065    .0012487
                    FES_site |   .1735559   .1190297     1.46   0.145     -.059738    .4068498
                    Shar_Lit |  -.0026357    .007865    -0.34   0.738    -.0180508    .0127794
                   Shar_SCST |  -.0012022   .0038801    -0.31   0.757     -.008807    .0064025
survey_dam_for_irrigation_FS |   -.193418   .1231882    -1.57   0.116    -.4348625    .0480265
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .08386871

. 
. probit survey_maint_rule_FS treatment survey_maint_rule_BS $session_composition, vce(robust)

note: treatment omitted because of collinearity
Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood =  -31.55796  
Iteration 2:   log pseudolikelihood = -31.543236  
Iteration 3:   log pseudolikelihood = -31.543232  
Iteration 4:   log pseudolikelihood = -31.543232  

Probit regression                               Number of obs     =         56
                                                Wald chi2(5)      =       8.27
                                                Prob > chi2       =     0.1417
Log pseudolikelihood = -31.543232               Pseudo R2         =     0.1030

---------------------------------------------------------------------------------------
                      |               Robust
 survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            treatment |          0  (omitted)
 survey_maint_rule_BS |  -.0339443   .5125184    -0.07   0.947    -1.038462    .9705733
share_female_percent3 |   .3193208   .1183754     2.70   0.007     .0873093    .5513323
            leader2_2 |   .2637655   .4359326     0.61   0.545    -.5906467    1.118178
            leader2_3 |  -.2337038    .516743    -0.45   0.651    -1.246501    .7790939
         d_illiterate |    .284217   .3813169     0.75   0.456    -.4631503    1.031584
                _cons |  -1.426471   .4148493    -3.44   0.001    -2.239561   -.6133815
---------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment survey_maint_rule_BS share_female_percent3 leader2_2 leader2_3 d_illiterate

---------------------------------------------------------------------------------------
                      |            Delta-method
                      |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
            treatment |          0  (omitted)
 survey_maint_rule_BS |  -.0108029   .1631392    -0.07   0.947    -.3305499     .308944
share_female_percent3 |   .1016254   .0320646     3.17   0.002       .03878    .1644708
            leader2_2 |   .0839446   .1375141     0.61   0.542     -.185578    .3534672
            leader2_3 |  -.0743773   .1636393    -0.45   0.649    -.3951044    .2463498
         d_illiterate |   .0904534   .1207966     0.75   0.454    -.1463035    .3272104
---------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .10298662

. 
. 
. *plot coefficients
. coefplot (det2) (det4), keep(share_female_percent3) title("{bf: B} Determinants") subtitle(, nobox margin(tiny) justification(center)  bmargin(top)) coeflabels(s
> hare_female_percent3  = "Share women in session (in 10%)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp")   msymbol(d) msize(4
> pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(
> @pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule exists (=1)") pos(6) ring(1) rows(2))

. gr save "$working_ANALYSIS/results/intermediate/figure1_b.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_b.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish
option at() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370247   .4028461     0.59   0.556    -.5525392    1.026589
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent3 |   .2852909   .1452183     1.96   0.049     .0006683    .5699135
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish
variable share_female_percent2 not found in list of covariates
r(322);

end of do-file

r(322);

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition2, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370246   .4028461     0.59   0.556    -.5525392    1.026588
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent2 |   .0285291   .0145218     1.96   0.049     .0000668    .0569914
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish

Adjusted predictions                            Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
1._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =           0
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
2._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          10
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
3._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          20
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
4._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          30
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
5._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          40
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
6._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          50
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
7._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          60
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
8._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          70
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
9._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          80
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
10._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          90
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
11._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =         100
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .5022625    .150453     3.34   0.001     .2073801    .7971448
          2  |   .6144598   .1011032     6.08   0.000     .4163012    .8126185
          3  |   .7177779   .0673666    10.65   0.000     .5857417    .8498141
          4  |   .8055307   .0626265    12.86   0.000     .6827851    .9282764
          5  |   .8742751   .0672813    12.99   0.000     .7424061    1.006144
          6  |   .9239461   .0643557    14.36   0.000     .7978113    1.050081
          7  |   .9570485   .0533015    17.96   0.000     .8525795    1.061517
          8  |   .9773957   .0387834    25.20   0.000     .9013816     1.05341
          9  |   .9889312   .0251246    39.36   0.000      .939688    1.038174
         10  |   .9949632   .0146244    68.03   0.000     .9662999    1.023626
         11  |   .9978723    .007696   129.66   0.000     .9827884    1.012956
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women participating in games (perce
> nt)")  ///

end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women participating in games (perce
> nt)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted maintenance") ///
>                 recastci(rarea) ciopts(fcolor(%60) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%30) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Percent", axis(2)) legend(rows
> (1) order(2 "Predicted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(black) horizontal(left) verti
> cal(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbotto
> m( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow_pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) grig
> ht( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) lines
> tyle( width( sztype(relative) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition2, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370246   .4028461     0.59   0.556    -.5525392    1.026588
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent2 |   .0285291   .0145218     1.96   0.049     .0000668    .0569914
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish

Adjusted predictions                            Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
1._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =           0
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
2._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          10
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
3._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          20
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
4._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          30
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
5._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          40
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
6._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          50
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
7._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          60
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
8._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          70
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
9._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          80
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
10._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          90
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
11._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =         100
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .5022625    .150453     3.34   0.001     .2073801    .7971448
          2  |   .6144598   .1011032     6.08   0.000     .4163012    .8126185
          3  |   .7177779   .0673666    10.65   0.000     .5857417    .8498141
          4  |   .8055307   .0626265    12.86   0.000     .6827851    .9282764
          5  |   .8742751   .0672813    12.99   0.000     .7424061    1.006144
          6  |   .9239461   .0643557    14.36   0.000     .7978113    1.050081
          7  |   .9570485   .0533015    17.96   0.000     .8525795    1.061517
          8  |   .9773957   .0387834    25.20   0.000     .9013816     1.05341
          9  |   .9889312   .0251246    39.36   0.000      .939688    1.038174
         10  |   .9949632   .0146244    68.03   0.000     .9662999    1.023626
         11  |   .9978723    .007696   129.66   0.000     .9827884    1.012956
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women participating in games (perce
> nt)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted maintenance") ///
>                 recastci(rarea) ciopts(fcolor(%80) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%30) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Percent", axis(2)) legend(rows
> (1) order(2 "Predicted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(black) horizontal(left) verti
> cal(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbotto
> m( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow_pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) grig
> ht( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) lines
> tyle( width( sztype(relative) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition2, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370246   .4028461     0.59   0.556    -.5525392    1.026588
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent2 |   .0285291   .0145218     1.96   0.049     .0000668    .0569914
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish

Adjusted predictions                            Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
1._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =           0
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
2._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          10
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
3._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          20
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
4._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          30
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
5._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          40
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
6._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          50
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
7._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          60
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
8._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          70
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
9._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          80
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
10._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          90
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
11._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =         100
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .5022625    .150453     3.34   0.001     .2073801    .7971448
          2  |   .6144598   .1011032     6.08   0.000     .4163012    .8126185
          3  |   .7177779   .0673666    10.65   0.000     .5857417    .8498141
          4  |   .8055307   .0626265    12.86   0.000     .6827851    .9282764
          5  |   .8742751   .0672813    12.99   0.000     .7424061    1.006144
          6  |   .9239461   .0643557    14.36   0.000     .7978113    1.050081
          7  |   .9570485   .0533015    17.96   0.000     .8525795    1.061517
          8  |   .9773957   .0387834    25.20   0.000     .9013816     1.05341
          9  |   .9889312   .0251246    39.36   0.000      .939688    1.038174
         10  |   .9949632   .0146244    68.03   0.000     .9662999    1.023626
         11  |   .9978723    .007696   129.66   0.000     .9827884    1.012956
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women participating in games (perce
> nt)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Predicted maintenance") ///
>                 recastci(rarea) ciopts(fcolor(%50) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%40) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Percent", axis(2)) legend(rows
> (1) order(2 "Predicted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(black) horizontal(left) verti
> cal(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbotto
> m( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow_pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) grig
> ht( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) lines
> tyle( width( sztype(relative) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $session_composition2, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -28.073828  
Iteration 2:   log pseudolikelihood = -27.931488  
Iteration 3:   log pseudolikelihood =  -27.93118  
Iteration 4:   log pseudolikelihood =  -27.93118  

Probit regression                               Number of obs     =         56
                                                Wald chi2(10)     =      12.19
                                                Prob > chi2       =     0.2725
Log pseudolikelihood =  -27.93118               Pseudo R2         =     0.1663

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2370246   .4028461     0.59   0.556    -.5525392    1.026588
                       No_HH |   .0010771   .0025248     0.43   0.670    -.0038715    .0060256
                    FES_site |   .5986844   .4269968     1.40   0.161     -.238214    1.435583
                    Shar_Lit |   .0276676   .0259045     1.07   0.285    -.0231043    .0784395
                   Shar_SCST |  -.0112769   .0140695    -0.80   0.423    -.0388527    .0162989
survey_dam_for_irrigation_FS |   .4470846   .3790376     1.18   0.238    -.2958154    1.189985
       share_female_percent2 |   .0285291   .0145218     1.96   0.049     .0000668    .0569914
                   leader2_2 |   .2266208   .4789785     0.47   0.636    -.7121597    1.165401
                   leader2_3 |  -.4642642   .4974201    -0.93   0.351     -1.43919    .5106612
                d_illiterate |   .5277284   .3917265     1.35   0.178    -.2400414    1.295498
                       _cons |  -1.619211   2.104544    -0.77   0.442    -5.744041     2.50562
----------------------------------------------------------------------------------------------

. margins, at(share_female_percent2==(0(10)100)) atmeans vsquish

Adjusted predictions                            Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
1._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =           0
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
2._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          10
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
3._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          20
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
4._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          30
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
5._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          40
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
6._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          50
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
7._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          60
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
8._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          70
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
9._at        : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          80
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
10._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =          90
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)
11._at       : survey~2m_BS    =    .5357143 (mean)
               No_HH           =    164.1964 (mean)
               FES_site        =    .6964286 (mean)
               Shar_Lit        =    51.27821 (mean)
               Shar_SCST       =     78.3905 (mean)
               survey_da~FS    =    .4285714 (mean)
               share_fema~2    =         100
               leader2_2       =    .3035714 (mean)
               leader2_3       =    .2321429 (mean)
               d_illiterate    =    .4107143 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .5022625    .150453     3.34   0.001     .2073801    .7971448
          2  |   .6144598   .1011032     6.08   0.000     .4163012    .8126185
          3  |   .7177779   .0673666    10.65   0.000     .5857417    .8498141
          4  |   .8055307   .0626265    12.86   0.000     .6827851    .9282764
          5  |   .8742751   .0672813    12.99   0.000     .7424061    1.006144
          6  |   .9239461   .0643557    14.36   0.000     .7978113    1.050081
          7  |   .9570485   .0533015    17.96   0.000     .8525795    1.061517
          8  |   .9773957   .0387834    25.20   0.000     .9013816     1.05341
          9  |   .9889312   .0251246    39.36   0.000      .939688    1.038174
         10  |   .9949632   .0146244    68.03   0.000     .9662999    1.023626
         11  |   .9978723    .007696   129.66   0.000     .9827884    1.012956
------------------------------------------------------------------------------

. marginsplot, xla(0(20)100, notick) yla(0(0.2)1, notick) title("{bf:C } Dam maintenance",span pos(11) size()) xtitle("Share of women in each game intervention (pe
> rcent)")  ///
>                 xline(21.43, lpattern(dash))  ytitle("Likelihood") ///
>                 recastci(rarea) ciopts(fcolor(%50) lwidth(none)) legend(pos(6) ring(1) rows(2)) ///
>                 addplot(hist share_female_percent2, fcolor(%40) lwidth(none) percent yaxis(2) yscale(alt lcolor() axis(2)) ytitle("Percent", axis(2)) legend(rows
> (1) order(2 "Predicted maintenance" 3 "Distribution women participation")))

  Variables that uniquely identify margins: share_female_percent2

. gr_edit plotregion1.AddTextBox added_text editor .0767792533911014 22.90604527651298

. gr_edit plotregion1.added_text_new = 1

. gr_edit plotregion1.added_text_rec = 1

. gr_edit plotregion1.added_text[1].style.editstyle  angle(default) size( sztype(relative) val(2.777777777777778) allow_pct(1)) color(black) horizontal(left) verti
> cal(middle) margin( gleft( sztype(relative) val(0) allow_pct(1)) gright( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbotto
> m( sztype(relative) val(0) allow_pct(1))) linegap( sztype(relative) val(0) allow_pct(1)) drawbox(no) boxmargin( gleft( sztype(relative) val(0) allow_pct(1)) grig
> ht( sztype(relative) val(0) allow_pct(1)) gtop( sztype(relative) val(0) allow_pct(1)) gbottom( sztype(relative) val(0) allow_pct(1))) fillcolor(bluishgray) lines
> tyle( width( sztype(relative) val(.15) allow_pct(1)) color(black) pattern(solid) align(inside)) box_alignment(east) editcopy

. gr_edit plotregion1.added_text[1].style.editstyle size(medsmall) editcopy

. gr_edit plotregion1.added_text[1].text = {}

. gr_edit plotregion1.added_text[1].text.Arrpush Median = 21.43%

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("120 94 240"))) editcopy

. gr_edit plotregion2.plot3.bar_size = 10

. gr_edit plotregion2.plot3.style.editstyle area(shadestyle(color("%50"))) editcopy

. gr_edit plotregion1.added_text[1].DragBy .1535730123805444 -.638908975399561

. gr_edit plotregion1.added_text[1].DragBy .7964051792477791 -.4563635538568562

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS treatment survey_maint_12m_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                   treatment |    .199991   .0980867     2.04   0.041     .0077446    .3922375
         survey_maint_12m_BS |   .1937148   .0940361     2.06   0.039     .0094075    .3780222
                       No_HH |   -.000358   .0004645    -0.77   0.441    -.0012685    .0005525
                    FES_site |   .0200957   .1104538     0.18   0.856    -.1963897    .2365811
                    Shar_Lit |   .0056405    .006322     0.89   0.372    -.0067504    .0180314
                   Shar_SCST |  -.0051376   .0027227    -1.89   0.059     -.010474    .0001988
survey_dam_for_irrigation_FS |   .0383799   .1037738     0.37   0.712     -.165013    .2417728
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11851538

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD271c_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
end of do-file

. exit, clear
