-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2023.03.21-16.23.42.log.txt
  log type:  text
 opened on:  21 Mar 2023, 16:23:42

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 21 Mar 2023 16:23:42

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. * Setting globals
. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.1) hierarchical: probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.1773 >= 0.1000  removing game_discussion
p = 0.2182 >= 0.1000  removing game_come_back_dummy
p = 0.4751 >= 0.1000  removing communication_rules
p = 0.0961 <  0.1000  keeping  game_optimal_inv_r10

Probit regression                               Number of obs     =         55
                                                Wald chi2(14)     =      17.97
                                                Prob > chi2       =     0.2083
Log pseudolikelihood = -24.498957               Pseudo R2         =     0.2613

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .6497106    .479373     1.36   0.175    -.2898431    1.589264
                       No_HH |   .0000383   .0024873     0.02   0.988    -.0048367    .0049133
                    FES_site |   .2964064   .4994668     0.59   0.553    -.6825305    1.275343
                    Shar_Lit |   .0518378   .0268041     1.93   0.053    -.0006973    .1043729
                   Shar_SCST |  -.0144965   .0145825    -0.99   0.320    -.0430777    .0140847
survey_dam_for_irrigation_FS |    .414829   .4892673     0.85   0.397    -.5441173    1.373775
    share_female_percent3_BS |   .2850505   .1673807     1.70   0.089    -.0430096    .6131106
                leader2_2_BS |     .13067   .5031786     0.26   0.795     -.855542    1.116882
                leader2_3_BS |   -.261773     .60674    -0.43   0.666    -1.450962    .9274156
       game_share_illit_vill |   .0479963   .3332079     0.14   0.885    -.6050792    .7010718
   participants_primary_only |  -.1890432   .1086053    -1.74   0.082    -.4019056    .0238193
             game_lead_facil |  -.6216522     .63735    -0.98   0.329    -1.870835    .6275308
     game_count_intervention |   .0222865   .0202014     1.10   0.270    -.0173076    .0618805
        game_optimal_inv_r10 |   -.791193   .4754397    -1.66   0.096    -1.723038    .1406517
                       _cons |   -.494757   2.385343    -0.21   0.836    -5.169943    4.180429
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.1): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.1000  removing game_share_illit_vill
p = 0.9097 >= 0.1000  removing leader2_2_BS
p = 0.6406 >= 0.1000  removing No_HH
p = 0.5048 >= 0.1000  removing leader2_3_BS
p = 0.5826 >= 0.1000  removing communication_rules
p = 0.3909 >= 0.1000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.1000  removing FES_site
p = 0.2930 >= 0.1000  removing game_count_intervention
p = 0.2635 >= 0.1000  removing game_discussion
p = 0.2195 >= 0.1000  removing Shar_SCST
p = 0.2596 >= 0.1000  removing game_come_back_dummy
p = 0.1676 >= 0.1000  removing game_optimal_inv_r10
p = 0.2141 >= 0.1000  removing participants_primary_only
p = 0.2331 >= 0.1000  removing share_female_percent3_BS
p = 0.2162 >= 0.1000  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -26.381539  
Iteration 2:   log pseudolikelihood = -25.877457  
Iteration 3:   log pseudolikelihood = -25.874806  
Iteration 4:   log pseudolikelihood = -25.874805  

Probit regression                               Number of obs     =         55
                                                Wald chi2(12)     =      14.95
                                                Prob > chi2       =     0.2444
Log pseudolikelihood = -25.874805               Pseudo R2         =     0.2198

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |    .850362   .5060421     1.68   0.093    -.1414622    1.842186
 share_female_percent3_BS |   .2714948   .1463816     1.85   0.064    -.0154079    .5583974
             leader2_2_BS |  -.1705034   .4572524    -0.37   0.709    -1.066702    .7256948
             leader2_3_BS |  -.7032477   .6209473    -1.13   0.257    -1.920282    .5137866
    game_share_illit_vill |  -.0845432   .3164487    -0.27   0.789    -.7047712    .5356849
participants_primary_only |  -.2623498   .1324185    -1.98   0.048    -.5218853   -.0028143
          game_lead_facil |  -.5277201   .5366224    -0.98   0.325    -1.579481    .5240404
  game_count_intervention |   .0118441   .0160101     0.74   0.459    -.0195352    .0432233
     game_optimal_inv_r10 |  -.9779378   .5614521    -1.74   0.082    -2.078364     .122488
      communication_rules |  -.0469512   .0318763    -1.47   0.141    -.1094277    .0155253
     game_come_back_dummy |   .2443963   .6728288     0.36   0.716    -1.074324    1.563117
          game_discussion |  -.9502979   .7824948    -1.21   0.225    -2.483959    .5833636
                    _cons |   3.560373   1.554113     2.29   0.022     .5143682    6.606378
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only game_lead_facil
               game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2254554   .1220082     1.85   0.065    -.0136763    .4645872
 share_female_percent3_BS |   .0719811   .0393923     1.83   0.068    -.0052264    .1491885
             leader2_2_BS |  -.0452054   .1210011    -0.37   0.709    -.2823632    .1919524
             leader2_3_BS |  -.1864512   .1676158    -1.11   0.266    -.5149722    .1420698
    game_share_illit_vill |  -.0224148   .0838175    -0.27   0.789     -.186694    .1418644
participants_primary_only |  -.0695565   .0321052    -2.17   0.030    -.1324816   -.0066314
          game_lead_facil |  -.1399138   .1391814    -1.01   0.315    -.4127043    .1328767
  game_count_intervention |   .0031402   .0041605     0.75   0.450    -.0050143    .0112947
     game_optimal_inv_r10 |  -.2592795   .1355882    -1.91   0.056    -.5250275    .0064686
      communication_rules |  -.0124481   .0081099    -1.53   0.125    -.0283432    .0034469
     game_come_back_dummy |   .0647965   .1775046     0.37   0.715    -.2831062    .4126992
          game_discussion |  -.2519513   .1993998    -1.26   0.206    -.6427678    .1388651
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .21976889

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_2017_FS]game_lead_facil = 0
 ( 2)  [survey_maint_2017_FS]game_count_intervention = 0
 ( 3)  [survey_maint_2017_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_2017_FS]communication_rules = 0
 ( 5)  [survey_maint_2017_FS]game_come_back_dummy = 0
 ( 6)  [survey_maint_2017_FS]game_discussion = 0

           chi2(  6) =    7.76
         Prob > chi2 =    0.2563

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_2017_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_2017_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_2017_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_2017_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_2017_FS]participants_primary_only = 0

           chi2(  5) =    5.21
         Prob > chi2 =    0.3908

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. test $game

 ( 1)  [survey_maint_2017_FS]game_lead_facil = 0
 ( 2)  [survey_maint_2017_FS]game_count_intervention = 0
 ( 3)  [survey_maint_2017_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_2017_FS]communication_rules = 0
 ( 5)  [survey_maint_2017_FS]game_come_back_dummy = 0
 ( 6)  [survey_maint_2017_FS]game_discussion = 0

           chi2(  6) =    7.76
         Prob > chi2 =    0.2563

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. test $control

 ( 1)  [survey_maint_2017_FS]No_HH = 0
 ( 2)  [survey_maint_2017_FS]FES_site = 0
 ( 3)  [survey_maint_2017_FS]Shar_Lit = 0
 ( 4)  [survey_maint_2017_FS]Shar_SCST = 0
 ( 5)  [survey_maint_2017_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.49
         Prob > chi2 =    0.4817

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -26.381539  
Iteration 2:   log pseudolikelihood = -25.877457  
Iteration 3:   log pseudolikelihood = -25.874806  
Iteration 4:   log pseudolikelihood = -25.874805  

Probit regression                               Number of obs     =         55
                                                Wald chi2(12)     =      14.95
                                                Prob > chi2       =     0.2444
Log pseudolikelihood = -25.874805               Pseudo R2         =     0.2198

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |    .850362   .5060421     1.68   0.093    -.1414622    1.842186
 share_female_percent3_BS |   .2714948   .1463816     1.85   0.064    -.0154079    .5583974
             leader2_2_BS |  -.1705034   .4572524    -0.37   0.709    -1.066702    .7256948
             leader2_3_BS |  -.7032477   .6209473    -1.13   0.257    -1.920282    .5137866
    game_share_illit_vill |  -.0845432   .3164487    -0.27   0.789    -.7047712    .5356849
participants_primary_only |  -.2623498   .1324185    -1.98   0.048    -.5218853   -.0028143
          game_lead_facil |  -.5277201   .5366224    -0.98   0.325    -1.579481    .5240404
  game_count_intervention |   .0118441   .0160101     0.74   0.459    -.0195352    .0432233
     game_optimal_inv_r10 |  -.9779378   .5614521    -1.74   0.082    -2.078364     .122488
      communication_rules |  -.0469512   .0318763    -1.47   0.141    -.1094277    .0155253
     game_come_back_dummy |   .2443963   .6728288     0.36   0.716    -1.074324    1.563117
          game_discussion |  -.9502979   .7824948    -1.21   0.225    -2.483959    .5833636
                    _cons |   3.560373   1.554113     2.29   0.022     .5143682    6.606378
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only game_lead_facil
               game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2254554   .1220082     1.85   0.065    -.0136763    .4645872
 share_female_percent3_BS |   .0719811   .0393923     1.83   0.068    -.0052264    .1491885
             leader2_2_BS |  -.0452054   .1210011    -0.37   0.709    -.2823632    .1919524
             leader2_3_BS |  -.1864512   .1676158    -1.11   0.266    -.5149722    .1420698
    game_share_illit_vill |  -.0224148   .0838175    -0.27   0.789     -.186694    .1418644
participants_primary_only |  -.0695565   .0321052    -2.17   0.030    -.1324816   -.0066314
          game_lead_facil |  -.1399138   .1391814    -1.01   0.315    -.4127043    .1328767
  game_count_intervention |   .0031402   .0041605     0.75   0.450    -.0050143    .0112947
     game_optimal_inv_r10 |  -.2592795   .1355882    -1.91   0.056    -.5250275    .0064686
      communication_rules |  -.0124481   .0081099    -1.53   0.125    -.0283432    .0034469
     game_come_back_dummy |   .0647965   .1775046     0.37   0.715    -.2831062    .4126992
          game_discussion |  -.2519513   .1993998    -1.26   0.206    -.6427678    .1388651
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. tab treatment

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. sum $control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         83    175.2651    123.4358         24        633
    FES_site |         84    .6071429    .4913188          0          1
    Shar_Lit |         83    51.42858    8.370013   33.55556   73.15914
   Shar_SCST |         83     77.7139    19.35809   16.90491        100
survey_da~FS |         84    .4047619     .493794          0          1

. sum $participants

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
share_f~3_BS |         56     2.44898    1.754174          0   9.285714
leader2_2_BS |         56    .3035714    .4639609          0          1
leader2_3_BS |         56    .2321429    .4260205          0          1
game_share.. |         56    .4464286    .6324922          0   2.142857
participan~y |         84    5.535714    4.386305          0         13

. sum $game

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_lead_~l |         56    .1607143     .370591          0          1
game_count~n |         56    26.67857    15.23167          1         54
ga~l_inv_r10 |         56        .625    .4885042          0          1
communicat~s |         56     26.2619    7.484047          3         43
game_come_~y |         56        .875    .3337119          0          1
-------------+---------------------------------------------------------
game_discu~n |         55         .08    .2921187        -.4         .4

. tab Village if Shar_Lit==.

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Urdali  |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. tab treatment if Village=="Urdali"
no observations

. tab treatment if Village=="Urdali"
no observations

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.7893 >= 0.2000  removing game_share_illit_vill
p = 0.6934 >= 0.2000  removing game_come_back_dummy
p = 0.7121 >= 0.2000  removing leader2_2_BS
p = 0.3959 >= 0.2000  removing game_count_intervention
p = 0.3256 >= 0.2000  removing game_discussion
p = 0.3517 >= 0.2000  removing leader2_3_BS
p = 0.2367 >= 0.2000  removing game_optimal_inv_r10
p = 0.2080 >= 0.2000  removing participants_primary_only
p = 0.2635 >= 0.2000  removing share_female_percent3_BS
p = 0.2273 >= 0.2000  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       6.93
                                                Prob > chi2       =     0.0312
Log pseudolikelihood = -30.334113               Pseudo R2         =     0.0853

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
 communication_rules |  -.0409607   .0228906    -1.79   0.074    -.0858255    .0039041
     game_lead_facil |   -.972698   .4768238    -2.04   0.041    -1.907255   -.0381406
               _cons |   1.837836   .6507275     2.82   0.005     .5624334    3.113238
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. * Setting globals
. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
option robust not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, vce(robust)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
Doornik-Hansen test rejects normality of errors in the GUM.
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The in-sample Chow test rejects equality of coefficients
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The GUM fails 2 of 3 misspecification tests.  yRESET test for misspecification not rejected.  This GUM performs poorly. Care should be taken in interpretation.

This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         56
                                                F(1, 54)          =       2.40
                                                Prob > F          =     0.1273
                                                R-squared         =     0.0395
                                                Root MSE          =     .45088

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
game_count_intervention |   .0059448   .0038388     1.55   0.127    -.0017515    .0136411
                  _cons |   .5556865   .1305386     4.26   0.000     .2939723    .8174007
-----------------------------------------------------------------------------------------

. 
end of do-file

. help genspec

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, vce(robust) nodiagnostic   tlimit(1.5)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       3.91
                                                Prob > F          =     0.0260
                                                R-squared         =     0.0885
                                                Root MSE          =     .44334

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
               Shar_Lit |   .0120746   .0068843     1.75   0.085    -.0017335    .0258827
game_count_intervention |    .006818   .0035162     1.94   0.058    -.0002346    .0138705
                  _cons |  -.0867732   .3789305    -0.23   0.820    -.8468114    .6732651
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, vce(robust) nodiagnostic   tlimit(1.2)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         55
                                                F(6, 48)          =       2.75
                                                Prob > F          =     0.0223
                                                R-squared         =     0.1985
                                                Root MSE          =     .43524

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                 FES_site |   .1979766   .1383755     1.43   0.159    -.0802459    .4761991
                 Shar_Lit |   .0107722   .0069488     1.55   0.128    -.0031993    .0247438
participants_primary_only |  -.0483395   .0273708    -1.77   0.084    -.1033722    .0066933
  game_count_intervention |   .0080213   .0039836     2.01   0.050     .0000117    .0160309
     game_optimal_inv_r10 |  -.1822176   .1317932    -1.38   0.173    -.4472056    .0827703
          game_discussion |  -.2632014   .2090042    -1.26   0.214    -.6834325    .1570297
                    _cons |    .339358     .54219     0.63   0.534     -.750788    1.429504
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, vce(robust) nodiagnostic   tlimit(1)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         55
                                                F(7, 47)          =       2.40
                                                Prob > F          =     0.0346
                                                R-squared         =     0.2159
                                                Root MSE          =     .43505

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                    FES_site |   .1817113   .1429574     1.27   0.210    -.1058818    .4693045
                    Shar_Lit |    .009673   .0070351     1.37   0.176    -.0044798    .0238259
survey_dam_for_irrigation_FS |   .1314547    .128096     1.03   0.310    -.1262412    .3891507
   participants_primary_only |  -.0452871   .0264218    -1.71   0.093    -.0984409    .0078666
     game_count_intervention |    .008927    .004151     2.15   0.037     .0005763    .0172777
        game_optimal_inv_r10 |  -.1886438    .135058    -1.40   0.169    -.4603456    .0830579
             game_discussion |  -.2186358   .2107617    -1.04   0.305    -.6426336     .205362
                       _cons |   .3022639   .5371034     0.56   0.576    -.7782487    1.382776
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. bys treatment: tab $village

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control
too many variables specified
r(103);

end of do-file

r(103);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. bys Village: sum $village

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aouri Rayat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         283           .        283        283
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    64.72695           .   64.72695   64.72695
   Shar_SCST |          1    71.70994           .   71.70994   71.70994
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atarchuha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          43           .         43         43
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.26708           .   37.26708   37.26708
   Shar_SCST |          1    79.50311           .   79.50311   79.50311
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          83           .         83         83
    FES_site |          1           1           .          1          1
    Shar_Lit |          1          50           .         50         50
   Shar_SCST |          1    99.33775           .   99.33775   99.33775
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aurai Mal.(Ourai Mal.)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          49           .         49         49
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    56.57371           .   56.57371   56.57371
   Shar_SCST |          1    61.35458           .   61.35458   61.35458
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Baghraudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         264           .        264        264
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    42.41922           .   42.41922   42.41922
   Shar_SCST |          1    89.97514           .   89.97514   89.97514
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bamhani Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         193           .        193        193
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.87045           .   55.87045   55.87045
   Shar_SCST |          1    86.63968           .   86.63968   86.63968
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Banijagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          57           .         57         57
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    40.72165           .   40.72165   40.72165
   Shar_SCST |          1    48.45361           .   48.45361   48.45361
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bariha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         236           .        236        236
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.39961           .   48.39961   48.39961
   Shar_SCST |          1    34.62658           .   34.62658   34.62658
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Barkheda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          90           .         90         90
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.42466           .   53.42466   53.42466
   Shar_SCST |          1     66.0274           .    66.0274    66.0274
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Batwar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         183           .        183        183
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.08311           .   53.08311   53.08311
   Shar_SCST |          1    96.64879           .   96.64879   96.64879
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhapsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         156           .        156        156
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    55.31915           .   55.31915   55.31915
   Shar_SCST |          1    99.69605           .   99.69605   99.69605
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         107           .        107        107
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    73.15914           .   73.15914   73.15914
   Shar_SCST |          1    85.98575           .   85.98575   85.98575
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawartal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          73           .         73         73
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.96907           .   48.96907   48.96907
   Shar_SCST |          1    98.96907           .   98.96907   98.96907
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhimpuri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         170           .        170        170
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.30887           .   37.30887   37.30887
   Shar_SCST |          1    89.60245           .   89.60245   89.60245
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Birsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         152           .        152        152
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.06071           .   48.06071   48.06071
   Shar_SCST |          1    90.72513           .   90.72513   90.72513
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Budhanwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         141           .        141        141
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    49.90291           .   49.90291   49.90291
   Shar_SCST |          1    53.20388           .   53.20388   53.20388
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chandiya Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         170           .        170        170
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.36723           .   55.36723   55.36723
   Shar_SCST |          1    69.49153           .   69.49153   69.49153
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Changariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         149           .        149        149
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    46.69604           .   46.69604   46.69604
   Shar_SCST |          1    66.81351           .   66.81351   66.81351
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chatuwakhar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         136           .        136        136
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.18251           .   54.18251   54.18251
   Shar_SCST |          1    81.36882           .   81.36882   81.36882
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chouranga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         432           .        432        432
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.10949           .   55.10949   55.10949
   Shar_SCST |          1    19.82968           .   19.82968   19.82968
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Danitola

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         633           .        633        633
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.28155           .   49.28155   49.28155
   Shar_SCST |          1    64.66019           .   64.66019   64.66019
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Deori

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         160           .        160        160
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    59.58466           .   59.58466   59.58466
   Shar_SCST |          1    86.26198           .   86.26198   86.26198
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dhamangaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          95           .         95         95
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    35.53299           .   35.53299   35.53299
   Shar_SCST |          1    48.98477           .   48.98477   48.98477
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dharampuri Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         191           .        191        191
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.51724           .   37.51724   37.51724
   Shar_SCST |          1    88.41379           .   88.41379   88.41379
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dilwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          65           .         65         65
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     47.2103           .    47.2103    47.2103
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dudka

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         167           .        167        167
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    67.15976           .   67.15976   67.15976
   Shar_SCST |          1    78.10651           .   78.10651   78.10651
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungaria

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         111           .        111        111
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    60.55684           .   60.55684   60.55684
   Shar_SCST |          1     71.2297           .    71.2297    71.2297
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungariya Ramnagar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         123           .        123        123
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    52.07469           .   52.07469   52.07469
   Shar_SCST |          1      93.361           .     93.361     93.361
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungravt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         178           .        178        178
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    56.12245           .   56.12245   56.12245
   Shar_SCST |          1    56.99708           .   56.99708   56.99708
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Fonk

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         418           .        418        418
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    61.47186           .   61.47186   61.47186
   Shar_SCST |          1    38.77551           .   38.77551   38.77551
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ghont

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         256           .        256        256
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    56.88801           .   56.88801   56.88801
   Shar_SCST |          1    54.01388           .   54.01388   54.01388
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gubri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          97           .         97         97
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.12834           .   48.12834   48.12834
   Shar_SCST |          1    76.47059           .   76.47059   76.47059
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          64           .         64         64
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    47.34848           .   47.34848   47.34848
   Shar_SCST |          1    70.45455           .   70.45455   70.45455
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunehara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         149           .        149        149
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    53.85935           .   53.85935   53.85935
   Shar_SCST |          1    78.55918           .   78.55918   78.55918
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         216           .        216        216
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    50.72604           .   50.72604   50.72604
   Shar_SCST |          1    90.31946           .   90.31946   90.31946
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         187           .        187        187
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    62.44784           .   62.44784   62.44784
   Shar_SCST |          1    71.07093           .   71.07093   71.07093
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhagul

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         118           .        118        118
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.85057           .   58.85057   58.85057
   Shar_SCST |          1    82.75862           .   82.75862   82.75862
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhulup

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         180           .        180        180
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    36.51926           .   36.51926   36.51926
   Shar_SCST |          1    79.17261           .   79.17261   79.17261
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Kalan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         250           .        250        250
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.44023           .   43.44023   43.44023
   Shar_SCST |          1    71.72012           .   71.72012   71.72012
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Khurd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          91           .         91         91
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    36.34312           .   36.34312   36.34312
   Shar_SCST |          1    83.74718           .   83.74718   83.74718
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kata Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         221           .        221        221
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    56.68571           .   56.68571   56.68571
   Shar_SCST |          1    47.88571           .   47.88571   47.88571
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katajar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         244           .        244        244
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.93204           .   58.93204   58.93204
   Shar_SCST |          1    96.69903           .   96.69903   96.69903
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          47           .         47         47
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.79518           .   48.79518   48.79518
   Shar_SCST |          1    51.20482           .   51.20482   51.20482
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          24           .         24         24
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    65.26316           .   65.26316   65.26316
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khalaudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         329           .        329        329
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.51807           .   54.51807   54.51807
   Shar_SCST |          1    81.62651           .   81.62651   81.62651
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khamrauti

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         410           .        410        410
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    50.23474           .   50.23474   50.23474
   Shar_SCST |          1    81.33803           .   81.33803   81.33803
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khatiya Narangi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         335           .        335        335
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    55.02152           .   55.02152   55.02152
   Shar_SCST |          1    64.77762           .   64.77762   64.77762
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khirahani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         364           .        364        364
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    68.21429           .   68.21429   68.21429
   Shar_SCST |          1        49.5           .       49.5       49.5
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kosampani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         228           .        228        228
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    50.27933           .   50.27933   50.27933
   Shar_SCST |          1    74.52514           .   74.52514   74.52514
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kurwahi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         109           .        109        109
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.99061           .   53.99061   53.99061
   Shar_SCST |          1    96.94836           .   96.94836   96.94836
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Lohta F.V.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         105           .        105        105
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    33.55556           .   33.55556   33.55556
   Shar_SCST |          1    67.55556           .   67.55556   67.55556
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Magdha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          31           .         31         31
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     51.1811           .    51.1811    51.1811
   Shar_SCST |          1     98.4252           .    98.4252    98.4252
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Malara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          96           .         96         96
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    46.66667           .   46.66667   46.66667
   Shar_SCST |          1    77.03704           .   77.03704   77.03704
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          87           .         87         87
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    53.36323           .   53.36323   53.36323
   Shar_SCST |          1    94.61883           .   94.61883   94.61883
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         255           .        255        255
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    52.74949           .   52.74949   52.74949
   Shar_SCST |          1    83.70672           .   83.70672   83.70672
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          76           .         76         76
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    43.49315           .   43.49315   43.49315
   Shar_SCST |          1    95.89041           .   95.89041   95.89041
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manikpur Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         132           .        132        132
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     37.4031           .    37.4031    37.4031
   Shar_SCST |          1    91.66667           .   91.66667   91.66667
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manoharpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         294           .        294        294
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    47.70798           .   47.70798   47.70798
   Shar_SCST |          1    80.13582           .   80.13582   80.13582
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mataval

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         633           .        633        633
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.28155           .   49.28155   49.28155
   Shar_SCST |          1    64.66019           .   64.66019   64.66019
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Medhatal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         188           .        188        188
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    47.39726           .   47.39726   47.39726
   Shar_SCST |          1    93.28767           .   93.28767   93.28767
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         129           .        129        129
    FES_site |          1           1           .          1          1
    Shar_Lit |          1        54.2           .       54.2       54.2
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         152           .        152        152
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    38.97181           .   38.97181   38.97181
   Shar_SCST |          1    94.52736           .   94.52736   94.52736
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mubala_Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         104           .        104        104
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.08126           .   48.08126   48.08126
   Shar_SCST |          1     99.3228           .    99.3228    99.3228
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Muhad

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         418           .        418        418
    FES_site |          1           0           .          0          0
    Shar_Lit |          1     53.7601           .    53.7601    53.7601
   Shar_SCST |          1    16.90491           .   16.90491   16.90491
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mulwalasani Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          34           .         34         34
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.33333           .   58.33333   58.33333
   Shar_SCST |          1    84.16667           .   84.16667   84.16667
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Newsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         146           .        146        146
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    58.76289           .   58.76289   58.76289
   Shar_SCST |          1    44.15808           .   44.15808   44.15808
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Padariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         305           .        305        305
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    45.72464           .   45.72464   45.72464
   Shar_SCST |          1    96.88406           .   96.88406   96.88406
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Patpara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          40           .         40         40
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    44.44444           .   44.44444   44.44444
   Shar_SCST |          1     96.9697           .    96.9697    96.9697
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rajo Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         356           .        356        356
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    51.93966           .   51.93966   51.93966
   Shar_SCST |          1    66.88218           .   66.88218   66.88218
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rata

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         169           .        169        169
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    69.11977           .   69.11977   69.11977
   Shar_SCST |          1    67.09957           .   67.09957   67.09957
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ratanpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         118           .        118        118
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.57769           .   55.57769   55.57769
   Shar_SCST |          1     94.0239           .    94.0239    94.0239
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Samaiya Bhagpur FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         104           .        104        104
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    42.82297           .   42.82297   42.82297
   Shar_SCST |          1    93.30144           .   93.30144   93.30144
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Saradoli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         172           .        172        172
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    65.54364           .   65.54364   65.54364
   Shar_SCST |          1    77.79479           .   77.79479   77.79479
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarasdoli

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          31           .         31         31
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.70085           .   54.70085   54.70085
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarhi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         150           .        150        150
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    52.33083           .   52.33083   52.33083
   Shar_SCST |          1    74.13534           .   74.13534   74.13534
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sautia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          61           .         61         61
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    57.83582           .   57.83582   57.83582
   Shar_SCST |          1    99.25373           .   99.25373   99.25373
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Shahapur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          25           .         25         25
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.13725           .   43.13725   43.13725
   Shar_SCST |          1    92.15686           .   92.15686   92.15686
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Taktuwa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         110           .        110        110
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    41.48936           .   41.48936   41.48936
   Shar_SCST |          1    83.61702           .   83.61702   83.61702
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Thonda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         302           .        302        302
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.46084           .   53.46084   53.46084
   Shar_SCST |          1    59.83607           .   59.83607   59.83607
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Tilari

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         101           .        101        101
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    61.34663           .   61.34663   61.34663
   Shar_SCST |          1    55.86035           .   55.86035   55.86035
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Umariya FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         222           .        222        222
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    52.17391           .   52.17391   52.17391
   Shar_SCST |          1    90.90909           .   90.90909   90.90909
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          0
    FES_site |          1           0           .          0          0
    Shar_Lit |          0
   Shar_SCST |          0
survey_da~FS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          85           .         85         85
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.26425           .   43.26425   43.26425
   Shar_SCST |          1    96.89119           .   96.89119   96.89119
survey_da~FS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Vishanpura Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          89           .         89         89
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.19094           .   49.19094   49.19094
   Shar_SCST |          1    99.02913           .   99.02913   99.02913
survey_da~FS |          1           0           .          0          0


. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. bys Village: sum $village survey_maint_12m_BS

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aouri Rayat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         283           .        283        283
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    64.72695           .   64.72695   64.72695
   Shar_SCST |          1    71.70994           .   71.70994   71.70994
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atarchuha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          43           .         43         43
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.26708           .   37.26708   37.26708
   Shar_SCST |          1    79.50311           .   79.50311   79.50311
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Atariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          83           .         83         83
    FES_site |          1           1           .          1          1
    Shar_Lit |          1          50           .         50         50
   Shar_SCST |          1    99.33775           .   99.33775   99.33775
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Aurai Mal.(Ourai Mal.)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          49           .         49         49
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    56.57371           .   56.57371   56.57371
   Shar_SCST |          1    61.35458           .   61.35458   61.35458
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Baghraudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         264           .        264        264
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    42.41922           .   42.41922   42.41922
   Shar_SCST |          1    89.97514           .   89.97514   89.97514
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bamhani Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         193           .        193        193
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.87045           .   55.87045   55.87045
   Shar_SCST |          1    86.63968           .   86.63968   86.63968
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Banijagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          57           .         57         57
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    40.72165           .   40.72165   40.72165
   Shar_SCST |          1    48.45361           .   48.45361   48.45361
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bariha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         236           .        236        236
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.39961           .   48.39961   48.39961
   Shar_SCST |          1    34.62658           .   34.62658   34.62658
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Barkheda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          90           .         90         90
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.42466           .   53.42466   53.42466
   Shar_SCST |          1     66.0274           .    66.0274    66.0274
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Batwar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         183           .        183        183
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.08311           .   53.08311   53.08311
   Shar_SCST |          1    96.64879           .   96.64879   96.64879
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhapsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         156           .        156        156
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    55.31915           .   55.31915   55.31915
   Shar_SCST |          1    99.69605           .   99.69605   99.69605
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         107           .        107        107
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    73.15914           .   73.15914   73.15914
   Shar_SCST |          1    85.98575           .   85.98575   85.98575
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhawartal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          73           .         73         73
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.96907           .   48.96907   48.96907
   Shar_SCST |          1    98.96907           .   98.96907   98.96907
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Bhimpuri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         170           .        170        170
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.30887           .   37.30887   37.30887
   Shar_SCST |          1    89.60245           .   89.60245   89.60245
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Birsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         152           .        152        152
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.06071           .   48.06071   48.06071
   Shar_SCST |          1    90.72513           .   90.72513   90.72513
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Budhanwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         141           .        141        141
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    49.90291           .   49.90291   49.90291
   Shar_SCST |          1    53.20388           .   53.20388   53.20388
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chandiya Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         170           .        170        170
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.36723           .   55.36723   55.36723
   Shar_SCST |          1    69.49153           .   69.49153   69.49153
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Changariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         149           .        149        149
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    46.69604           .   46.69604   46.69604
   Shar_SCST |          1    66.81351           .   66.81351   66.81351
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chatuwakhar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         136           .        136        136
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.18251           .   54.18251   54.18251
   Shar_SCST |          1    81.36882           .   81.36882   81.36882
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Chouranga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         432           .        432        432
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.10949           .   55.10949   55.10949
   Shar_SCST |          1    19.82968           .   19.82968   19.82968
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Danitola

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         633           .        633        633
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.28155           .   49.28155   49.28155
   Shar_SCST |          1    64.66019           .   64.66019   64.66019
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Deori

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         160           .        160        160
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    59.58466           .   59.58466   59.58466
   Shar_SCST |          1    86.26198           .   86.26198   86.26198
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dhamangaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          95           .         95         95
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    35.53299           .   35.53299   35.53299
   Shar_SCST |          1    48.98477           .   48.98477   48.98477
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dharampuri Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         191           .        191        191
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    37.51724           .   37.51724   37.51724
   Shar_SCST |          1    88.41379           .   88.41379   88.41379
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dilwara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          65           .         65         65
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     47.2103           .    47.2103    47.2103
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dudka

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         167           .        167        167
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    67.15976           .   67.15976   67.15976
   Shar_SCST |          1    78.10651           .   78.10651   78.10651
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungaria

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         111           .        111        111
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    60.55684           .   60.55684   60.55684
   Shar_SCST |          1     71.2297           .    71.2297    71.2297
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungariya Ramnagar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         123           .        123        123
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    52.07469           .   52.07469   52.07469
   Shar_SCST |          1      93.361           .     93.361     93.361
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Dungravt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         178           .        178        178
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    56.12245           .   56.12245   56.12245
   Shar_SCST |          1    56.99708           .   56.99708   56.99708
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Fonk

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         418           .        418        418
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    61.47186           .   61.47186   61.47186
   Shar_SCST |          1    38.77551           .   38.77551   38.77551
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ghont

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         256           .        256        256
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    56.88801           .   56.88801   56.88801
   Shar_SCST |          1    54.01388           .   54.01388   54.01388
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gubri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          97           .         97         97
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.12834           .   48.12834   48.12834
   Shar_SCST |          1    76.47059           .   76.47059   76.47059
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          64           .         64         64
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    47.34848           .   47.34848   47.34848
   Shar_SCST |          1    70.45455           .   70.45455   70.45455
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Gunehara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         149           .        149        149
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    53.85935           .   53.85935   53.85935
   Shar_SCST |          1    78.55918           .   78.55918   78.55918
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         216           .        216        216
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    50.72604           .   50.72604   50.72604
   Shar_SCST |          1    90.31946           .   90.31946   90.31946
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Harrabhat Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         187           .        187        187
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    62.44784           .   62.44784   62.44784
   Shar_SCST |          1    71.07093           .   71.07093   71.07093
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhagul

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         118           .        118        118
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.85057           .   58.85057   58.85057
   Shar_SCST |          1    82.75862           .   82.75862   82.75862
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Jhulup

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         180           .        180        180
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    36.51926           .   36.51926   36.51926
   Shar_SCST |          1    79.17261           .   79.17261   79.17261
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Kalan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         250           .        250        250
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.44023           .   43.44023   43.44023
   Shar_SCST |          1    71.72012           .   71.72012   71.72012
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kanhari Khurd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          91           .         91         91
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    36.34312           .   36.34312   36.34312
   Shar_SCST |          1    83.74718           .   83.74718   83.74718
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kata Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         221           .        221        221
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    56.68571           .   56.68571   56.68571
   Shar_SCST |          1    47.88571           .   47.88571   47.88571
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katajar

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         244           .        244        244
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.93204           .   58.93204   58.93204
   Shar_SCST |          1    96.69903           .   96.69903   96.69903
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          47           .         47         47
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    48.79518           .   48.79518   48.79518
   Shar_SCST |          1    51.20482           .   51.20482   51.20482
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Katanga Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          24           .         24         24
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    65.26316           .   65.26316   65.26316
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khalaudi FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         329           .        329        329
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.51807           .   54.51807   54.51807
   Shar_SCST |          1    81.62651           .   81.62651   81.62651
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khamrauti

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         410           .        410        410
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    50.23474           .   50.23474   50.23474
   Shar_SCST |          1    81.33803           .   81.33803   81.33803
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khatiya Narangi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         335           .        335        335
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    55.02152           .   55.02152   55.02152
   Shar_SCST |          1    64.77762           .   64.77762   64.77762
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Khirahani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         364           .        364        364
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    68.21429           .   68.21429   68.21429
   Shar_SCST |          1        49.5           .       49.5       49.5
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kosampani

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         228           .        228        228
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    50.27933           .   50.27933   50.27933
   Shar_SCST |          1    74.52514           .   74.52514   74.52514
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Kurwahi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         109           .        109        109
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.99061           .   53.99061   53.99061
   Shar_SCST |          1    96.94836           .   96.94836   96.94836
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Lohta F.V.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         105           .        105        105
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    33.55556           .   33.55556   33.55556
   Shar_SCST |          1    67.55556           .   67.55556   67.55556
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Magdha

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          31           .         31         31
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     51.1811           .    51.1811    51.1811
   Shar_SCST |          1     98.4252           .    98.4252    98.4252
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Malara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          96           .         96         96
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    46.66667           .   46.66667   46.66667
   Shar_SCST |          1    77.03704           .   77.03704   77.03704
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manegaon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          87           .         87         87
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    53.36323           .   53.36323   53.36323
   Shar_SCST |          1    94.61883           .   94.61883   94.61883
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         255           .        255        255
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    52.74949           .   52.74949   52.74949
   Shar_SCST |          1    83.70672           .   83.70672   83.70672
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mangaveli Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          76           .         76         76
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    43.49315           .   43.49315   43.49315
   Shar_SCST |          1    95.89041           .   95.89041   95.89041
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manikpur Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         132           .        132        132
    FES_site |          1           1           .          1          1
    Shar_Lit |          1     37.4031           .    37.4031    37.4031
   Shar_SCST |          1    91.66667           .   91.66667   91.66667
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Manoharpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         294           .        294        294
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    47.70798           .   47.70798   47.70798
   Shar_SCST |          1    80.13582           .   80.13582   80.13582
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mataval

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         633           .        633        633
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.28155           .   49.28155   49.28155
   Shar_SCST |          1    64.66019           .   64.66019   64.66019
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Medhatal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         188           .        188        188
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    47.39726           .   47.39726   47.39726
   Shar_SCST |          1    93.28767           .   93.28767   93.28767
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         129           .        129        129
    FES_site |          1           1           .          1          1
    Shar_Lit |          1        54.2           .       54.2       54.2
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mohagoan 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         152           .        152        152
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    38.97181           .   38.97181   38.97181
   Shar_SCST |          1    94.52736           .   94.52736   94.52736
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mubala_Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         104           .        104        104
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    48.08126           .   48.08126   48.08126
   Shar_SCST |          1     99.3228           .    99.3228    99.3228
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Muhad

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         418           .        418        418
    FES_site |          1           0           .          0          0
    Shar_Lit |          1     53.7601           .    53.7601    53.7601
   Shar_SCST |          1    16.90491           .   16.90491   16.90491
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Mulwalasani Ryt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          34           .         34         34
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    58.33333           .   58.33333   58.33333
   Shar_SCST |          1    84.16667           .   84.16667   84.16667
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Newsa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         146           .        146        146
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    58.76289           .   58.76289   58.76289
   Shar_SCST |          1    44.15808           .   44.15808   44.15808
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Padariya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         305           .        305        305
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    45.72464           .   45.72464   45.72464
   Shar_SCST |          1    96.88406           .   96.88406   96.88406
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Patpara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          40           .         40         40
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    44.44444           .   44.44444   44.44444
   Shar_SCST |          1     96.9697           .    96.9697    96.9697
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rajo Mal.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         356           .        356        356
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    51.93966           .   51.93966   51.93966
   Shar_SCST |          1    66.88218           .   66.88218   66.88218
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Rata

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         169           .        169        169
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    69.11977           .   69.11977   69.11977
   Shar_SCST |          1    67.09957           .   67.09957   67.09957
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Ratanpur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         118           .        118        118
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    55.57769           .   55.57769   55.57769
   Shar_SCST |          1     94.0239           .    94.0239    94.0239
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Samaiya Bhagpur FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         104           .        104        104
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    42.82297           .   42.82297   42.82297
   Shar_SCST |          1    93.30144           .   93.30144   93.30144
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Saradoli Mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         172           .        172        172
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    65.54364           .   65.54364   65.54364
   Shar_SCST |          1    77.79479           .   77.79479   77.79479
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarasdoli

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          31           .         31         31
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    54.70085           .   54.70085   54.70085
   Shar_SCST |          1         100           .        100        100
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sarhi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         150           .        150        150
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    52.33083           .   52.33083   52.33083
   Shar_SCST |          1    74.13534           .   74.13534   74.13534
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Sautia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          61           .         61         61
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    57.83582           .   57.83582   57.83582
   Shar_SCST |          1    99.25373           .   99.25373   99.25373
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Shahapur

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          25           .         25         25
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.13725           .   43.13725   43.13725
   Shar_SCST |          1    92.15686           .   92.15686   92.15686
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Taktuwa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         110           .        110        110
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    41.48936           .   41.48936   41.48936
   Shar_SCST |          1    83.61702           .   83.61702   83.61702
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Thonda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         302           .        302        302
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    53.46084           .   53.46084   53.46084
   Shar_SCST |          1    59.83607           .   59.83607   59.83607
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Tilari

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         101           .        101        101
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    61.34663           .   61.34663   61.34663
   Shar_SCST |          1    55.86035           .   55.86035   55.86035
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Umariya FV

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1         222           .        222        222
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    52.17391           .   52.17391   52.17391
   Shar_SCST |          1    90.90909           .   90.90909   90.90909
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          0
    FES_site |          1           0           .          0          0
    Shar_Lit |          0
   Shar_SCST |          0
survey_da~FS |          1           1           .          1          1
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Urdali mal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          85           .         85         85
    FES_site |          1           1           .          1          1
    Shar_Lit |          1    43.26425           .   43.26425   43.26425
   Shar_SCST |          1    96.89119           .   96.89119   96.89119
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           1           .          1          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> Village = Vishanpura Ryt.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |          1          89           .         89         89
    FES_site |          1           0           .          0          0
    Shar_Lit |          1    49.19094           .   49.19094   49.19094
   Shar_SCST |          1    99.02913           .   99.02913   99.02913
survey_da~FS |          1           0           .          0          0
-------------+---------------------------------------------------------
survey~2m_BS |          1           0           .          0          0


. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. bys treatment: sum $village survey_maint_12m_BS $participants $game

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1
-------------+---------------------------------------------------------
survey~2m_BS |         28          .5    .5091751          0          1
share_f~3_BS |          0
leader2_2_BS |          0
leader2_3_BS |          0
game_share.. |          0
-------------+---------------------------------------------------------
participan~y |         28           0           0          0          0
game_lead_~l |          0
game_count~n |          0
ga~l_inv_r10 |          0
communicat~s |          0
-------------+---------------------------------------------------------
game_come_~y |          0
game_discu~n |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1
-------------+---------------------------------------------------------
survey~2m_BS |         56    .5357143    .5032363          0          1
share_f~3_BS |         56     2.44898    1.754174          0   9.285714
leader2_2_BS |         56    .3035714    .4639609          0          1
leader2_3_BS |         56    .2321429    .4260205          0          1
game_share.. |         56    .4464286    .6324922          0   2.142857
-------------+---------------------------------------------------------
participan~y |         56    8.303571    2.373487          4         13
game_lead_~l |         56    .1607143     .370591          0          1
game_count~n |         56    26.67857    15.23167          1         54
ga~l_inv_r10 |         56        .625    .4885042          0          1
communicat~s |         56     26.2619    7.484047          3         43
-------------+---------------------------------------------------------
game_come_~y |         56        .875    .3337119          0          1
game_discu~n |         55         .08    .2921187        -.4         .4


. 
end of do-file

. tab Village if game_discussion==.

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                     Aouri Rayat |          1        3.45        3.45
          Aurai Mal.(Ourai Mal.) |          1        3.45        6.90
                    Bamhani Ryt. |          1        3.45       10.34
                        Barkheda |          1        3.45       13.79
                          Bhawan |          1        3.45       17.24
                       Bhawartal |          1        3.45       20.69
                        Bhimpuri |          1        3.45       24.14
                           Birsa |          1        3.45       27.59
                       Chouranga |          1        3.45       31.03
                        Danitola |          1        3.45       34.48
                        Dungaria |          1        3.45       37.93
                       Harrabhat |          1        3.45       41.38
                  Harrabhat Mal. |          1        3.45       44.83
                         Katajar |          1        3.45       48.28
                     Katanga Mal |          1        3.45       51.72
                         Kurwahi |          1        3.45       55.17
                      Lohta F.V. |          1        3.45       58.62
                          Malara |          1        3.45       62.07
                         Mataval |          1        3.45       65.52
                        Mohagoan |          1        3.45       68.97
                      Mohagoan 2 |          1        3.45       72.41
                           Muhad |          1        3.45       75.86
                           Newsa |          1        3.45       79.31
                         Patpara |          1        3.45       82.76
                       Rajo Mal. |          1        3.45       86.21
                        Ratanpur |          1        3.45       89.66
                         Urdali  |          1        3.45       93.10
                      Urdali mal |          1        3.45       96.55
                 Vishanpura Ryt. |          1        3.45      100.00
---------------------------------+-----------------------------------
                           Total |         29      100.00

. tab Village if game_discussion==. & treatment==1

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                        Dungaria |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. sum game_discussion if treatment==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_discu~n |         55         .08    .2921187        -.4         .4

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. replace game_discussion = 0.08 if game_discussion==. & treatment==1
(1 real change made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929
variable game_discussion already defined
r(110);

end of do-file

r(110);

. sum survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
su~c_meet_FS |         55    .1090909    .3146266          0          1
survey~rs_FS |         55    .1272727      .33635          0          1
survey~ds_FS |         55    .4727273    .5038572          0          1
survey~ly_FS |         55    .5090909     .504525          0          1
su~m_meet_FS |         55    .3454545     .479899          0          1

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. egen game_discussion = rowtotal (survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_c
> omm_meet_FS)
variable game_discussion already defined
r(110);

end of do-file

r(110);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen game_discussion = rowtotal (survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_c
> omm_meet_FS)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. sum game_discussion if treatment==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_discu~n |         56    1.535714    .6595945          0          3

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. sum game_discussion if treatment==1, detail

                       game_discussion
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              1
10%            1              1       Obs                  56
25%            1              1       Sum of Wgt.          56

50%            1                      Mean           1.535714
                        Largest       Std. Dev.      .6595945
75%            2              3
90%            2              3       Variance       .4350649
95%            3              3       Skewness       .4432842
99%            3              3       Kurtosis       2.672604

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. replace game_discussion = 1 if game_discussion==. & treatment==1
(0 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822
variable communication_rules already defined
r(110);

end of do-file

r(110);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. bys treatment: sum $village survey_maint_12m_BS $participants $game

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control
variable participants_primary_only not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS,

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen game_discussion = rowtotal (survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_c
> omm_meet_FS)

. sum game_discussion if treatment==1, detail

                       game_discussion
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              1
10%            1              1       Obs                  56
25%            1              1       Sum of Wgt.          56

50%            1                      Mean           1.535714
                        Largest       Std. Dev.      .6595945
75%            2              3
90%            2              3       Variance       .4350649
95%            3              3       Skewness       .4432842
99%            3              3       Kurtosis       2.672604

. replace game_discussion = 1 if game_discussion==. & treatment==1
(0 real changes made)

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. * Setting globals
. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
. 
. 
. 
. *main outcome variables
. *conflict
. 
. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. bys treatment: sum $village survey_maint_12m_BS $participants $game

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1
-------------+---------------------------------------------------------
survey~2m_BS |         28          .5    .5091751          0          1
share_f~3_BS |          0
leader2_2_BS |          0
leader2_3_BS |          0
game_share.. |          0
-------------+---------------------------------------------------------
participan~y |         28           0           0          0          0
game_lead_~l |          0
game_count~n |          0
ga~l_inv_r10 |          0
communicat~s |          0
-------------+---------------------------------------------------------
game_come_~y |          0
game_discu~n |         28           0           0          0          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1
-------------+---------------------------------------------------------
survey~2m_BS |         56    .5357143    .5032363          0          1
share_f~3_BS |         56     2.44898    1.754174          0   9.285714
leader2_2_BS |         56    .3035714    .4639609          0          1
leader2_3_BS |         56    .2321429    .4260205          0          1
game_share.. |         56    .4464286    .6324922          0   2.142857
-------------+---------------------------------------------------------
participan~y |         56    8.303571    2.373487          4         13
game_lead_~l |         56    .1607143     .370591          0          1
game_count~n |         56    26.67857    15.23167          1         54
ga~l_inv_r10 |         56        .625    .4885042          0          1
communicat~s |         56     26.2619    7.484047          3         43
-------------+---------------------------------------------------------
game_come_~y |         56        .875    .3337119          0          1
game_discu~n |         56    1.535714    .6595945          0          3


. *why do we have all missing for this one strange village that went from treatment to control?
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.140228  
Iteration 2:   log pseudolikelihood = -29.089651  
Iteration 3:   log pseudolikelihood = -29.089615  
Iteration 4:   log pseudolikelihood = -29.089615  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =       8.93
                                                Prob > chi2       =     0.2574
Log pseudolikelihood = -29.089615               Pseudo R2         =     0.1317

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |    .406435   .4111016     0.99   0.323    -.3993093    1.212179
        game_lead_facil |   -.729121   .5163421    -1.41   0.158    -1.741133    .2828909
game_count_intervention |   .0102123   .0141232     0.72   0.470    -.0174687    .0378933
   game_optimal_inv_r10 |   -.293263   .4390177    -0.67   0.504    -1.153722    .5671959
    communication_rules |   -.037369   .0248719    -1.50   0.133    -.0861171    .0113791
   game_come_back_dummy |  -.1682268   .5729247    -0.29   0.769    -1.291139    .9546849
        game_discussion |  -.2737645   .2862337    -0.96   0.339    -.8347723    .2872434
                  _cons |   2.015012   .8504926     2.37   0.018     .3480772    3.681947
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. genspec  survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, vce(robust) nodiagnostic   tlimit(1)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       2.18
                                                Prob > F          =     0.0609
                                                R-squared         =     0.1899
                                                Root MSE          =     .43468

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                    FES_site |   .1716889   .1414979     1.21   0.231    -.1126618    .4560396
survey_dam_for_irrigation_FS |   .1637703   .1233911     1.33   0.191    -.0841933    .4117339
   participants_primary_only |  -.0441154   .0258359    -1.71   0.094    -.0960346    .0078038
     game_count_intervention |   .0085546   .0041062     2.08   0.042      .000303    .0168063
        game_optimal_inv_r10 |  -.1680322   .1311102    -1.28   0.206     -.431508    .0954436
             game_discussion |  -.1179508   .0932072    -1.27   0.212    -.3052577    .0693562
                       _cons |   .9487776   .3275472     2.90   0.006     .2905468    1.607008
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.9572 >= 0.2000  removing game_share_illit_vill
p = 0.9042 >= 0.2000  removing leader2_2_BS
p = 0.8667 >= 0.2000  removing No_HH
p = 0.4545 >= 0.2000  removing communication_rules
p = 0.4931 >= 0.2000  removing leader2_3_BS
p = 0.3827 >= 0.2000  removing game_discussion
p = 0.4592 >= 0.2000  removing FES_site
p = 0.3992 >= 0.2000  removing game_count_intervention
p = 0.4637 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.3191 >= 0.2000  removing game_come_back_dummy
p = 0.2438 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =      13.24
                                                Prob > chi2       =     0.0394
Log pseudolikelihood = -26.656052               Pseudo R2         =     0.2044

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .7910392    .448133     1.77   0.078    -.0872854    1.669364
     game_optimal_inv_r10 |  -.7007702   .5246864    -1.34   0.182    -1.729137    .3275962
participants_primary_only |  -.1612019   .0967361    -1.67   0.096    -.3508012    .0283975
                 Shar_Lit |   .0507741   .0254417     2.00   0.046     .0009092     .100639
 share_female_percent3_BS |   .2492234   .1419223     1.76   0.079    -.0289393     .527386
          game_lead_facil |  -1.065689   .5160362    -2.07   0.039    -2.077101   -.0542763
                    _cons |  -.8827891   1.749464    -0.50   0.614    -4.311675    2.546097
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. test $village

 ( 1)  [survey_maint_2017_FS]No_HH = 0
 ( 2)  [survey_maint_2017_FS]FES_site = 0
 ( 3)  [survey_maint_2017_FS]Shar_Lit = 0
 ( 4)  [survey_maint_2017_FS]Shar_SCST = 0
 ( 5)  [survey_maint_2017_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.49
         Prob > chi2 =    0.4817

. local r2_p= e(r2_p)

. eststo maint1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_2017_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_2017_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_2017_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_2017_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_2017_FS]participants_primary_only = 0

           chi2(  5) =    5.21
         Prob > chi2 =    0.3908

. local r2_p= e(r2_p)

. eststo maint2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .1631732   .1189851     1.37   0.170    -.0700333    .3963796
 share_female_percent3_BS |   .0784279   .0378423     2.07   0.038     .0042583    .1525975
             leader2_2_BS |   -.004692   .1445483    -0.03   0.974    -.2880014    .2786173
             leader2_3_BS |  -.1457784   .1534255    -0.95   0.342    -.4464869    .1549301
    game_share_illit_vill |  -.0217381   .1047091    -0.21   0.836    -.2269643    .1834881
participants_primary_only |  -.0326774   .0273486    -1.19   0.232    -.0862798     .020925
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .07367018

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.140228  
Iteration 2:   log pseudolikelihood = -29.089651  
Iteration 3:   log pseudolikelihood = -29.089615  
Iteration 4:   log pseudolikelihood = -29.089615  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =       8.93
                                                Prob > chi2       =     0.2574
Log pseudolikelihood = -29.089615               Pseudo R2         =     0.1317

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |    .406435   .4111016     0.99   0.323    -.3993093    1.212179
        game_lead_facil |   -.729121   .5163421    -1.41   0.158    -1.741133    .2828909
game_count_intervention |   .0102123   .0141232     0.72   0.470    -.0174687    .0378933
   game_optimal_inv_r10 |   -.293263   .4390177    -0.67   0.504    -1.153722    .5671959
    communication_rules |   -.037369   .0248719    -1.50   0.133    -.0861171    .0113791
   game_come_back_dummy |  -.1682268   .5729247    -0.29   0.769    -1.291139    .9546849
        game_discussion |  -.2737645   .2862337    -0.96   0.339    -.8347723    .2872434
                  _cons |   2.015012   .8504926     2.37   0.018     .3480772    3.681947
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_2017_FS]game_lead_facil = 0
 ( 2)  [survey_maint_2017_FS]game_count_intervention = 0
 ( 3)  [survey_maint_2017_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_2017_FS]communication_rules = 0
 ( 5)  [survey_maint_2017_FS]game_come_back_dummy = 0
 ( 6)  [survey_maint_2017_FS]game_discussion = 0

           chi2(  6) =    8.40
         Prob > chi2 =    0.2101

. local r2_p= e(r2_p)

. eststo maint3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1189038   .1176685     1.01   0.312    -.1117222    .3495298
        game_lead_facil |  -.2133066   .1435948    -1.49   0.137    -.4947472     .068134
game_count_intervention |   .0029877   .0040724     0.73   0.463    -.0049941    .0109694
   game_optimal_inv_r10 |   -.085795   .1265455    -0.68   0.498    -.3338195    .1622295
    communication_rules |  -.0109324   .0070782    -1.54   0.122    -.0248054    .0029405
   game_come_back_dummy |  -.0492153    .167436    -0.29   0.769    -.3773839    .2789533
        game_discussion |  -.0800906   .0830288    -0.96   0.335    -.2428241    .0826428
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .13173355

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.9572 >= 0.2000  removing game_share_illit_vill
p = 0.9042 >= 0.2000  removing leader2_2_BS
p = 0.8667 >= 0.2000  removing No_HH
p = 0.4545 >= 0.2000  removing communication_rules
p = 0.4931 >= 0.2000  removing leader2_3_BS
p = 0.3827 >= 0.2000  removing game_discussion
p = 0.4592 >= 0.2000  removing FES_site
p = 0.3992 >= 0.2000  removing game_count_intervention
p = 0.4637 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.3191 >= 0.2000  removing game_come_back_dummy
p = 0.2438 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =      13.24
                                                Prob > chi2       =     0.0394
Log pseudolikelihood = -26.656052               Pseudo R2         =     0.2044

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .7910392    .448133     1.77   0.078    -.0872854    1.669364
     game_optimal_inv_r10 |  -.7007702   .5246864    -1.34   0.182    -1.729137    .3275962
participants_primary_only |  -.1612019   .0967361    -1.67   0.096    -.3508012    .0283975
                 Shar_Lit |   .0507741   .0254417     2.00   0.046     .0009092     .100639
 share_female_percent3_BS |   .2492234   .1419223     1.76   0.079    -.0289393     .527386
          game_lead_facil |  -1.065689   .5160362    -2.07   0.039    -2.077101   -.0542763
                    _cons |  -.8827891   1.749464    -0.50   0.614    -4.311675    2.546097
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo maint4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_optimal_inv_r10 participants_primary_only Shar_Lit share_female_percent3_BS game_lead_facil

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2101338   .1120167     1.88   0.061    -.0094148    .4296825
     game_optimal_inv_r10 |  -.1861545   .1330349    -1.40   0.162    -.4468982    .0745892
participants_primary_only |  -.0428221   .0245603    -1.74   0.081    -.0909594    .0053152
                 Shar_Lit |   .0134878   .0065507     2.06   0.039     .0006486     .026327
 share_female_percent3_BS |   .0662044   .0367445     1.80   0.072    -.0058135    .1382223
          game_lead_facil |  -.2830925   .1257737    -2.25   0.024    -.5296044   -.0365806
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .20437051

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *export regression outputs
. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "
> {break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.001")
>  replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width
> }"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *export regression outputs
. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width
> }"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf)

. 
end of do-file

. help probit

. help test

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. test $village

 ( 1)  [survey_maint_2017_FS]No_HH = 0
 ( 2)  [survey_maint_2017_FS]FES_site = 0
 ( 3)  [survey_maint_2017_FS]Shar_Lit = 0
 ( 4)  [survey_maint_2017_FS]Shar_SCST = 0
 ( 5)  [survey_maint_2017_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.49
         Prob > chi2 =    0.4817

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo maint1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_2017_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_2017_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_2017_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_2017_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_2017_FS]participants_primary_only = 0

           chi2(  5) =    5.21
         Prob > chi2 =    0.3908

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo maint2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .1631732   .1189851     1.37   0.170    -.0700333    .3963796
 share_female_percent3_BS |   .0784279   .0378423     2.07   0.038     .0042583    .1525975
             leader2_2_BS |   -.004692   .1445483    -0.03   0.974    -.2880014    .2786173
             leader2_3_BS |  -.1457784   .1534255    -0.95   0.342    -.4464869    .1549301
    game_share_illit_vill |  -.0217381   .1047091    -0.21   0.836    -.2269643    .1834881
participants_primary_only |  -.0326774   .0273486    -1.19   0.232    -.0862798     .020925
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .07367018

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.140228  
Iteration 2:   log pseudolikelihood = -29.089651  
Iteration 3:   log pseudolikelihood = -29.089615  
Iteration 4:   log pseudolikelihood = -29.089615  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =       8.93
                                                Prob > chi2       =     0.2574
Log pseudolikelihood = -29.089615               Pseudo R2         =     0.1317

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |    .406435   .4111016     0.99   0.323    -.3993093    1.212179
        game_lead_facil |   -.729121   .5163421    -1.41   0.158    -1.741133    .2828909
game_count_intervention |   .0102123   .0141232     0.72   0.470    -.0174687    .0378933
   game_optimal_inv_r10 |   -.293263   .4390177    -0.67   0.504    -1.153722    .5671959
    communication_rules |   -.037369   .0248719    -1.50   0.133    -.0861171    .0113791
   game_come_back_dummy |  -.1682268   .5729247    -0.29   0.769    -1.291139    .9546849
        game_discussion |  -.2737645   .2862337    -0.96   0.339    -.8347723    .2872434
                  _cons |   2.015012   .8504926     2.37   0.018     .3480772    3.681947
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_2017_FS]game_lead_facil = 0
 ( 2)  [survey_maint_2017_FS]game_count_intervention = 0
 ( 3)  [survey_maint_2017_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_2017_FS]communication_rules = 0
 ( 5)  [survey_maint_2017_FS]game_come_back_dummy = 0
 ( 6)  [survey_maint_2017_FS]game_discussion = 0

           chi2(  6) =    8.40
         Prob > chi2 =    0.2101

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo maint3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1189038   .1176685     1.01   0.312    -.1117222    .3495298
        game_lead_facil |  -.2133066   .1435948    -1.49   0.137    -.4947472     .068134
game_count_intervention |   .0029877   .0040724     0.73   0.463    -.0049941    .0109694
   game_optimal_inv_r10 |   -.085795   .1265455    -0.68   0.498    -.3338195    .1622295
    communication_rules |  -.0109324   .0070782    -1.54   0.122    -.0248054    .0029405
   game_come_back_dummy |  -.0492153    .167436    -0.29   0.769    -.3773839    .2789533
        game_discussion |  -.0800906   .0830288    -0.96   0.335    -.2428241    .0826428
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .13173355

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.9572 >= 0.2000  removing game_share_illit_vill
p = 0.9042 >= 0.2000  removing leader2_2_BS
p = 0.8667 >= 0.2000  removing No_HH
p = 0.4545 >= 0.2000  removing communication_rules
p = 0.4931 >= 0.2000  removing leader2_3_BS
p = 0.3827 >= 0.2000  removing game_discussion
p = 0.4592 >= 0.2000  removing FES_site
p = 0.3992 >= 0.2000  removing game_count_intervention
p = 0.4637 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.3191 >= 0.2000  removing game_come_back_dummy
p = 0.2438 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =      13.24
                                                Prob > chi2       =     0.0394
Log pseudolikelihood = -26.656052               Pseudo R2         =     0.2044

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .7910392    .448133     1.77   0.078    -.0872854    1.669364
     game_optimal_inv_r10 |  -.7007702   .5246864    -1.34   0.182    -1.729137    .3275962
participants_primary_only |  -.1612019   .0967361    -1.67   0.096    -.3508012    .0283975
                 Shar_Lit |   .0507741   .0254417     2.00   0.046     .0009092     .100639
 share_female_percent3_BS |   .2492234   .1419223     1.76   0.079    -.0289393     .527386
          game_lead_facil |  -1.065689   .5160362    -2.07   0.039    -2.077101   -.0542763
                    _cons |  -.8827891   1.749464    -0.50   0.614    -4.311675    2.546097
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo maint4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_optimal_inv_r10 participants_primary_only Shar_Lit share_female_percent3_BS game_lead_facil

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2101338   .1120167     1.88   0.061    -.0094148    .4296825
     game_optimal_inv_r10 |  -.1861545   .1330349    -1.40   0.162    -.4468982    .0745892
participants_primary_only |  -.0428221   .0245603    -1.74   0.081    -.0909594    .0053152
                 Shar_Lit |   .0134878   .0065507     2.06   0.039     .0006486     .026327
 share_female_percent3_BS |   .0662044   .0367445     1.80   0.072    -.0058135    .1382223
          game_lead_facil |  -.2830925   .1257737    -2.25   0.024    -.5296044   -.0365806
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .20437051

. 
. *export regression outputs
. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "" "") b(%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(
> weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01,
>  *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. test $village

 ( 1)  [survey_maint_2017_FS]No_HH = 0
 ( 2)  [survey_maint_2017_FS]FES_site = 0
 ( 3)  [survey_maint_2017_FS]Shar_Lit = 0
 ( 4)  [survey_maint_2017_FS]Shar_SCST = 0
 ( 5)  [survey_maint_2017_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.49
         Prob > chi2 =    0.4817

. local F= r(p)  

. eststo maint1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. estadd scalar F= `F'

added scalar:
                  e(F) =  .48165483

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_2017_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_2017_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_2017_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_2017_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_2017_FS]participants_primary_only = 0

           chi2(  5) =    5.21
         Prob > chi2 =    0.3908

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo maint2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .1631732   .1189851     1.37   0.170    -.0700333    .3963796
 share_female_percent3_BS |   .0784279   .0378423     2.07   0.038     .0042583    .1525975
             leader2_2_BS |   -.004692   .1445483    -0.03   0.974    -.2880014    .2786173
             leader2_3_BS |  -.1457784   .1534255    -0.95   0.342    -.4464869    .1549301
    game_share_illit_vill |  -.0217381   .1047091    -0.21   0.836    -.2269643    .1834881
participants_primary_only |  -.0326774   .0273486    -1.19   0.232    -.0862798     .020925
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .07367018

. estadd scalar F= `F'

added scalar:
                  e(F) =  .39077934

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.140228  
Iteration 2:   log pseudolikelihood = -29.089651  
Iteration 3:   log pseudolikelihood = -29.089615  
Iteration 4:   log pseudolikelihood = -29.089615  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =       8.93
                                                Prob > chi2       =     0.2574
Log pseudolikelihood = -29.089615               Pseudo R2         =     0.1317

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |    .406435   .4111016     0.99   0.323    -.3993093    1.212179
        game_lead_facil |   -.729121   .5163421    -1.41   0.158    -1.741133    .2828909
game_count_intervention |   .0102123   .0141232     0.72   0.470    -.0174687    .0378933
   game_optimal_inv_r10 |   -.293263   .4390177    -0.67   0.504    -1.153722    .5671959
    communication_rules |   -.037369   .0248719    -1.50   0.133    -.0861171    .0113791
   game_come_back_dummy |  -.1682268   .5729247    -0.29   0.769    -1.291139    .9546849
        game_discussion |  -.2737645   .2862337    -0.96   0.339    -.8347723    .2872434
                  _cons |   2.015012   .8504926     2.37   0.018     .3480772    3.681947
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_2017_FS]game_lead_facil = 0
 ( 2)  [survey_maint_2017_FS]game_count_intervention = 0
 ( 3)  [survey_maint_2017_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_2017_FS]communication_rules = 0
 ( 5)  [survey_maint_2017_FS]game_come_back_dummy = 0
 ( 6)  [survey_maint_2017_FS]game_discussion = 0

           chi2(  6) =    8.40
         Prob > chi2 =    0.2101

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo maint3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1189038   .1176685     1.01   0.312    -.1117222    .3495298
        game_lead_facil |  -.2133066   .1435948    -1.49   0.137    -.4947472     .068134
game_count_intervention |   .0029877   .0040724     0.73   0.463    -.0049941    .0109694
   game_optimal_inv_r10 |   -.085795   .1265455    -0.68   0.498    -.3338195    .1622295
    communication_rules |  -.0109324   .0070782    -1.54   0.122    -.0248054    .0029405
   game_come_back_dummy |  -.0492153    .167436    -0.29   0.769    -.3773839    .2789533
        game_discussion |  -.0800906   .0830288    -0.96   0.335    -.2428241    .0826428
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .13173355

. estadd scalar F= `F'

added scalar:
                  e(F) =  .21008736

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $village $participants $game, robust
                      begin with full model
p = 0.9572 >= 0.2000  removing game_share_illit_vill
p = 0.9042 >= 0.2000  removing leader2_2_BS
p = 0.8667 >= 0.2000  removing No_HH
p = 0.4545 >= 0.2000  removing communication_rules
p = 0.4931 >= 0.2000  removing leader2_3_BS
p = 0.3827 >= 0.2000  removing game_discussion
p = 0.4592 >= 0.2000  removing FES_site
p = 0.3992 >= 0.2000  removing game_count_intervention
p = 0.4637 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.3191 >= 0.2000  removing game_come_back_dummy
p = 0.2438 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =      13.24
                                                Prob > chi2       =     0.0394
Log pseudolikelihood = -26.656052               Pseudo R2         =     0.2044

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .7910392    .448133     1.77   0.078    -.0872854    1.669364
     game_optimal_inv_r10 |  -.7007702   .5246864    -1.34   0.182    -1.729137    .3275962
participants_primary_only |  -.1612019   .0967361    -1.67   0.096    -.3508012    .0283975
                 Shar_Lit |   .0507741   .0254417     2.00   0.046     .0009092     .100639
 share_female_percent3_BS |   .2492234   .1419223     1.76   0.079    -.0289393     .527386
          game_lead_facil |  -1.065689   .5160362    -2.07   0.039    -2.077101   -.0542763
                    _cons |  -.8827891   1.749464    -0.50   0.614    -4.311675    2.546097
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo maint4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_optimal_inv_r10 participants_primary_only Shar_Lit share_female_percent3_BS game_lead_facil

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2101338   .1120167     1.88   0.061    -.0094148    .4296825
     game_optimal_inv_r10 |  -.1861545   .1330349    -1.40   0.162    -.4468982    .0745892
participants_primary_only |  -.0428221   .0245603    -1.74   0.081    -.0909594    .0053152
                 Shar_Lit |   .0134878   .0065507     2.06   0.039     .0006486     .026327
 share_female_percent3_BS |   .0662044   .0367445     1.80   0.072    -.0058135    .1382223
          game_lead_facil |  -.2830925   .1257737    -2.25   0.024    -.5296044   -.0365806
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .20437051

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "" "") b(%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(
> weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01,
>  *** p<0.001") replace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *export regression outputs
. esttab maint1 maint2 maint3 maint4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "
> " "" "") b(%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(
> weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01,
>  *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf)

. 
end of do-file

. tab game_total_fem

Total no of |
     female |
 players in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        5.36        5.36
          1 |          8       14.29       19.64
          2 |          7       12.50       32.14
          3 |         10       17.86       50.00
          4 |          5        8.93       58.93
          5 |         12       21.43       80.36
          6 |          5        8.93       89.29
          7 |          2        3.57       92.86
          8 |          2        3.57       96.43
          9 |          1        1.79       98.21
         14 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_share_fem_vill

     Female |
 present in |
          % |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        5.36        5.36
   .0714286 |          8       14.29       19.64
   .1428571 |          7       12.50       32.14
   .2142857 |         10       17.86       50.00
   .2857143 |          5        8.93       58.93
   .3571429 |         12       21.43       80.36
   .4285714 |          5        8.93       89.29
         .5 |          2        3.57       92.86
   .5714286 |          2        3.57       96.43
   .6428571 |          1        1.79       98.21
          1 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. global village                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *rules
. probit survey_maint_rule_FS survey_maint_rule_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -32.231667  
Iteration 2:   log pseudolikelihood = -32.215512  
Iteration 3:   log pseudolikelihood = -32.215508  
Iteration 4:   log pseudolikelihood = -32.215508  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.42
                                                Prob > chi2       =     0.6201
Log pseudolikelihood = -32.215508               Pseudo R2         =     0.0839

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
        survey_maint_rule_BS |   .2179315   .4946255     0.44   0.660    -.7515166     1.18738
                       No_HH |   -.001151   .0025687    -0.45   0.654    -.0061855    .0038834
                    FES_site |   .5272578   .3795943     1.39   0.165    -.2167333    1.271249
                    Shar_Lit |  -.0080071   .0239183    -0.33   0.738    -.0548862    .0388719
                   Shar_SCST |  -.0036524   .0118569    -0.31   0.758    -.0268915    .0195867
survey_dam_for_irrigation_FS |  -.5875984   .4019583    -1.46   0.144    -1.375422    .2002254
                       _cons |   .2348381   1.738522     0.14   0.893    -3.172603    3.642279
----------------------------------------------------------------------------------------------

. test $village

 ( 1)  [survey_maint_rule_FS]No_HH = 0
 ( 2)  [survey_maint_rule_FS]FES_site = 0
 ( 3)  [survey_maint_rule_FS]Shar_Lit = 0
 ( 4)  [survey_maint_rule_FS]Shar_SCST = 0
 ( 5)  [survey_maint_rule_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.41
         Prob > chi2 =    0.4916

. local r2_p= e(r2_p)

. eststo rule1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
        survey_maint_rule_BS |   .0717359   .1614684     0.44   0.657    -.2447364    .3882081
                       No_HH |  -.0003789   .0008304    -0.46   0.648    -.0020065    .0012487
                    FES_site |   .1735559   .1190297     1.46   0.145     -.059738    .4068498
                    Shar_Lit |  -.0026357    .007865    -0.34   0.738    -.0180508    .0127794
                   Shar_SCST |  -.0012022   .0038801    -0.31   0.757     -.008807    .0064025
survey_dam_for_irrigation_FS |   -.193418   .1231882    -1.57   0.116    -.4348625    .0480265
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .08386871

. 
. probit survey_maint_rule_FS survey_maint_rule_BS $participants, robust

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -31.283395  
Iteration 2:   log pseudolikelihood = -31.264102  
Iteration 3:   log pseudolikelihood =   -31.2641  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       7.17
                                                Prob > chi2       =     0.3053
Log pseudolikelihood =   -31.2641               Pseudo R2         =     0.1109

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
     survey_maint_rule_BS |   .1670499   .5155658     0.32   0.746    -.8434405     1.17754
 share_female_percent3_BS |   .2861214   .1195396     2.39   0.017     .0518282    .5204146
             leader2_2_BS |   .4092135   .4447719     0.92   0.358    -.4625235     1.28095
             leader2_3_BS |  -.1836015   .5051401    -0.36   0.716    -1.173658    .8064548
    game_share_illit_vill |  -.0226472   .2866116    -0.08   0.937    -.5843957    .5391013
participants_primary_only |   .0907869   .0838324     1.08   0.279    -.0735215    .2550954
                    _cons |  -2.071896   .9038788    -2.29   0.022    -3.843466   -.3003266
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_rule_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_rule_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_rule_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_rule_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_rule_FS]participants_primary_only = 0

           chi2(  5) =    7.07
         Prob > chi2 =    0.2153

. local r2_p= e(r2_p)

. eststo rule2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
     survey_maint_rule_BS |   .0528007   .1628847     0.32   0.746    -.2664475     .372049
 share_female_percent3_BS |   .0904366   .0319888     2.83   0.005     .0277397    .1531335
             leader2_2_BS |   .1293433   .1372728     0.94   0.346    -.1397065     .398393
             leader2_3_BS |  -.0580324   .1593818    -0.36   0.716    -.3704149    .2543502
    game_share_illit_vill |  -.0071583   .0905146    -0.08   0.937    -.1845636     .170247
participants_primary_only |   .0286957   .0260721     1.10   0.271    -.0224046    .0797961
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11092446

. 
. probit survey_maint_rule_FS survey_maint_rule_BS $game, robust

note: game_come_back_dummy != 1 predicts failure perfectly
      game_come_back_dummy dropped and 7 obs not used

Iteration 0:   log pseudolikelihood =   -32.2189  
Iteration 1:   log pseudolikelihood =  -27.65743  
Iteration 2:   log pseudolikelihood = -27.625839  
Iteration 3:   log pseudolikelihood = -27.625837  

Probit regression                               Number of obs     =         49
                                                Wald chi2(6)      =       9.73
                                                Prob > chi2       =     0.1367
Log pseudolikelihood = -27.625837               Pseudo R2         =     0.1426

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
   survey_maint_rule_BS |   .7134592   .6367128     1.12   0.262     -.534475    1.961393
        game_lead_facil |   .7526747   .6491086     1.16   0.246    -.5195548    2.024904
game_count_intervention |   .0215042   .0152888     1.41   0.160    -.0084613    .0514697
   game_optimal_inv_r10 |  -.6161541   .4367659    -1.41   0.158    -1.472199    .2398913
    communication_rules |  -.0127957   .0296377    -0.43   0.666    -.0708845    .0452931
   game_come_back_dummy |          0  (omitted)
        game_discussion |  -.9008859   .3974493    -2.27   0.023    -1.679872   -.1218995
                  _cons |   .8846813   1.091255     0.81   0.418    -1.254138    3.023501
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_rule_FS]game_lead_facil = 0
 ( 2)  [survey_maint_rule_FS]game_count_intervention = 0
 ( 3)  [survey_maint_rule_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_rule_FS]communication_rules = 0
 ( 5)  [survey_maint_rule_FS]o.game_come_back_dummy = 0
 ( 6)  [survey_maint_rule_FS]game_discussion = 0
       Constraint 5 dropped

           chi2(  5) =    8.49
         Prob > chi2 =    0.1314

. local r2_p= e(r2_p)

. eststo rule3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         49
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
   survey_maint_rule_BS |     .22825   .2001978     1.14   0.254    -.1641304    .6206304
        game_lead_facil |   .2407958   .1999883     1.20   0.229    -.1511741    .6327658
game_count_intervention |   .0068796   .0047096     1.46   0.144     -.002351    .0161103
   game_optimal_inv_r10 |  -.1971201   .1317591    -1.50   0.135    -.4553633     .061123
    communication_rules |  -.0040936   .0094739    -0.43   0.666    -.0226621    .0144749
   game_come_back_dummy |          0  (omitted)
        game_discussion |  -.2882116   .1082794    -2.66   0.008    -.5004352   -.0759879
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14255802

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_maint_rule_FS survey_maint_rule_BS $village $participants $game, robust
note: game_come_back_dummy dropped because of estimability
note: 7 obs. dropped because of estimability
                      begin with full model
p = 0.8724 >= 0.2000  removing participants_primary_only
p = 0.8577 >= 0.2000  removing survey_maint_rule_BS
p = 0.6394 >= 0.2000  removing leader2_3_BS
p = 0.5435 >= 0.2000  removing No_HH
p = 0.4320 >= 0.2000  removing game_count_intervention
p = 0.2940 >= 0.2000  removing game_share_illit_vill
p = 0.3623 >= 0.2000  removing communication_rules
p = 0.3730 >= 0.2000  removing leader2_2_BS
p = 0.2540 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         49
                                                Wald chi2(7)      =      19.71
                                                Prob > chi2       =     0.0062
Log pseudolikelihood = -22.586613               Pseudo R2         =     0.2990

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             game_discussion |  -1.360093   .4449402    -3.06   0.002     -2.23216   -.4880261
             game_lead_facil |   1.205611   .6939312     1.74   0.082    -.1544695    2.565691
                    FES_site |   1.228648   .4687334     2.62   0.009     .3099471    2.147348
                    Shar_Lit |  -.0377218   .0270481    -1.39   0.163    -.0907351    .0152915
        game_optimal_inv_r10 |  -.7556739   .4481738    -1.69   0.092    -1.634078    .1227306
survey_dam_for_irrigation_FS |  -.6762513   .4542219    -1.49   0.137     -1.56651    .2140072
    share_female_percent3_BS |    .285307   .1146765     2.49   0.013     .0605452    .5100688
                       _cons |   2.325527   1.588062     1.46   0.143    -.7870178    5.438073
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo rule4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         49
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : game_discussion game_lead_facil FES_site Shar_Lit game_optimal_inv_r10 survey_dam_for_irrigation_FS share_female_percent3_BS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             game_discussion |  -.3469572   .0875065    -3.96   0.000    -.5184668   -.1754477
             game_lead_facil |   .3075491   .1697169     1.81   0.070    -.0250898     .640188
                    FES_site |   .3134258   .1040304     3.01   0.003     .1095299    .5173217
                    Shar_Lit |  -.0096228   .0067296    -1.43   0.153    -.0228126    .0035671
        game_optimal_inv_r10 |   -.192771   .1108092    -1.74   0.082    -.4099531     .024411
survey_dam_for_irrigation_FS |  -.1725105   .1105205    -1.56   0.119    -.3891267    .0441057
    share_female_percent3_BS |   .0727813   .0254695     2.86   0.004      .022862    .1227006
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .29896385

. 
. *export regression outputs
. esttab rule1 rule2 rule3 rule4 using "$working_ANALYSIS\results\Tables\dam_maintenance.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "" ""
>  "") b(%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weig
> ht:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, ***
>  p<0.001") replace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_maintenance.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *export regression outputs
. esttab rule1 rule2 rule3 rule4 using "$working_ANALYSIS\results\Tables\dam_rules.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "" "" "") b
> (%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.0
> 01") replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_rules.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_rules.rtf)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *rules
. probit survey_maint_rule_FS survey_maint_rule_BS $village if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -32.231667  
Iteration 2:   log pseudolikelihood = -32.215512  
Iteration 3:   log pseudolikelihood = -32.215508  
Iteration 4:   log pseudolikelihood = -32.215508  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.42
                                                Prob > chi2       =     0.6201
Log pseudolikelihood = -32.215508               Pseudo R2         =     0.0839

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
        survey_maint_rule_BS |   .2179315   .4946255     0.44   0.660    -.7515166     1.18738
                       No_HH |   -.001151   .0025687    -0.45   0.654    -.0061855    .0038834
                    FES_site |   .5272578   .3795943     1.39   0.165    -.2167333    1.271249
                    Shar_Lit |  -.0080071   .0239183    -0.33   0.738    -.0548862    .0388719
                   Shar_SCST |  -.0036524   .0118569    -0.31   0.758    -.0268915    .0195867
survey_dam_for_irrigation_FS |  -.5875984   .4019583    -1.46   0.144    -1.375422    .2002254
                       _cons |   .2348381   1.738522     0.14   0.893    -3.172603    3.642279
----------------------------------------------------------------------------------------------

. test $village

 ( 1)  [survey_maint_rule_FS]No_HH = 0
 ( 2)  [survey_maint_rule_FS]FES_site = 0
 ( 3)  [survey_maint_rule_FS]Shar_Lit = 0
 ( 4)  [survey_maint_rule_FS]Shar_SCST = 0
 ( 5)  [survey_maint_rule_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    4.41
         Prob > chi2 =    0.4916

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo rule1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
        survey_maint_rule_BS |   .0717359   .1614684     0.44   0.657    -.2447364    .3882081
                       No_HH |  -.0003789   .0008304    -0.46   0.648    -.0020065    .0012487
                    FES_site |   .1735559   .1190297     1.46   0.145     -.059738    .4068498
                    Shar_Lit |  -.0026357    .007865    -0.34   0.738    -.0180508    .0127794
                   Shar_SCST |  -.0012022   .0038801    -0.31   0.757     -.008807    .0064025
survey_dam_for_irrigation_FS |   -.193418   .1231882    -1.57   0.116    -.4348625    .0480265
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .08386871

. estadd scalar F= `F'

added scalar:
                  e(F) =  .49158158

. 
. probit survey_maint_rule_FS survey_maint_rule_BS $participants, robust

Iteration 0:   log pseudolikelihood = -35.164729  
Iteration 1:   log pseudolikelihood = -31.283395  
Iteration 2:   log pseudolikelihood = -31.264102  
Iteration 3:   log pseudolikelihood =   -31.2641  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       7.17
                                                Prob > chi2       =     0.3053
Log pseudolikelihood =   -31.2641               Pseudo R2         =     0.1109

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
     survey_maint_rule_BS |   .1670499   .5155658     0.32   0.746    -.8434405     1.17754
 share_female_percent3_BS |   .2861214   .1195396     2.39   0.017     .0518282    .5204146
             leader2_2_BS |   .4092135   .4447719     0.92   0.358    -.4625235     1.28095
             leader2_3_BS |  -.1836015   .5051401    -0.36   0.716    -1.173658    .8064548
    game_share_illit_vill |  -.0226472   .2866116    -0.08   0.937    -.5843957    .5391013
participants_primary_only |   .0907869   .0838324     1.08   0.279    -.0735215    .2550954
                    _cons |  -2.071896   .9038788    -2.29   0.022    -3.843466   -.3003266
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_maint_rule_FS]share_female_percent3_BS = 0
 ( 2)  [survey_maint_rule_FS]leader2_2_BS = 0
 ( 3)  [survey_maint_rule_FS]leader2_3_BS = 0
 ( 4)  [survey_maint_rule_FS]game_share_illit_vill = 0
 ( 5)  [survey_maint_rule_FS]participants_primary_only = 0

           chi2(  5) =    7.07
         Prob > chi2 =    0.2153

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo rule2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
     survey_maint_rule_BS |   .0528007   .1628847     0.32   0.746    -.2664475     .372049
 share_female_percent3_BS |   .0904366   .0319888     2.83   0.005     .0277397    .1531335
             leader2_2_BS |   .1293433   .1372728     0.94   0.346    -.1397065     .398393
             leader2_3_BS |  -.0580324   .1593818    -0.36   0.716    -.3704149    .2543502
    game_share_illit_vill |  -.0071583   .0905146    -0.08   0.937    -.1845636     .170247
participants_primary_only |   .0286957   .0260721     1.10   0.271    -.0224046    .0797961
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11092446

. estadd scalar F= `F'

added scalar:
                  e(F) =  .21532245

. 
. probit survey_maint_rule_FS survey_maint_rule_BS $game, robust

note: game_come_back_dummy != 1 predicts failure perfectly
      game_come_back_dummy dropped and 7 obs not used

Iteration 0:   log pseudolikelihood =   -32.2189  
Iteration 1:   log pseudolikelihood =  -27.65743  
Iteration 2:   log pseudolikelihood = -27.625839  
Iteration 3:   log pseudolikelihood = -27.625837  

Probit regression                               Number of obs     =         49
                                                Wald chi2(6)      =       9.73
                                                Prob > chi2       =     0.1367
Log pseudolikelihood = -27.625837               Pseudo R2         =     0.1426

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
   survey_maint_rule_BS |   .7134592   .6367128     1.12   0.262     -.534475    1.961393
        game_lead_facil |   .7526747   .6491086     1.16   0.246    -.5195548    2.024904
game_count_intervention |   .0215042   .0152888     1.41   0.160    -.0084613    .0514697
   game_optimal_inv_r10 |  -.6161541   .4367659    -1.41   0.158    -1.472199    .2398913
    communication_rules |  -.0127957   .0296377    -0.43   0.666    -.0708845    .0452931
   game_come_back_dummy |          0  (omitted)
        game_discussion |  -.9008859   .3974493    -2.27   0.023    -1.679872   -.1218995
                  _cons |   .8846813   1.091255     0.81   0.418    -1.254138    3.023501
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_maint_rule_FS]game_lead_facil = 0
 ( 2)  [survey_maint_rule_FS]game_count_intervention = 0
 ( 3)  [survey_maint_rule_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_maint_rule_FS]communication_rules = 0
 ( 5)  [survey_maint_rule_FS]o.game_come_back_dummy = 0
 ( 6)  [survey_maint_rule_FS]game_discussion = 0
       Constraint 5 dropped

           chi2(  5) =    8.49
         Prob > chi2 =    0.1314

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo rule3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         49
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : survey_maint_rule_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
   survey_maint_rule_BS |     .22825   .2001978     1.14   0.254    -.1641304    .6206304
        game_lead_facil |   .2407958   .1999883     1.20   0.229    -.1511741    .6327658
game_count_intervention |   .0068796   .0047096     1.46   0.144     -.002351    .0161103
   game_optimal_inv_r10 |  -.1971201   .1317591    -1.50   0.135    -.4553633     .061123
    communication_rules |  -.0040936   .0094739    -0.43   0.666    -.0226621    .0144749
   game_come_back_dummy |          0  (omitted)
        game_discussion |  -.2882116   .1082794    -2.66   0.008    -.5004352   -.0759879
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14255802

. estadd scalar F= `F'

added scalar:
                  e(F) =  .13137658

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_maint_rule_FS survey_maint_rule_BS $village $participants $game, robust
note: game_come_back_dummy dropped because of estimability
note: 7 obs. dropped because of estimability
                      begin with full model
p = 0.8724 >= 0.2000  removing participants_primary_only
p = 0.8577 >= 0.2000  removing survey_maint_rule_BS
p = 0.6394 >= 0.2000  removing leader2_3_BS
p = 0.5435 >= 0.2000  removing No_HH
p = 0.4320 >= 0.2000  removing game_count_intervention
p = 0.2940 >= 0.2000  removing game_share_illit_vill
p = 0.3623 >= 0.2000  removing communication_rules
p = 0.3730 >= 0.2000  removing leader2_2_BS
p = 0.2540 >= 0.2000  removing Shar_SCST

Probit regression                               Number of obs     =         49
                                                Wald chi2(7)      =      19.71
                                                Prob > chi2       =     0.0062
Log pseudolikelihood = -22.586613               Pseudo R2         =     0.2990

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             game_discussion |  -1.360093   .4449402    -3.06   0.002     -2.23216   -.4880261
             game_lead_facil |   1.205611   .6939312     1.74   0.082    -.1544695    2.565691
                    FES_site |   1.228648   .4687334     2.62   0.009     .3099471    2.147348
                    Shar_Lit |  -.0377218   .0270481    -1.39   0.163    -.0907351    .0152915
        game_optimal_inv_r10 |  -.7556739   .4481738    -1.69   0.092    -1.634078    .1227306
survey_dam_for_irrigation_FS |  -.6762513   .4542219    -1.49   0.137     -1.56651    .2140072
    share_female_percent3_BS |    .285307   .1146765     2.49   0.013     .0605452    .5100688
                       _cons |   2.325527   1.588062     1.46   0.143    -.7870178    5.438073
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo rule4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         49
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : game_discussion game_lead_facil FES_site Shar_Lit game_optimal_inv_r10 survey_dam_for_irrigation_FS share_female_percent3_BS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             game_discussion |  -.3469572   .0875065    -3.96   0.000    -.5184668   -.1754477
             game_lead_facil |   .3075491   .1697169     1.81   0.070    -.0250898     .640188
                    FES_site |   .3134258   .1040304     3.01   0.003     .1095299    .5173217
                    Shar_Lit |  -.0096228   .0067296    -1.43   0.153    -.0228126    .0035671
        game_optimal_inv_r10 |   -.192771   .1108092    -1.74   0.082    -.4099531     .024411
survey_dam_for_irrigation_FS |  -.1725105   .1105205    -1.56   0.119    -.3891267    .0441057
    share_female_percent3_BS |   .0727813   .0254695     2.86   0.004      .022862    .1227006
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .29896385

. estadd scalar F= `F'

added scalar:
                  e(F) =  .

. 
. *export regression outputs
. esttab rule1 rule2 rule3 rule4 using "$working_ANALYSIS\results\Tables\dam_rules.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "" "" "") b
> (%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.0
> 01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_rules.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. *conflict
. probit survey_conflicts_any_FS survey_conflicts_any_BS $village if treatment == 1, vce(robust)

note: survey_conflicts_any_BS != 0 predicts failure perfectly
      survey_conflicts_any_BS dropped and 2 obs not used

Iteration 0:   log pseudolikelihood = -24.563524  
Iteration 1:   log pseudolikelihood = -21.733302  
Iteration 2:   log pseudolikelihood =  -21.66688  
Iteration 3:   log pseudolikelihood = -21.666696  
Iteration 4:   log pseudolikelihood = -21.666696  

Probit regression                               Number of obs     =         48
                                                Wald chi2(5)      =       7.50
                                                Prob > chi2       =     0.1860
Log pseudolikelihood = -21.666696               Pseudo R2         =     0.1179

----------------------------------------------------------------------------------------------
                             |               Robust
     survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
     survey_conflicts_any_BS |          0  (omitted)
                       No_HH |   .0036078   .0025278     1.43   0.153    -.0013465    .0085621
                    FES_site |   .8462745   .5146615     1.64   0.100    -.1624435    1.854992
                    Shar_Lit |  -.0106172   .0251964    -0.42   0.673    -.0600012    .0387667
                   Shar_SCST |   .0061851   .0131051     0.47   0.637    -.0195005    .0318706
survey_dam_for_irrigation_FS |   .7141847   .4488385     1.59   0.112    -.1655226    1.593892
                       _cons |  -2.358314   1.867882    -1.26   0.207    -6.019295    1.302667
----------------------------------------------------------------------------------------------

. test $village

 ( 1)  [survey_conflicts_any_FS]No_HH = 0
 ( 2)  [survey_conflicts_any_FS]FES_site = 0
 ( 3)  [survey_conflicts_any_FS]Shar_Lit = 0
 ( 4)  [survey_conflicts_any_FS]Shar_SCST = 0
 ( 5)  [survey_conflicts_any_FS]survey_dam_for_irrigation_FS = 0

           chi2(  5) =    7.50
         Prob > chi2 =    0.1860

. local F= r(p)  

. local r2_p= e(r2_p)

. eststo con1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         48
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : survey_conflicts_any_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
     survey_conflicts_any_BS |          0  (omitted)
                       No_HH |   .0009074   .0006238     1.45   0.146    -.0003153      .00213
                    FES_site |     .21284   .1358776     1.57   0.117    -.0534751    .4791552
                    Shar_Lit |  -.0026703   .0063258    -0.42   0.673    -.0150686    .0097281
                   Shar_SCST |   .0015556   .0033002     0.47   0.637    -.0049128    .0080239
survey_dam_for_irrigation_FS |   .1796191   .1052595     1.71   0.088    -.0266856    .3859239
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11793207

. estadd scalar F= `F'

added scalar:
                  e(F) =  .18601934

. 
. probit survey_conflicts_any_FS survey_conflicts_any_BS $participants, robust

note: survey_conflicts_any_BS != 0 predicts failure perfectly
      survey_conflicts_any_BS dropped and 2 obs not used

Iteration 0:   log pseudolikelihood = -24.563524  
Iteration 1:   log pseudolikelihood = -21.006531  
Iteration 2:   log pseudolikelihood = -20.912638  
Iteration 3:   log pseudolikelihood = -20.912364  
Iteration 4:   log pseudolikelihood = -20.912364  

Probit regression                               Number of obs     =         48
                                                Wald chi2(5)      =       8.05
                                                Prob > chi2       =     0.1536
Log pseudolikelihood = -20.912364               Pseudo R2         =     0.1486

-------------------------------------------------------------------------------------------
                          |               Robust
  survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
  survey_conflicts_any_BS |          0  (omitted)
 share_female_percent3_BS |  -.2111046   .1579613    -1.34   0.181    -.5207031    .0984939
             leader2_2_BS |   1.053556   .5020891     2.10   0.036     .0694795    2.037633
             leader2_3_BS |   .7457295   .6268921     1.19   0.234    -.4829565    1.974415
    game_share_illit_vill |   .0826028     .32156     0.26   0.797    -.5476432    .7128489
participants_primary_only |   -.071023   .0907729    -0.78   0.434    -.2489346    .1068886
                    _cons |  -.4436378   .8323953    -0.53   0.594    -2.075103    1.187827
-------------------------------------------------------------------------------------------

. test $participants

 ( 1)  [survey_conflicts_any_FS]share_female_percent3_BS = 0
 ( 2)  [survey_conflicts_any_FS]leader2_2_BS = 0
 ( 3)  [survey_conflicts_any_FS]leader2_3_BS = 0
 ( 4)  [survey_conflicts_any_FS]game_share_illit_vill = 0
 ( 5)  [survey_conflicts_any_FS]participants_primary_only = 0

           chi2(  5) =    8.05
         Prob > chi2 =    0.1536

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo con2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         48
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : survey_conflicts_any_BS share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
  survey_conflicts_any_BS |          0  (omitted)
 share_female_percent3_BS |  -.0511947   .0387627    -1.32   0.187    -.1271683    .0247789
             leader2_2_BS |   .2554964   .1094527     2.33   0.020     .0409732    .4700197
             leader2_3_BS |   .1808458   .1504869     1.20   0.229     -.114103    .4757947
    game_share_illit_vill |   .0200319   .0779568     0.26   0.797    -.1327607    .1728245
participants_primary_only |  -.0172237   .0217455    -0.79   0.428    -.0598442    .0253968
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14864152

. estadd scalar F= `F'

added scalar:
                  e(F) =  .15362627

. 
. probit survey_conflicts_any_FS survey_conflicts_any_BS $game, robust

note: survey_conflicts_any_BS != 0 predicts failure perfectly
      survey_conflicts_any_BS dropped and 2 obs not used

Iteration 0:   log pseudolikelihood = -24.563524  
Iteration 1:   log pseudolikelihood = -23.442509  
Iteration 2:   log pseudolikelihood = -23.433981  
Iteration 3:   log pseudolikelihood = -23.433978  
Iteration 4:   log pseudolikelihood = -23.433978  

Probit regression                               Number of obs     =         48
                                                Wald chi2(6)      =       2.71
                                                Prob > chi2       =     0.8449
Log pseudolikelihood = -23.433978               Pseudo R2         =     0.0460

-----------------------------------------------------------------------------------------
                        |               Robust
survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
survey_conflicts_any_BS |          0  (omitted)
        game_lead_facil |   .2384588   .5733816     0.42   0.677    -.8853485    1.362266
game_count_intervention |   .0147167   .0173899     0.85   0.397     -.019367    .0488003
   game_optimal_inv_r10 |   .3913188     .46646     0.84   0.402    -.5229261    1.305564
    communication_rules |   .0318058   .0250364     1.27   0.204    -.0172647    .0808763
   game_come_back_dummy |   .1407997   .6441247     0.22   0.827    -1.121661    1.403261
        game_discussion |  -.3012454   .3359077    -0.90   0.370    -.9596124    .3571216
                  _cons |  -1.997519   .8928251    -2.24   0.025    -3.747424    -.247614
-----------------------------------------------------------------------------------------

. test $game

 ( 1)  [survey_conflicts_any_FS]game_lead_facil = 0
 ( 2)  [survey_conflicts_any_FS]game_count_intervention = 0
 ( 3)  [survey_conflicts_any_FS]game_optimal_inv_r10 = 0
 ( 4)  [survey_conflicts_any_FS]communication_rules = 0
 ( 5)  [survey_conflicts_any_FS]game_come_back_dummy = 0
 ( 6)  [survey_conflicts_any_FS]game_discussion = 0

           chi2(  6) =    2.71
         Prob > chi2 =    0.8449

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo con3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         48
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : survey_conflicts_any_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
survey_conflicts_any_BS |          0  (omitted)
        game_lead_facil |   .0651043   .1565765     0.42   0.678      -.24178    .3719886
game_count_intervention |    .004018   .0046296     0.87   0.385    -.0050558    .0130918
   game_optimal_inv_r10 |   .1068383   .1237198     0.86   0.388    -.1356479    .3493246
    communication_rules |   .0086837   .0069178     1.26   0.209     -.004875    .0222424
   game_come_back_dummy |   .0384413   .1763863     0.22   0.827    -.3072695    .3841521
        game_discussion |  -.0822464   .0903323    -0.91   0.363    -.2592945    .0948017
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .04598468

. estadd scalar F= `F'

added scalar:
                  e(F) =  .844856

. 
. *stepwise backward selection
. stepwise, pr(.2): probit survey_conflicts_any_FS survey_conflicts_any_BS $village $participants $game, robust
note: survey_conflicts_any_BS dropped because of estimability
note: 2 obs. dropped because of estimability
                      begin with full model
p = 0.9648 >= 0.2000  removing game_share_illit_vill
p = 0.9417 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.7144 >= 0.2000  removing game_optimal_inv_r10
p = 0.4764 >= 0.2000  removing Shar_SCST
p = 0.2201 >= 0.2000  removing game_count_intervention
p = 0.2989 >= 0.2000  removing game_lead_facil
p = 0.4219 >= 0.2000  removing game_discussion
p = 0.2132 >= 0.2000  removing participants_primary_only
p = 0.3309 >= 0.2000  removing game_come_back_dummy
p = 0.3821 >= 0.2000  removing Shar_Lit
p = 0.5113 >= 0.2000  removing communication_rules
p = 0.2460 >= 0.2000  removing leader2_3_BS
p = 0.3640 >= 0.2000  removing share_female_percent3_BS

Probit regression                               Number of obs     =         48
                                                Wald chi2(3)      =       9.07
                                                Prob > chi2       =     0.0283
Log pseudolikelihood =  -20.34809               Pseudo R2         =     0.1716

-----------------------------------------------------------------------------------------
                        |               Robust
survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0056063   .0028401     1.97   0.048     .0000399    .0111727
               FES_site |   1.050192   .5625346     1.87   0.062    -.0523552     2.15274
           leader2_2_BS |   1.085573   .4737736     2.29   0.022     .1569937    2.014152
                  _cons |  -2.992611   .8556192    -3.50   0.000    -4.669594   -1.315629
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo con4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         48
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : No_HH FES_site leader2_2_BS

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |   .0013169   .0006614     1.99   0.046     .0000205    .0026133
    FES_site |    .246693   .1374271     1.80   0.073    -.0226593    .5160452
leader2_2_BS |    .255004   .0980423     2.60   0.009     .0628447    .4471633
------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .17161354

. estadd scalar F= `F'

added scalar:
                  e(F) =  .

. 
. *export regression outputs
. esttab con1 con2 con3 con4 using "$working_ANALYSIS\results\Tables\dam_rules.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "" "" "") b(%4.
> 2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "
> {break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.001")
>  replace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_rules.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. esttab con1 con2 con3 con4 using "$working_ANALYSIS\results\Tables\dam_conflicts.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1)" "" "" "") b
> (%4.2f)label stats(N r2_p F, labels("N" "Pseudo R2" "Joint F-test of significance"  ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors in brackets. * p<0.05, ** p<0.01, *** p<0.0
> 01") replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_conflicts.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\dam_conflicts.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. coefplot (maint4) (rule4) (conflict4), keep(share_female_percent3_BS) title("{bf: B} Determinants (intervention villages)") subtitle(, nobox margin(tiny) justifi
> cation(center)  bmargin(top)) coeflabels(share_female_percent3  = "Share women in session (in 10%)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression est
> imated impact in pp")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pv
> al<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule ex
> ists (=1)" 9 "Conflict over dam (=1)") pos(6) ring(1) rows(2))
estimation result conflict4 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. stepwise, pr(.2): probit survey_conflicts_any_FS survey_conflicts_any_BS $village $participants $game, robust
note: survey_conflicts_any_BS dropped because of estimability
note: 2 obs. dropped because of estimability
                      begin with full model
p = 0.9648 >= 0.2000  removing game_share_illit_vill
p = 0.9417 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.7144 >= 0.2000  removing game_optimal_inv_r10
p = 0.4764 >= 0.2000  removing Shar_SCST
p = 0.2201 >= 0.2000  removing game_count_intervention
p = 0.2989 >= 0.2000  removing game_lead_facil
p = 0.4219 >= 0.2000  removing game_discussion
p = 0.2132 >= 0.2000  removing participants_primary_only
p = 0.3309 >= 0.2000  removing game_come_back_dummy
p = 0.3821 >= 0.2000  removing Shar_Lit
p = 0.5113 >= 0.2000  removing communication_rules
p = 0.2460 >= 0.2000  removing leader2_3_BS
p = 0.3640 >= 0.2000  removing share_female_percent3_BS

Probit regression                               Number of obs     =         48
                                                Wald chi2(3)      =       9.07
                                                Prob > chi2       =     0.0283
Log pseudolikelihood =  -20.34809               Pseudo R2         =     0.1716

-----------------------------------------------------------------------------------------
                        |               Robust
survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  No_HH |   .0056063   .0028401     1.97   0.048     .0000399    .0111727
               FES_site |   1.050192   .5625346     1.87   0.062    -.0523552     2.15274
           leader2_2_BS |   1.085573   .4737736     2.29   0.022     .1569937    2.014152
                  _cons |  -2.992611   .8556192    -3.50   0.000    -4.669594   -1.315629
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. local F= r(p)  

. eststo con4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         48
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : No_HH FES_site leader2_2_BS

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |   .0013169   .0006614     1.99   0.046     .0000205    .0026133
    FES_site |    .246693   .1374271     1.80   0.073    -.0226593    .5160452
leader2_2_BS |    .255004   .0980423     2.60   0.009     .0628447    .4471633
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD71b0_000000.tmp"

. coefplot (maint4) (rule4) (con4), keep(share_female_percent3_BS) title("{bf: B} Determinants (intervention villages)") subtitle(, nobox margin(tiny) justificatio
> n(center)  bmargin(top)) coeflabels(share_female_percent3  = "Share women in session (in 10%)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimate
> d impact in pp")   msymbol(d) msize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.0
> 1, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule exists 
> (=1)" 9 "Conflict over dam (=1)") pos(6) ring(1) rows(2))
(con4: no coefficients found, all dropped, or none kept)
(note:  named style medthin not found in class linestyle, default attributes used)

. 
end of do-file

. exit, clear
