-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2023.03.21-09.19.07.log.txt
  log type:  text
 opened on:  21 Mar 2023, 09:19:07

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 21 Mar 2023 09:19:07

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
. 
end of do-file

. tab leader_2_2_BS
no variables defined
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion_)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. 
. * Setting globals
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants     share_female_percent3_BS leader2_2_BS leader2_3_BS 

. global participants2    share_female_percent2_BS leader2_2 leader2_2_BS leader2_3_BS

. global game game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

. 
end of do-file

. tab leader2_2

          0 |
 leader2_2_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         39       69.64       69.64
          1 |         17       30.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_no_leader_fem_vill

     Sum of |
    females |
that are no |
 leaders in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
          1 |          5        8.93       21.43
          2 |          8       14.29       35.71
          3 |         11       19.64       55.36
          4 |          7       12.50       67.86
          5 |         10       17.86       85.71
          6 |          4        7.14       92.86
          7 |          2        3.57       96.43
          9 |          1        1.79       98.21
         13 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_present_vill

 Leader was |
    present |
during game |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       16.07       16.07
          1 |         47       83.93      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab leader2_3_BS

          0 |
 leader2_3_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43       76.79       76.79
          1 |         13       23.21      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion_)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. 
. * Setting globals
. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS 

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -31.691898  
Iteration 2:   log pseudolikelihood = -31.678218  
Iteration 3:   log pseudolikelihood = -31.678217  

Probit regression                               Number of obs     =         56
                                                Wald chi2(4)      =       4.36
                                                Prob > chi2       =     0.3592
Log pseudolikelihood = -31.678217               Pseudo R2         =     0.0545

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   .3703614   .3688029     1.00   0.315    -.3524791    1.093202
share_female_percent3_BS |   .2086123   .1179318     1.77   0.077    -.0225297    .4397543
            leader2_2_BS |   .1543604   .4428705     0.35   0.727    -.7136498    1.022371
            leader2_3_BS |  -.3839008   .4888415    -0.79   0.432    -1.342012    .5742109
                   _cons |  -.0592351   .3936298    -0.15   0.880    -.8307355    .7122652
------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   .1183468   .1159841     1.02   0.308    -.1089778    .3456714
share_female_percent3_BS |   .0666608   .0361701     1.84   0.065    -.0042313    .1375529
            leader2_2_BS |   .0493249   .1408697     0.35   0.726    -.2267745    .3254244
            leader2_3_BS |  -.1226732   .1543318    -0.79   0.427    -.4251581    .1798117
------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .05446899

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.508993  
Iteration 2:   log pseudolikelihood = -29.462923  
Iteration 3:   log pseudolikelihood = -29.462903  
Iteration 4:   log pseudolikelihood = -29.462903  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       8.16
                                                Prob > chi2       =     0.2267
Log pseudolikelihood = -29.462903               Pseudo R2         =     0.1206

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4331209   .4088194     1.06   0.289    -.3681504    1.234392
        game_lead_facil |   -.883436   .5035155    -1.75   0.079    -1.870308    .1034362
game_count_intervention |   .0043599   .0140299     0.31   0.756    -.0231383     .031858
   game_optimal_inv_r10 |  -.2922256   .4293107    -0.68   0.496    -1.133659     .549208
    communication_rules |  -.0433948   .0235926    -1.84   0.066    -.0896354    .0028458
   game_come_back_dummy |  -.1210831   .5486584    -0.22   0.825    -1.196434    .9542677
                  _cons |    1.86726   .7777799     2.40   0.016     .3428392     3.39168
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1287188   .1183994     1.09   0.277    -.1033397    .3607773
        game_lead_facil |  -.2625476    .140708    -1.87   0.062    -.5383302    .0132351
game_count_intervention |   .0012957   .0041372     0.31   0.754    -.0068132    .0094046
   game_optimal_inv_r10 |  -.0868463   .1254736    -0.69   0.489    -.3327699    .1590774
    communication_rules |  -.0128965   .0067495    -1.91   0.056    -.0261252    .0003322
   game_come_back_dummy |  -.0359846   .1630368    -0.22   0.825    -.3555309    .2835618
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12059166

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -25.981045  
Iteration 2:   log pseudolikelihood = -25.438513  
Iteration 3:   log pseudolikelihood =  -25.43361  
Iteration 4:   log pseudolikelihood = -25.433609  

Probit regression                               Number of obs     =         56
                                                Wald chi2(14)     =      19.98
                                                Prob > chi2       =     0.1308
Log pseudolikelihood = -25.433609               Pseudo R2         =     0.2409

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .4743171   .4403976     1.08   0.281    -.3888463     1.33748
                       No_HH |  -.0008102   .0026908    -0.30   0.763     -.006084    .0044637
                    FES_site |   .1618746   .5022525     0.32   0.747    -.8225221    1.146271
                    Shar_Lit |   .0438193   .0289375     1.51   0.130    -.0128972    .1005358
                   Shar_SCST |  -.0216239    .015251    -1.42   0.156    -.0515154    .0082676
survey_dam_for_irrigation_FS |   .6128822   .5083058     1.21   0.228    -.3833788    1.609143
    share_female_percent3_BS |   .2015647   .1575478     1.28   0.201    -.1072233    .5103527
                leader2_2_BS |   .3636282    .479878     0.76   0.449    -.5769154    1.304172
                leader2_3_BS |  -.0265451   .6812115    -0.04   0.969    -1.361695    1.308605
             game_lead_facil |  -.8274395   .6085385    -1.36   0.174    -2.020153     .365274
     game_count_intervention |   .0075331   .0178676     0.42   0.673    -.0274868     .042553
        game_optimal_inv_r10 |  -.5949142    .445612    -1.34   0.182    -1.468298    .2784693
         communication_rules |  -.0356505   .0305444    -1.17   0.243    -.0955164    .0242155
        game_come_back_dummy |   .4145204   .6644586     0.62   0.533    -.8877946    1.716835
                       _cons |   .0565926   2.788069     0.02   0.984    -5.407922    5.521107
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3_BS leader2_2_BS leader2_3_BS
               game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .1197236   .1111043     1.08   0.281    -.0980368     .337484
                       No_HH |  -.0002045   .0006802    -0.30   0.764    -.0015377    .0011287
                    FES_site |   .0408592    .125618     0.33   0.745    -.2053476    .2870659
                    Shar_Lit |   .0110605     .00736     1.50   0.133    -.0033648    .0254858
                   Shar_SCST |  -.0054581   .0036861    -1.48   0.139    -.0126827    .0017664
survey_dam_for_irrigation_FS |   .1546992   .1237372     1.25   0.211    -.0878213    .3972196
    share_female_percent3_BS |   .0508775   .0382675     1.33   0.184    -.0241255    .1258804
                leader2_2_BS |   .0917843   .1210983     0.76   0.448     -.145564    .3291327
                leader2_3_BS |  -.0067003   .1718798    -0.04   0.969    -.3435785    .3301778
             game_lead_facil |  -.2088561   .1545044    -1.35   0.176    -.5116791    .0939669
     game_count_intervention |   .0019015   .0044823     0.42   0.671    -.0068837    .0106866
        game_optimal_inv_r10 |  -.1501638   .1095695    -1.37   0.171     -.364916    .0645884
         communication_rules |  -.0089986   .0074651    -1.21   0.228      -.02363    .0056327
        game_come_back_dummy |   .1046301   .1673496     0.63   0.532     -.223369    .4326293
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .24085796

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. esttab det1 det2 det3 det4 using "$working_ANALYSIS\results\Tables\tableSOM_determinants_treatment_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam ma
> intenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,eli
> st(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. Omitted category is ‘Control 
> villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_determinants_treatment_villages.rtf)

. 
end of do-file

. tab d_illiterate_BS

          0 |
d_illiterat |
         e_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       58.93       58.93
          1 |         23       41.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

. 
. 
end of do-file

. pwcorr $participants

             | sha~3_BS l~2_2_BS l~2_3_BS d_illi~S
-------------+------------------------------------
share_f~3_BS |   1.0000 
leader2_2_BS |  -0.1801   1.0000 
leader2_3_BS |   0.4593  -0.3630   1.0000 
d_illitera~S |  -0.1172   0.0804   0.0568   1.0000 

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global participants             share_female_percent3_BS  d_illiterate_BS

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -31.653096  
Iteration 2:   log pseudolikelihood = -31.636593  
Iteration 3:   log pseudolikelihood = -31.636585  
Iteration 4:   log pseudolikelihood = -31.636585  

Probit regression                               Number of obs     =         56
                                                Wald chi2(3)      =       3.99
                                                Prob > chi2       =     0.2622
Log pseudolikelihood = -31.636585               Pseudo R2         =     0.0557

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   .3465546   .3621103     0.96   0.339    -.3631685    1.056278
share_female_percent3_BS |   .1644731   .1081042     1.52   0.128    -.0474072    .3763534
         d_illiterate_BS |   .3813767     .37853     1.01   0.314    -.3605285    1.123282
                   _cons |  -.1391299   .4068918    -0.34   0.732     -.936623    .6583633
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.508993  
Iteration 2:   log pseudolikelihood = -29.462923  
Iteration 3:   log pseudolikelihood = -29.462903  
Iteration 4:   log pseudolikelihood = -29.462903  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       8.16
                                                Prob > chi2       =     0.2267
Log pseudolikelihood = -29.462903               Pseudo R2         =     0.1206

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4331209   .4088194     1.06   0.289    -.3681504    1.234392
        game_lead_facil |   -.883436   .5035155    -1.75   0.079    -1.870308    .1034362
game_count_intervention |   .0043599   .0140299     0.31   0.756    -.0231383     .031858
   game_optimal_inv_r10 |  -.2922256   .4293107    -0.68   0.496    -1.133659     .549208
    communication_rules |  -.0433948   .0235926    -1.84   0.066    -.0896354    .0028458
   game_come_back_dummy |  -.1210831   .5486584    -0.22   0.825    -1.196434    .9542677
                  _cons |    1.86726   .7777799     2.40   0.016     .3428392     3.39168
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -25.430585  
Iteration 2:   log pseudolikelihood = -24.997875  
Iteration 3:   log pseudolikelihood = -24.994831  
Iteration 4:   log pseudolikelihood = -24.994831  

Probit regression                               Number of obs     =         56
                                                Wald chi2(13)     =      25.79
                                                Prob > chi2       =     0.0181
Log pseudolikelihood = -24.994831               Pseudo R2         =     0.2540

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .4056637   .4363473     0.93   0.353    -.4495612    1.260889
                       No_HH |  -.0006162   .0026785    -0.23   0.818    -.0058659    .0046336
                    FES_site |   .2898298   .5022513     0.58   0.564    -.6945646    1.274224
                    Shar_Lit |   .0470304   .0290625     1.62   0.106    -.0099309    .1039918
                   Shar_SCST |   -.019338   .0138931    -1.39   0.164    -.0465681    .0078921
survey_dam_for_irrigation_FS |   .6142225   .4960083     1.24   0.216    -.3579359    1.586381
    share_female_percent3_BS |   .1789552   .1593136     1.12   0.261    -.1332938    .4912042
             d_illiterate_BS |   .5765896   .3960097     1.46   0.145    -.1995751    1.352754
             game_lead_facil |  -.9934514   .5965091    -1.67   0.096    -2.162588     .175685
     game_count_intervention |   .0130654   .0174417     0.75   0.454    -.0211197    .0472505
        game_optimal_inv_r10 |  -.4193925   .4538326    -0.92   0.355    -1.308888     .470103
         communication_rules |   -.025865    .031146    -0.83   0.406    -.0869102    .0351801
        game_come_back_dummy |   .3957657   .7267246     0.54   0.586    -1.028588     1.82012
                       _cons |  -.9077042   2.722591    -0.33   0.739    -6.243884    4.428476
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. 
end of do-file

. pwcorr  share_female_percent_BS leader2_3_BS

             | share_.. l~2_3_BS
-------------+------------------
share_f~t_BS |   1.0000 
leader2_3_BS |   0.5659   1.0000 

. pwcorr  share_female_percent3_BS leader2_3_BS

             | sha~3_BS l~2_3_BS
-------------+------------------
share_f~3_BS |   1.0000 
leader2_3_BS |   0.4593   1.0000 

. pwcorr  share_female_percent2_BS leader2_3_BS

             | sha~2_BS l~2_3_BS
-------------+------------------
share_f~2_BS |   1.0000 
leader2_3_BS |   0.4593   1.0000 

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy

. 
. 
end of do-file

. tab game_dist_field_vill

    Average |
   distance |
    between |
participant |
   s fields |
 and dam in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
   1.571429 |          1        1.79        1.79
        2.5 |          1        1.79        3.57
   2.571429 |          1        1.79        5.36
   2.642857 |          3        5.36       10.71
   2.785714 |          1        1.79       12.50
   2.833333 |          1        1.79       14.29
   2.857143 |          1        1.79       16.07
        3.5 |          1        1.79       17.86
   3.714286 |          1        1.79       19.64
   3.857143 |          1        1.79       21.43
   3.928571 |          1        1.79       23.21
          4 |          2        3.57       26.79
   4.071429 |          3        5.36       32.14
   4.214286 |          1        1.79       33.93
   4.538462 |          1        1.79       35.71
   4.642857 |          2        3.57       39.29
   4.714286 |          1        1.79       41.07
          5 |          1        1.79       42.86
   5.142857 |          1        1.79       44.64
   5.357143 |          1        1.79       46.43
        5.5 |          2        3.57       50.00
   5.571429 |          1        1.79       51.79
   5.642857 |          1        1.79       53.57
          6 |          1        1.79       55.36
   6.285714 |          1        1.79       57.14
   6.357143 |          1        1.79       58.93
   6.384615 |          1        1.79       60.71
   6.428571 |          1        1.79       62.50
   6.928571 |          1        1.79       64.29
   7.071429 |          1        1.79       66.07
   7.142857 |          1        1.79       67.86
   7.285714 |          1        1.79       69.64
   7.428571 |          1        1.79       71.43
   7.666667 |          1        1.79       73.21
   7.928571 |          1        1.79       75.00
          8 |          1        1.79       76.79
   8.384615 |          1        1.79       78.57
   8.846154 |          1        1.79       80.36
          9 |          1        1.79       82.14
   9.071428 |          1        1.79       83.93
   9.285714 |          1        1.79       85.71
         10 |          1        1.79       87.50
         11 |          1        1.79       89.29
   11.14286 |          1        1.79       91.07
   11.18182 |          1        1.79       92.86
   11.35714 |          1        1.79       94.64
   12.07143 |          1        1.79       96.43
       13.5 |          1        1.79       98.21
   13.84615 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_edu_fem_illit_vill

     Sum of |
    females |
   that are |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         48       85.71       85.71
          1 |          5        8.93       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_edu_fem_prim_vill

     Sum of |
    females |
  that have |
    primary |
  education |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       14.29       14.29
          1 |         13       23.21       37.50
          2 |         11       19.64       57.14
          3 |          9       16.07       73.21
          4 |          6       10.71       83.93
          5 |          5        8.93       92.86
          6 |          1        1.79       94.64
          7 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_edu_male_prim_vill

     Sum of |
 males that |
       have |
    primary |
  education |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.79        1.79
          2 |          3        5.36        7.14
          3 |          6       10.71       17.86
          4 |          5        8.93       26.79
          5 |         10       17.86       44.64
          6 |          6       10.71       55.36
          7 |         11       19.64       75.00
          8 |          8       14.29       89.29
          9 |          4        7.14       96.43
         10 |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab tab Village
variable tab not found
r(111);

. tab Village

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                     Aouri Rayat |          1        1.19        1.19
                       Atarchuha |          1        1.19        2.38
                         Atariya |          1        1.19        3.57
          Aurai Mal.(Ourai Mal.) |          1        1.19        4.76
                    Baghraudi FV |          1        1.19        5.95
                    Bamhani Ryt. |          1        1.19        7.14
                      Banijagoan |          1        1.19        8.33
                          Bariha |          1        1.19        9.52
                        Barkheda |          1        1.19       10.71
                          Batwar |          1        1.19       11.90
                          Bhapsa |          1        1.19       13.10
                          Bhawan |          1        1.19       14.29
                       Bhawartal |          1        1.19       15.48
                        Bhimpuri |          1        1.19       16.67
                           Birsa |          1        1.19       17.86
                      Budhanwara |          1        1.19       19.05
                    Chandiya Ryt |          1        1.19       20.24
                      Changariya |          1        1.19       21.43
                     Chatuwakhar |          1        1.19       22.62
                       Chouranga |          1        1.19       23.81
                        Danitola |          1        1.19       25.00
                           Deori |          1        1.19       26.19
                      Dhamangaon |          1        1.19       27.38
                  Dharampuri Mal |          1        1.19       28.57
                         Dilwara |          1        1.19       29.76
                           Dudka |          1        1.19       30.95
                        Dungaria |          1        1.19       32.14
              Dungariya Ramnagar |          1        1.19       33.33
                        Dungravt |          1        1.19       34.52
                            Fonk |          1        1.19       35.71
                           Ghont |          1        1.19       36.90
                           Gubri |          1        1.19       38.10
                        Gunegaon |          1        1.19       39.29
                        Gunehara |          1        1.19       40.48
                       Harrabhat |          1        1.19       41.67
                  Harrabhat Mal. |          1        1.19       42.86
                          Jhagul |          1        1.19       44.05
                          Jhulup |          1        1.19       45.24
                   Kanhari Kalan |          1        1.19       46.43
                   Kanhari Khurd |          1        1.19       47.62
                        Kata Mal |          1        1.19       48.81
                         Katajar |          1        1.19       50.00
                     Katanga Mal |          1        1.19       51.19
                     Katanga Ryt |          1        1.19       52.38
                     Khalaudi FV |          1        1.19       53.57
                       Khamrauti |          1        1.19       54.76
                 Khatiya Narangi |          1        1.19       55.95
                       Khirahani |          1        1.19       57.14
                       Kosampani |          1        1.19       58.33
                         Kurwahi |          1        1.19       59.52
                      Lohta F.V. |          1        1.19       60.71
                          Magdha |          1        1.19       61.90
                          Malara |          1        1.19       63.10
                        Manegaon |          1        1.19       64.29
                   Mangaveli Mal |          1        1.19       65.48
                   Mangaveli Ryt |          1        1.19       66.67
                    Manikpur Mal |          1        1.19       67.86
                      Manoharpur |          1        1.19       69.05
                         Mataval |          1        1.19       70.24
                        Medhatal |          1        1.19       71.43
                        Mohagoan |          1        1.19       72.62
                      Mohagoan 2 |          1        1.19       73.81
                      Mubala_Mal |          1        1.19       75.00
                           Muhad |          1        1.19       76.19
                 Mulwalasani Ryt |          1        1.19       77.38
                           Newsa |          1        1.19       78.57
                        Padariya |          1        1.19       79.76
                         Patpara |          1        1.19       80.95
                       Rajo Mal. |          1        1.19       82.14
                            Rata |          1        1.19       83.33
                        Ratanpur |          1        1.19       84.52
              Samaiya Bhagpur FV |          1        1.19       85.71
                    Saradoli Mal |          1        1.19       86.90
                       Sarasdoli |          1        1.19       88.10
                           Sarhi |          1        1.19       89.29
                          Sautia |          1        1.19       90.48
                        Shahapur |          1        1.19       91.67
                         Taktuwa |          1        1.19       92.86
                          Thonda |          1        1.19       94.05
                          Tilari |          1        1.19       95.24
                      Umariya FV |          1        1.19       96.43
                         Urdali  |          1        1.19       97.62
                      Urdali mal |          1        1.19       98.81
                 Vishanpura Ryt. |          1        1.19      100.00
---------------------------------+-----------------------------------
                           Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. egen participants_primary_only = rowsum(game_edu_fem_prim_vill game_edu_male_prim_vill), by(Village)
unknown egen function rowsum()
r(133);

end of do-file

r(133);

. help egen

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill), by(Village)
egen ... rowtotal() may not be combined with by
r(190);

end of do-file

r(190);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. 
end of do-file

. tab participants_primary_only

participant |
s_primary_o |
        nly |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         28       33.33       33.33
          4 |          3        3.57       36.90
          5 |          5        5.95       42.86
          6 |          3        3.57       46.43
          7 |         11       13.10       59.52
          8 |         10       11.90       71.43
          9 |          7        8.33       79.76
         10 |          6        7.14       86.90
         11 |          5        5.95       92.86
         12 |          3        3.57       96.43
         13 |          3        3.57      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. 
. * Setting globals
. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS d_illiterate_BS

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -31.024034  
Iteration 2:   log pseudolikelihood = -30.995279  
Iteration 3:   log pseudolikelihood = -30.995274  
Iteration 4:   log pseudolikelihood = -30.995274  

Probit regression                               Number of obs     =         56
                                                Wald chi2(5)      =       5.69
                                                Prob > chi2       =     0.3377
Log pseudolikelihood = -30.995274               Pseudo R2         =     0.0749

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   .3336448   .3680718     0.91   0.365    -.3877626    1.055052
share_female_percent3_BS |    .238882   .1223418     1.95   0.051    -.0009034    .4786675
            leader2_2_BS |   .0897488   .4367035     0.21   0.837    -.7661744     .945672
            leader2_3_BS |  -.5307937   .4913214    -1.08   0.280    -1.493766    .4321786
         d_illiterate_BS |   .4589409   .3762756     1.22   0.223    -.2785456    1.196428
                   _cons |  -.2340211   .4461783    -0.52   0.600    -1.108515    .6404724
------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   .1040024   .1126733     0.92   0.356    -.1168331    .3248379
share_female_percent3_BS |   .0744633   .0365479     2.04   0.042     .0028307     .146096
            leader2_2_BS |   .0279761   .1356788     0.21   0.837    -.2379495    .2939018
            leader2_3_BS |  -.1654568   .1512911    -1.09   0.274    -.4619819    .1310682
         d_illiterate_BS |   .1430592   .1139377     1.26   0.209    -.0802546     .366373
------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .07485346

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1269978   .1176305     1.08   0.280    -.1035538    .3575494
        game_lead_facil |  -.2266991   .1423163    -1.59   0.111     -.505634    .0522357
game_count_intervention |   .0023744   .0041919     0.57   0.571    -.0058416    .0105904
   game_optimal_inv_r10 |  -.1024703   .1231733    -0.83   0.405    -.3438856     .138945
    communication_rules |  -.0118164   .0067583    -1.75   0.080    -.0250624    .0014297
   game_come_back_dummy |  -.0072882   .1715955    -0.04   0.966    -.3436093    .3290329
        game_discussion |  -.1029862   .2054611    -0.50   0.616    -.5056825      .29971
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12463162

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -24.702609  
Iteration 2:   log pseudolikelihood = -24.270459  
Iteration 3:   log pseudolikelihood = -24.266814  
Iteration 4:   log pseudolikelihood = -24.266814  

Probit regression                               Number of obs     =         55
                                                Wald chi2(16)     =      27.51
                                                Prob > chi2       =     0.0361
Log pseudolikelihood = -24.266814               Pseudo R2         =     0.2683

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .3915965   .4410185     0.89   0.375    -.4727839    1.255977
                       No_HH |  -.0002184   .0026088    -0.08   0.933    -.0053316    .0048949
                    FES_site |   .2662691   .4966093     0.54   0.592    -.7070672    1.239605
                    Shar_Lit |   .0480226   .0285364     1.68   0.092    -.0079076    .1039529
                   Shar_SCST |  -.0191224   .0150993    -1.27   0.205    -.0487165    .0104716
survey_dam_for_irrigation_FS |   .5556387   .5093676     1.09   0.275    -.4427034    1.553981
    share_female_percent3_BS |   .1972878   .1710667     1.15   0.249    -.1379969    .5325724
                leader2_2_BS |   .3798489      .4943     0.77   0.442    -.5889612    1.348659
                leader2_3_BS |  -.2022884   .6985772    -0.29   0.772    -1.571475    1.166898
             d_illiterate_BS |   .6415139   .3735048     1.72   0.086    -.0905422     1.37357
             game_lead_facil |  -.7920661   .6097057    -1.30   0.194    -1.987067    .4029352
     game_count_intervention |    .017264   .0181497     0.95   0.342    -.0183088    .0528368
        game_optimal_inv_r10 |   -.518099   .4402812    -1.18   0.239    -1.381034    .3448363
         communication_rules |  -.0236106   .0316554    -0.75   0.456    -.0856541    .0384328
        game_come_back_dummy |   .5044353   .7427937     0.68   0.497    -.9514136    1.960284
             game_discussion |  -.2882334   .7306332    -0.39   0.693    -1.720248    1.143781
                       _cons |  -1.352883   2.723507    -0.50   0.619    -6.690859    3.985092
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3_BS leader2_2_BS leader2_3_BS
               d_illiterate_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |    .095482   .1063541     0.90   0.369    -.1129682    .3039321
                       No_HH |  -.0000532   .0006365    -0.08   0.933    -.0013008    .0011943
                    FES_site |   .0649237   .1204372     0.54   0.590    -.1711289    .3009764
                    Shar_Lit |   .0117092   .0070043     1.67   0.095    -.0020189    .0254374
                   Shar_SCST |  -.0046626   .0035676    -1.31   0.191     -.011655    .0023299
survey_dam_for_irrigation_FS |     .13548   .1221688     1.11   0.267    -.1039665    .3749264
    share_female_percent3_BS |   .0481042   .0407215     1.18   0.237    -.0317085    .1279168
                leader2_2_BS |   .0926176   .1205519     0.77   0.442    -.1436598     .328895
                leader2_3_BS |  -.0493235   .1703716    -0.29   0.772    -.3832457    .2845988
             d_illiterate_BS |   .1564187   .0906749     1.73   0.085    -.0213009    .3341383
             game_lead_facil |  -.1931275   .1488735    -1.30   0.195    -.4849141    .0986592
     game_count_intervention |   .0042094   .0043595     0.97   0.334    -.0043351     .012754
        game_optimal_inv_r10 |  -.1263268   .1038957    -1.22   0.224    -.3299586    .0773051
         communication_rules |  -.0057569   .0075646    -0.76   0.447    -.0205832    .0090694
        game_come_back_dummy |   .1229952   .1833146     0.67   0.502    -.2362948    .4822851
             game_discussion |  -.0702792   .1774888    -0.40   0.692    -.4181509    .2775925
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .26825641

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. esttab det1 det2 det3 det4 using "$working_ANALYSIS\results\Tables\tableSOM_determinants_treatment_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam ma
> intenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,eli
> st(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. Omitted category is ‘Control 
> villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_determinants_treatment_villages.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.690924  
Iteration 2:   log pseudolikelihood =  -30.63097  
Iteration 3:   log pseudolikelihood = -30.630794  
Iteration 4:   log pseudolikelihood = -30.630794  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       7.44
                                                Prob > chi2       =     0.2818
Log pseudolikelihood = -30.630794               Pseudo R2         =     0.0857

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .4482566   .3848294     1.16   0.244    -.3059952    1.202508
 share_female_percent3_BS |   .2710596   .1255555     2.16   0.031     .0249752    .5171439
             leader2_2_BS |  -.0458684   .4513369    -0.10   0.919    -.9304726    .8387357
             leader2_3_BS |  -.5903928   .4867494    -1.21   0.225    -1.544404    .3636185
          d_illiterate_BS |    .378957   .3934679     0.96   0.335    -.3922258     1.15014
participants_primary_only |  -.0786031   .0830912    -0.95   0.344    -.2414589    .0842527
                    _cons |   .3863545   .8140512     0.47   0.635    -1.209157    1.981866
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .1381516   .1159485     1.19   0.233    -.0891033    .3654066
 share_female_percent3_BS |   .0835399   .0373613     2.24   0.025     .0103132    .1567667
             leader2_2_BS |  -.0141365   .1393534    -0.10   0.919    -.2872642    .2589911
             leader2_3_BS |  -.1819577   .1492374    -1.22   0.223    -.4744577    .1105423
          d_illiterate_BS |   .1167937    .118607     0.98   0.325    -.1156718    .3492592
participants_primary_only |  -.0242253   .0255473    -0.95   0.343     -.074297    .0258464
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .08573246

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1269978   .1176305     1.08   0.280    -.1035538    .3575494
        game_lead_facil |  -.2266991   .1423163    -1.59   0.111     -.505634    .0522357
game_count_intervention |   .0023744   .0041919     0.57   0.571    -.0058416    .0105904
   game_optimal_inv_r10 |  -.1024703   .1231733    -0.83   0.405    -.3438856     .138945
    communication_rules |  -.0118164   .0067583    -1.75   0.080    -.0250624    .0014297
   game_come_back_dummy |  -.0072882   .1715955    -0.04   0.966    -.3436093    .3290329
        game_discussion |  -.1029862   .2054611    -0.50   0.616    -.5056825      .29971
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12463162

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -23.638374  
Iteration 2:   log pseudolikelihood = -22.672846  
Iteration 3:   log pseudolikelihood = -22.645197  
Iteration 4:   log pseudolikelihood = -22.645168  
Iteration 5:   log pseudolikelihood = -22.645168  

Probit regression                               Number of obs     =         55
                                                Wald chi2(17)     =      25.32
                                                Prob > chi2       =     0.0879
Log pseudolikelihood = -22.645168               Pseudo R2         =     0.3172

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |     .70348   .4919077     1.43   0.153    -.2606413    1.667601
                       No_HH |  -.0007999    .002654    -0.30   0.763    -.0060016    .0044018
                    FES_site |    .385789   .5021979     0.77   0.442    -.5985008    1.370079
                    Shar_Lit |   .0543349   .0310286     1.75   0.080    -.0064801    .1151499
                   Shar_SCST |  -.0188198   .0157334    -1.20   0.232    -.0496567     .012017
survey_dam_for_irrigation_FS |   .4437968   .4926687     0.90   0.368    -.5218161     1.40941
    share_female_percent3_BS |   .3022818   .1878777     1.61   0.108    -.0659517    .6705153
                leader2_2_BS |   .0412048   .4925027     0.08   0.933    -.9240826    1.006492
                leader2_3_BS |   -.408188   .7010994    -0.58   0.560    -1.782317    .9659415
             d_illiterate_BS |   .3191838   .4378196     0.73   0.466    -.5389269    1.177294
   participants_primary_only |  -.2755653   .1361156    -2.02   0.043    -.5423469   -.0087837
             game_lead_facil |  -.6731644   .6381557    -1.05   0.291    -1.923927    .5775979
     game_count_intervention |   .0245975   .0196801     1.25   0.211    -.0139748    .0631699
        game_optimal_inv_r10 |  -.9760816   .5686267    -1.72   0.086    -2.090569    .1384062
         communication_rules |  -.0195581   .0326359    -0.60   0.549    -.0835233    .0444072
        game_come_back_dummy |   .9560753   .8565336     1.12   0.264    -.7226997     2.63485
             game_discussion |  -1.047488   .8942556    -1.17   0.241    -2.800197    .7052203
                       _cons |   .2620275   2.997375     0.09   0.930     -5.61272    6.136775
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3_BS leader2_2_BS leader2_3_BS
               d_illiterate_BS participants_primary_only game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy
               game_discussion

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .1605192   .1073577     1.50   0.135    -.0498981    .3709364
                       No_HH |  -.0001825   .0006024    -0.30   0.762    -.0013632    .0009982
                    FES_site |   .0880288   .1144867     0.77   0.442    -.1363609    .3124186
                    Shar_Lit |   .0123981   .0070534     1.76   0.079    -.0014264    .0262225
                   Shar_SCST |  -.0042943   .0034504    -1.24   0.213     -.011057    .0024684
survey_dam_for_irrigation_FS |    .101265   .1095319     0.92   0.355    -.1134135    .3159435
    share_female_percent3_BS |   .0689743   .0421581     1.64   0.102    -.0136541    .1516027
                leader2_2_BS |   .0094021   .1122878     0.08   0.933     -.210678    .2294821
                leader2_3_BS |  -.0931398   .1604746    -0.58   0.562    -.4076642    .2213846
             d_illiterate_BS |   .0728309   .1004403     0.73   0.468    -.1240284    .2696903
   participants_primary_only |  -.0628781   .0286217    -2.20   0.028    -.1189757   -.0067806
             game_lead_facil |  -.1536018    .148102    -1.04   0.300    -.4438764    .1366728
     game_count_intervention |   .0056126   .0043397     1.29   0.196    -.0028931    .0141184
        game_optimal_inv_r10 |   -.222721   .1181575    -1.88   0.059    -.4543054    .0088633
         communication_rules |  -.0044627   .0072932    -0.61   0.541    -.0187572    .0098317
        game_come_back_dummy |    .218156   .1949467     1.12   0.263    -.1639325    .6002446
             game_discussion |  -.2390146   .1956184    -1.22   0.222    -.6224196    .1443905
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .31715567

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. esttab det1 det2 det3 det4 using "$working_ANALYSIS\results\Tables\tableSOM_determinants_treatment_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam ma
> intenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,eli
> st(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. Omitted category is ‘Control 
> villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableSOM_determinants_treatment_villages.rtf)

. 
end of do-file

. help gets

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. cap mkdir "$working_ANALYSIS/scripts/libraries\stata"

. net set ado "$working_ANALYSIS/scripts/libraries\stata"

. 
end of do-file

. ssc install gets
checking gets consistency and verifying not already installed...
installing into D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries\stata\...
installation complete.

. ssc install genspec
checking genspec consistency and verifying not already installed...
installing into D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries\stata\...
installation complete.

. help genspec

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. genspec survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, vce(robust)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
Doornik-Hansen test rejects normality of errors in the GUM.
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The in-sample Chow test rejects equality of coefficients
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The GUM fails 2 of 3 misspecification tests.  yRESET test for misspecification not rejected.  This GUM performs poorly. Care should be taken in interpretation.

This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on
Specific Model:

Linear regression                               Number of obs     =         56
                                                F(1, 54)          =       2.40
                                                Prob > F          =     0.1273
                                                R-squared         =     0.0395
                                                Root MSE          =     .45088

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
game_count_intervention |   .0059448   .0038388     1.55   0.127    -.0017515    .0136411
                  _cons |   .5556865   .1305386     4.26   0.000     .2939723    .8174007
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. gets survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, vce(robust)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
Doornik-Hansen test rejects normality of errors in the GUM.
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The in-sample Chow test rejects equality of coefficients
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The GUM fails 2 of 3 misspecification tests.  RESET test for misspecification not rejected.
This GUM performs poorly. Care should be taken in interpretation.

This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on

Linear regression                               Number of obs     =         56
                                                F(1, 54)          =       2.40
                                                Prob > F          =     0.1273
                                                R-squared         =     0.0395
                                                Root MSE          =     .45088

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
game_count_intervention |   .0059448   .0038388     1.55   0.127    -.0017515    .0136411
                  _cons |   .5556865   .1305386     4.26   0.000     .2939723    .8174007
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. 
. * Setting globals
. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
. 
. 
. *main outcome variables
. *conflict
. 
. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1


. *Figure 1.      Gender effects
. 
. *Panel A: Determinants of Maintenance & Rules in treatment villages
. *maintenance
. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0641692    .114479     0.56   0.575    -.1602055    .2885438
                       No_HH |   .0001053   .0007157     0.15   0.883    -.0012974    .0015081
                    FES_site |   .1879048   .1279448     1.47   0.142    -.0628624     .438672
                    Shar_Lit |   .0098741    .007466     1.32   0.186    -.0047589    .0245071
                   Shar_SCST |  -.0026312   .0034237    -0.77   0.442    -.0093416    .0040792
survey_dam_for_irrigation_FS |   .1097315   .1156734     0.95   0.343    -.1169843    .3364472
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .09733206

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.690924  
Iteration 2:   log pseudolikelihood =  -30.63097  
Iteration 3:   log pseudolikelihood = -30.630794  
Iteration 4:   log pseudolikelihood = -30.630794  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       7.44
                                                Prob > chi2       =     0.2818
Log pseudolikelihood = -30.630794               Pseudo R2         =     0.0857

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .4482566   .3848294     1.16   0.244    -.3059952    1.202508
 share_female_percent3_BS |   .2710596   .1255555     2.16   0.031     .0249752    .5171439
             leader2_2_BS |  -.0458684   .4513369    -0.10   0.919    -.9304726    .8387357
             leader2_3_BS |  -.5903928   .4867494    -1.21   0.225    -1.544404    .3636185
          d_illiterate_BS |    .378957   .3934679     0.96   0.335    -.3922258     1.15014
participants_primary_only |  -.0786031   .0830912    -0.95   0.344    -.2414589    .0842527
                    _cons |   .3863545   .8140512     0.47   0.635    -1.209157    1.981866
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS share_female_percent3_BS leader2_2_BS leader2_3_BS d_illiterate_BS participants_primary_only

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .1381516   .1159485     1.19   0.233    -.0891033    .3654066
 share_female_percent3_BS |   .0835399   .0373613     2.24   0.025     .0103132    .1567667
             leader2_2_BS |  -.0141365   .1393534    -0.10   0.919    -.2872642    .2589911
             leader2_3_BS |  -.1819577   .1492374    -1.22   0.223    -.4744577    .1105423
          d_illiterate_BS |   .1167937    .118607     0.98   0.325    -.1156718    .3492592
participants_primary_only |  -.0242253   .0255473    -0.95   0.343     -.074297    .0258464
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .08573246

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .1269978   .1176305     1.08   0.280    -.1035538    .3575494
        game_lead_facil |  -.2266991   .1423163    -1.59   0.111     -.505634    .0522357
game_count_intervention |   .0023744   .0041919     0.57   0.571    -.0058416    .0105904
   game_optimal_inv_r10 |  -.1024703   .1231733    -0.83   0.405    -.3438856     .138945
    communication_rules |  -.0118164   .0067583    -1.75   0.080    -.0250624    .0014297
   game_come_back_dummy |  -.0072882   .1715955    -0.04   0.966    -.3436093    .3290329
        game_discussion |  -.1029862   .2054611    -0.50   0.616    -.5056825      .29971
-----------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12463162

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -23.638374  
Iteration 2:   log pseudolikelihood = -22.672846  
Iteration 3:   log pseudolikelihood = -22.645197  
Iteration 4:   log pseudolikelihood = -22.645168  
Iteration 5:   log pseudolikelihood = -22.645168  

Probit regression                               Number of obs     =         55
                                                Wald chi2(17)     =      25.32
                                                Prob > chi2       =     0.0879
Log pseudolikelihood = -22.645168               Pseudo R2         =     0.3172

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |     .70348   .4919077     1.43   0.153    -.2606413    1.667601
                       No_HH |  -.0007999    .002654    -0.30   0.763    -.0060016    .0044018
                    FES_site |    .385789   .5021979     0.77   0.442    -.5985008    1.370079
                    Shar_Lit |   .0543349   .0310286     1.75   0.080    -.0064801    .1151499
                   Shar_SCST |  -.0188198   .0157334    -1.20   0.232    -.0496567     .012017
survey_dam_for_irrigation_FS |   .4437968   .4926687     0.90   0.368    -.5218161     1.40941
    share_female_percent3_BS |   .3022818   .1878777     1.61   0.108    -.0659517    .6705153
                leader2_2_BS |   .0412048   .4925027     0.08   0.933    -.9240826    1.006492
                leader2_3_BS |   -.408188   .7010994    -0.58   0.560    -1.782317    .9659415
             d_illiterate_BS |   .3191838   .4378196     0.73   0.466    -.5389269    1.177294
   participants_primary_only |  -.2755653   .1361156    -2.02   0.043    -.5423469   -.0087837
             game_lead_facil |  -.6731644   .6381557    -1.05   0.291    -1.923927    .5775979
     game_count_intervention |   .0245975   .0196801     1.25   0.211    -.0139748    .0631699
        game_optimal_inv_r10 |  -.9760816   .5686267    -1.72   0.086    -2.090569    .1384062
         communication_rules |  -.0195581   .0326359    -0.60   0.549    -.0835233    .0444072
        game_come_back_dummy |   .9560753   .8565336     1.12   0.264    -.7226997     2.63485
             game_discussion |  -1.047488   .8942556    -1.17   0.241    -2.800197    .7052203
                       _cons |   .2620275   2.997375     0.09   0.930     -5.61272    6.136775
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3_BS leader2_2_BS leader2_3_BS
               d_illiterate_BS participants_primary_only game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy
               game_discussion

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .1605192   .1073577     1.50   0.135    -.0498981    .3709364
                       No_HH |  -.0001825   .0006024    -0.30   0.762    -.0013632    .0009982
                    FES_site |   .0880288   .1144867     0.77   0.442    -.1363609    .3124186
                    Shar_Lit |   .0123981   .0070534     1.76   0.079    -.0014264    .0262225
                   Shar_SCST |  -.0042943   .0034504    -1.24   0.213     -.011057    .0024684
survey_dam_for_irrigation_FS |    .101265   .1095319     0.92   0.355    -.1134135    .3159435
    share_female_percent3_BS |   .0689743   .0421581     1.64   0.102    -.0136541    .1516027
                leader2_2_BS |   .0094021   .1122878     0.08   0.933     -.210678    .2294821
                leader2_3_BS |  -.0931398   .1604746    -0.58   0.562    -.4076642    .2213846
             d_illiterate_BS |   .0728309   .1004403     0.73   0.468    -.1240284    .2696903
   participants_primary_only |  -.0628781   .0286217    -2.20   0.028    -.1189757   -.0067806
             game_lead_facil |  -.1536018    .148102    -1.04   0.300    -.4438764    .1366728
     game_count_intervention |   .0056126   .0043397     1.29   0.196    -.0028931    .0141184
        game_optimal_inv_r10 |   -.222721   .1181575    -1.88   0.059    -.4543054    .0088633
         communication_rules |  -.0044627   .0072932    -0.61   0.541    -.0187572    .0098317
        game_come_back_dummy |    .218156   .1949467     1.12   0.263    -.1639325    .6002446
             game_discussion |  -.2390146   .1956184    -1.22   0.222    -.6224196    .1443905
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .31715567

. 
. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -23.638374  
Iteration 2:   log pseudolikelihood = -22.672846  
Iteration 3:   log pseudolikelihood = -22.645197  
Iteration 4:   log pseudolikelihood = -22.645168  
Iteration 5:   log pseudolikelihood = -22.645168  

Probit regression                               Number of obs     =         55
                                                Wald chi2(17)     =      25.32
                                                Prob > chi2       =     0.0879
Log pseudolikelihood = -22.645168               Pseudo R2         =     0.3172

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |     .70348   .4919077     1.43   0.153    -.2606413    1.667601
                       No_HH |  -.0007999    .002654    -0.30   0.763    -.0060016    .0044018
                    FES_site |    .385789   .5021979     0.77   0.442    -.5985008    1.370079
                    Shar_Lit |   .0543349   .0310286     1.75   0.080    -.0064801    .1151499
                   Shar_SCST |  -.0188198   .0157334    -1.20   0.232    -.0496567     .012017
survey_dam_for_irrigation_FS |   .4437968   .4926687     0.90   0.368    -.5218161     1.40941
    share_female_percent3_BS |   .3022818   .1878777     1.61   0.108    -.0659517    .6705153
                leader2_2_BS |   .0412048   .4925027     0.08   0.933    -.9240826    1.006492
                leader2_3_BS |   -.408188   .7010994    -0.58   0.560    -1.782317    .9659415
             d_illiterate_BS |   .3191838   .4378196     0.73   0.466    -.5389269    1.177294
   participants_primary_only |  -.2755653   .1361156    -2.02   0.043    -.5423469   -.0087837
             game_lead_facil |  -.6731644   .6381557    -1.05   0.291    -1.923927    .5775979
     game_count_intervention |   .0245975   .0196801     1.25   0.211    -.0139748    .0631699
        game_optimal_inv_r10 |  -.9760816   .5686267    -1.72   0.086    -2.090569    .1384062
         communication_rules |  -.0195581   .0326359    -0.60   0.549    -.0835233    .0444072
        game_come_back_dummy |   .9560753   .8565336     1.12   0.264    -.7226997     2.63485
             game_discussion |  -1.047488   .8942556    -1.17   0.241    -2.800197    .7052203
                       _cons |   .2620275   2.997375     0.09   0.930     -5.61272    6.136775
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS share_female_percent3_BS leader2_2_BS leader2_3_BS
               d_illiterate_BS participants_primary_only game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy
               game_discussion

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .1605192   .1073577     1.50   0.135    -.0498981    .3709364
                       No_HH |  -.0001825   .0006024    -0.30   0.762    -.0013632    .0009982
                    FES_site |   .0880288   .1144867     0.77   0.442    -.1363609    .3124186
                    Shar_Lit |   .0123981   .0070534     1.76   0.079    -.0014264    .0262225
                   Shar_SCST |  -.0042943   .0034504    -1.24   0.213     -.011057    .0024684
survey_dam_for_irrigation_FS |    .101265   .1095319     0.92   0.355    -.1134135    .3159435
    share_female_percent3_BS |   .0689743   .0421581     1.64   0.102    -.0136541    .1516027
                leader2_2_BS |   .0094021   .1122878     0.08   0.933     -.210678    .2294821
                leader2_3_BS |  -.0931398   .1604746    -0.58   0.562    -.4076642    .2213846
             d_illiterate_BS |   .0728309   .1004403     0.73   0.468    -.1240284    .2696903
   participants_primary_only |  -.0628781   .0286217    -2.20   0.028    -.1189757   -.0067806
             game_lead_facil |  -.1536018    .148102    -1.04   0.300    -.4438764    .1366728
     game_count_intervention |   .0056126   .0043397     1.29   0.196    -.0028931    .0141184
        game_optimal_inv_r10 |   -.222721   .1181575    -1.88   0.059    -.4543054    .0088633
         communication_rules |  -.0044627   .0072932    -0.61   0.541    -.0187572    .0098317
        game_come_back_dummy |    .218156   .1949467     1.12   0.263    -.1639325    .6002446
             game_discussion |  -.2390146   .1956184    -1.22   0.222    -.6224196    .1443905
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .31715567

. 
. gets survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, vce(robust)
# of observations is > 10% of sample size. Will not run out-of-sample tests.
Doornik-Hansen test rejects normality of errors in the GUM.
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The in-sample Chow test rejects equality of coefficients
Respecify using nodiagnostic if you wish to continue without specification tests. This option should be used with caution.

The GUM fails 2 of 3 misspecification tests.  RESET test for misspecification not rejected.
This GUM performs poorly. Care should be taken in interpretation.

This model does not improve the F-statistic, reverting
This model does not improve the F-statistic, reverting
This model does not improve the F-statistic
This path does not pass misspecification tests. Moving on

Linear regression                               Number of obs     =         56
                                                F(1, 54)          =       2.40
                                                Prob > F          =     0.1273
                                                R-squared         =     0.0395
                                                Root MSE          =     .45088

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
game_count_intervention |   .0059448   .0038388     1.55   0.127    -.0017515    .0136411
                  _cons |   .5556865   .1305386     4.26   0.000     .2939723    .8174007
-----------------------------------------------------------------------------------------

. 
end of do-file

. help gets

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -23.638374  
Iteration 2:   log pseudolikelihood = -22.672846  
Iteration 3:   log pseudolikelihood = -22.645197  
Iteration 4:   log pseudolikelihood = -22.645168  
Iteration 5:   log pseudolikelihood = -22.645168  

Probit regression                               Number of obs     =         55
                                                Wald chi2(17)     =      25.32
                                                Prob > chi2       =     0.0879
Log pseudolikelihood = -22.645168               Pseudo R2         =     0.3172

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |     .70348   .4919077     1.43   0.153    -.2606413    1.667601
                       No_HH |  -.0007999    .002654    -0.30   0.763    -.0060016    .0044018
                    FES_site |    .385789   .5021979     0.77   0.442    -.5985008    1.370079
                    Shar_Lit |   .0543349   .0310286     1.75   0.080    -.0064801    .1151499
                   Shar_SCST |  -.0188198   .0157334    -1.20   0.232    -.0496567     .012017
survey_dam_for_irrigation_FS |   .4437968   .4926687     0.90   0.368    -.5218161     1.40941
    share_female_percent3_BS |   .3022818   .1878777     1.61   0.108    -.0659517    .6705153
                leader2_2_BS |   .0412048   .4925027     0.08   0.933    -.9240826    1.006492
                leader2_3_BS |   -.408188   .7010994    -0.58   0.560    -1.782317    .9659415
             d_illiterate_BS |   .3191838   .4378196     0.73   0.466    -.5389269    1.177294
   participants_primary_only |  -.2755653   .1361156    -2.02   0.043    -.5423469   -.0087837
             game_lead_facil |  -.6731644   .6381557    -1.05   0.291    -1.923927    .5775979
     game_count_intervention |   .0245975   .0196801     1.25   0.211    -.0139748    .0631699
        game_optimal_inv_r10 |  -.9760816   .5686267    -1.72   0.086    -2.090569    .1384062
         communication_rules |  -.0195581   .0326359    -0.60   0.549    -.0835233    .0444072
        game_come_back_dummy |   .9560753   .8565336     1.12   0.264    -.7226997     2.63485
             game_discussion |  -1.047488   .8942556    -1.17   0.241    -2.800197    .7052203
                       _cons |   .2620275   2.997375     0.09   0.930     -5.61272    6.136775
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, method(fwd)
option method() not allowed
r(198);

end of do-file

r(198);

. help stepwise

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, method(fwd): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
at least one of pr(#) and pe(#) must be specified
r(198);

end of do-file

r(198);

. help stepwise

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(0.1): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9333 >= 0.1000  removing leader2_2_BS
p = 0.7638 >= 0.1000  removing No_HH
p = 0.5802 >= 0.1000  removing communication_rules
p = 0.4679 >= 0.1000  removing leader2_3_BS
p = 0.4807 >= 0.1000  removing d_illiterate_BS
p = 0.3909 >= 0.1000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.1000  removing FES_site
p = 0.2930 >= 0.1000  removing game_count_intervention
p = 0.2635 >= 0.1000  removing game_discussion
p = 0.2195 >= 0.1000  removing Shar_SCST
p = 0.2596 >= 0.1000  removing game_come_back_dummy
p = 0.1676 >= 0.1000  removing game_optimal_inv_r10
p = 0.2141 >= 0.1000  removing participants_primary_only
p = 0.2331 >= 0.1000  removing share_female_percent3_BS
p = 0.2162 >= 0.1000  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise,  pe(0.1): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with empty model
p = 0.0709 <  0.1000  adding  game_lead_facil
p = 0.0445 <  0.1000  adding  Shar_Lit

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise,  pr(0.1) pe(0.1) hierarchical : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
hierarchical pe(#) pr(#) invalid
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise,  pr(0.1) pe(0.1)  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
pr(.1) <= pe(.1) invalid
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise,  pr(0.2) pe(0.1)  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9333 >= 0.2000  removing leader2_2_BS
p = 0.7638 >= 0.2000  removing No_HH
p = 0.5802 >= 0.2000  removing communication_rules
p = 0.4679 >= 0.2000  removing leader2_3_BS
p = 0.4807 >= 0.2000  removing d_illiterate_BS
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise,  pr(0.2) pe(0.1)  : probit survey_maint_2017_FS  $control $participants $game, robust
                      begin with full model
p = 0.8516 >= 0.2000  removing No_HH
p = 0.7712 >= 0.2000  removing leader2_2_BS
p = 0.6800 >= 0.2000  removing communication_rules
p = 0.5779 >= 0.2000  removing leader2_3_BS
p = 0.3527 >= 0.2000  removing game_lead_facil
p = 0.4141 >= 0.2000  removing d_illiterate_BS
p = 0.3194 >= 0.2000  removing game_come_back_dummy
p = 0.3238 >= 0.2000  removing Shar_SCST
p = 0.3984 >= 0.2000  removing share_female_percent3_BS
p = 0.2744 >= 0.2000  removing survey_dam_for_irrigation_FS

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.58
                                                Prob > chi2       =     0.0348
Log pseudolikelihood = -26.340623               Pseudo R2         =     0.2057

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          game_discussion |  -1.175206   .7312157    -1.61   0.108    -2.608362    .2579506
                 FES_site |   .6420798   .4550914     1.41   0.158     -.249883    1.534043
                 Shar_Lit |     .04848   .0261789     1.85   0.064    -.0028296    .0997896
  game_count_intervention |   .0370452   .0156089     2.37   0.018     .0064524    .0676381
participants_primary_only |  -.2236659   .1059711    -2.11   0.035    -.4313655   -.0159663
     game_optimal_inv_r10 |  -.7566356   .5041958    -1.50   0.133    -1.744841    .2315699
                    _cons |  -.7341182   1.764499    -0.42   0.677    -4.192472    2.724236
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(0.2) hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.2415 >= 0.2000  removing game_discussion
p = 0.3088 >= 0.2000  removing game_come_back_dummy
p = 0.6395 >= 0.2000  removing communication_rules
p = 0.2231 >= 0.2000  removing game_optimal_inv_r10
p = 0.1217 <  0.2000  keeping  game_count_intervention

Probit regression                               Number of obs     =         55
                                                Wald chi2(13)     =      17.56
                                                Prob > chi2       =     0.1751
Log pseudolikelihood = -24.463039               Pseudo R2         =     0.2623

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .4228136   .4648922     0.91   0.363    -.4883583    1.333986
                       No_HH |   .0001986   .0026568     0.07   0.940    -.0050087    .0054059
                    FES_site |   .3873843   .4737952     0.82   0.414    -.5412372    1.316006
                    Shar_Lit |   .0573242   .0273518     2.10   0.036     .0037156    .1109328
                   Shar_SCST |  -.0138156   .0145603    -0.95   0.343    -.0423533    .0147221
survey_dam_for_irrigation_FS |   .3503802   .4462414     0.79   0.432     -.524237    1.224997
    share_female_percent3_BS |    .268174   .1972233     1.36   0.174    -.1183765    .6547246
                leader2_2_BS |   .0183649   .4953118     0.04   0.970    -.9524284    .9891582
                leader2_3_BS |  -.5368131   .6341762    -0.85   0.397    -1.779776    .7061493
             d_illiterate_BS |   .8320544   .4549915     1.83   0.067    -.0597126    1.723821
   participants_primary_only |  -.1290871   .1032295    -1.25   0.211    -.3314132     .073239
             game_lead_facil |  -.9056397   .6293915    -1.44   0.150    -2.139224    .3279448
     game_count_intervention |   .0319246   .0206256     1.55   0.122    -.0085009    .0723501
                       _cons |   -2.12282   2.307625    -0.92   0.358    -6.645683    2.400042
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(0.1) hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.2415 >= 0.1000  removing game_discussion
p = 0.3088 >= 0.1000  removing game_come_back_dummy
p = 0.6395 >= 0.1000  removing communication_rules
p = 0.2231 >= 0.1000  removing game_optimal_inv_r10
p = 0.1217 >= 0.1000  removing game_count_intervention
p = 0.0530 <  0.1000  keeping  game_lead_facil

Probit regression                               Number of obs     =         55
                                                Wald chi2(12)     =      16.07
                                                Prob > chi2       =     0.1879
Log pseudolikelihood =  -25.62799               Pseudo R2         =     0.2272

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .5262746   .4332606     1.21   0.224    -.3229006     1.37545
                       No_HH |   .0009223   .0026641     0.35   0.729    -.0042993    .0061439
                    FES_site |   .4403481   .4682498     0.94   0.347    -.4774046    1.358101
                    Shar_Lit |   .0449267   .0245625     1.83   0.067    -.0032149    .0930682
                   Shar_SCST |  -.0126112   .0153704    -0.82   0.412    -.0427366    .0175142
survey_dam_for_irrigation_FS |   .1520318   .4014616     0.38   0.705    -.6348184    .9388821
    share_female_percent3_BS |   .3236337   .1895291     1.71   0.088    -.0478366     .695104
                leader2_2_BS |  -.0035025    .494103    -0.01   0.994    -.9719265    .9649215
                leader2_3_BS |  -.4325905   .5713832    -0.76   0.449    -1.552481       .6873
             d_illiterate_BS |   .6333736   .4146902     1.53   0.127    -.1794042    1.446151
   participants_primary_only |  -.0925675   .0933584    -0.99   0.321    -.2755465    .0904115
             game_lead_facil |  -1.135944   .5870603    -1.93   0.053    -2.286561    .0146731
                       _cons |  -1.303953   2.268534    -0.57   0.565    -5.750198    3.142291
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso: probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
probit not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
option robust not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, vce(robust)
option vce() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,  heteroskedastic  
option heteroskedastic not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.266074
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.280465
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.29534
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.311433
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0499     1.266074
       2 |    lambda after     .177253         1      -0.0618     1.280465
       4 |     last lambda    .1471585         3      -0.0875     1.311433
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.254376
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.270351
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.288522
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.309829
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0402     1.254376
       2 |    lambda after     .177253         1      -0.0534     1.270351
       4 |     last lambda    .1471585         3      -0.0862     1.309829
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. estimates

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------------------------------------------------------------------------------------------

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0402     1.254376
       2 |    lambda after     .177253         1      -0.0534     1.270351
       4 |     last lambda    .1471585         3      -0.0862     1.309829
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

.  estat summarize   

  Estimation sample lasso                  Number of obs =         55

  -------------------------------------------------------------------
      Variable |         Mean      Std. Dev.         Min          Max
  -------------+-----------------------------------------------------
  survey_~7_FS |     .7090909      .4583678            0            1
  -------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.246032
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.255651
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.263112
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.278884
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0333     1.246032
       2 |    lambda after     .177253         1      -0.0412     1.255651
       4 |     last lambda    .1471585         3      -0.0605     1.278884
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. lassocoef   

------------------------
             |  active  
-------------+----------
       _cons |     x    
------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted
  x - estimated

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.232745
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.241107
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.254912
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.274862
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0222     1.232745
       2 |    lambda after     .177253         1      -0.0292     1.241107
       4 |     last lambda    .1471585         3      -0.0572     1.274862
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. lassocoef

------------------------
             |  active  
-------------+----------
       _cons |     x    
------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted
  x - estimated

. lassogof

Penalized coefficients
------------------------------------
                 Deviance
    Deviance        ratio        Obs
------------------------------------
    1.323952      -0.0157         84
------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. splitsample, generate(sample) nsplit(2)

. 
end of do-file

. tab sample

     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         42       50.00       50.00
          2 |         42       50.00      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. splitsample, generate(sample) nsplit(2) rseed(1234)
variable sample already defined
r(110);

end of do-file

r(110);

.  do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game if sample==1,
note: game_come_back_dummy dropped because it is constant in C.V. subsamples
10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .2059369   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.395361
Grid value 2:     lambda =  .187642   no. of nonzero coef. =       2
Folds: 1...5....10   CVF = 1.478791
Grid value 3:     lambda = .1709724   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.560954
Grid value 4:     lambda = .1557837   no. of nonzero coef. =       4
Folds: 1...5....10   CVF = 1.64686
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         25
                                            No. of covariates =         16
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .2059369         0      -0.1766     1.395361
       2 |    lambda after     .187642         2      -0.2470     1.478791
       4 |     last lambda    .1557837         4      -0.3887      1.64686
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. 
end of do-file

. cvplot
(note:  named style medthin not found in class linestyle, default attributes used)

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, selection(bic)
invalid selection() specification
    only one of cv, adaptive, none, or plugin can be specified
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, selection(adaptive)

Lasso step 1 of 2:

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.227679
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.226411
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.235367
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.247462
Grid value 5:     lambda = .1340854   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.265905
... cross-validation complete ... minimum found

Lasso step 2 of 2:

Evaluating up to 100 lambdas in grid ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       1
Grid value 5:     lambda = .1340854   no. of nonzero coef. =       1
Grid value 6:     lambda = .1221736   no. of nonzero coef. =       1
Grid value 7:     lambda =   .11132   no. of nonzero coef. =       1
Grid value 8:     lambda = .1014307   no. of nonzero coef. =       1
Grid value 9:     lambda = .0924198   no. of nonzero coef. =       1
Grid value 10:    lambda = .0842095   no. of nonzero coef. =       1
Grid value 11:    lambda = .0767286   no. of nonzero coef. =       1
Grid value 12:    lambda = .0699122   no. of nonzero coef. =       1
Grid value 13:    lambda = .0637014   no. of nonzero coef. =       1
Grid value 14:    lambda = .0580424   no. of nonzero coef. =       1
Grid value 15:    lambda =  .052886   no. of nonzero coef. =       1
Grid value 16:    lambda = .0481878   no. of nonzero coef. =       1
Grid value 17:    lambda = .0439069   no. of nonzero coef. =       1
Grid value 18:    lambda = .0400063   no. of nonzero coef. =       1
Grid value 19:    lambda = .0364523   no. of nonzero coef. =       1
Grid value 20:    lambda =  .033214   no. of nonzero coef. =       1
Grid value 21:    lambda = .0302633   no. of nonzero coef. =       1
Grid value 22:    lambda = .0275748   no. of nonzero coef. =       1
Grid value 23:    lambda = .0251252   no. of nonzero coef. =       1
Grid value 24:    lambda = .0228931   no. of nonzero coef. =       1
Grid value 25:    lambda = .0208593   no. of nonzero coef. =       1
Grid value 26:    lambda = .0190063   no. of nonzero coef. =       1
Grid value 27:    lambda = .0173178   no. of nonzero coef. =       1
Grid value 28:    lambda = .0157793   no. of nonzero coef. =       1
Grid value 29:    lambda = .0143775   no. of nonzero coef. =       1
Grid value 30:    lambda = .0131003   no. of nonzero coef. =       1
Grid value 31:    lambda = .0119365   no. of nonzero coef. =       1
Grid value 32:    lambda = .0108761   no. of nonzero coef. =       1
Grid value 33:    lambda = .0099099   no. of nonzero coef. =       1
Grid value 34:    lambda = .0090295   no. of nonzero coef. =       1
Grid value 35:    lambda = .0082274   no. of nonzero coef. =       1
Grid value 36:    lambda = .0074965   no. of nonzero coef. =       1
Grid value 37:    lambda = .0068305   no. of nonzero coef. =       1
Grid value 38:    lambda = .0062237   no. of nonzero coef. =       1
Grid value 39:    lambda = .0056708   no. of nonzero coef. =       1
Grid value 40:    lambda =  .005167   no. of nonzero coef. =       1
Grid value 41:    lambda =  .004708   no. of nonzero coef. =       1
Grid value 42:    lambda = .0042897   no. of nonzero coef. =       1
Grid value 43:    lambda = .0039087   no. of nonzero coef. =       1
Grid value 44:    lambda = .0035614   no. of nonzero coef. =       1
Grid value 45:    lambda =  .003245   no. of nonzero coef. =       1
Grid value 46:    lambda = .0029568   no. of nonzero coef. =       1
Grid value 47:    lambda = .0026941   no. of nonzero coef. =       1
Grid value 48:    lambda = .0024548   no. of nonzero coef. =       1
Grid value 49:    lambda = .0022367   no. of nonzero coef. =       1
Grid value 50:    lambda =  .002038   no. of nonzero coef. =       1
Grid value 51:    lambda = .0018569   no. of nonzero coef. =       1
Grid value 52:    lambda =  .001692   no. of nonzero coef. =       1
Grid value 53:    lambda = .0015417   no. of nonzero coef. =       1
Grid value 54:    lambda = .0014047   no. of nonzero coef. =       1
Grid value 55:    lambda = .0012799   no. of nonzero coef. =       1
... change in deviance stopping tolerance reached

10-fold cross-validation with 55 lambdas ...
Fold  1 of 10:  10....20....30....40....50..
Fold  2 of 10:  10....20....30....40....50..
Fold  3 of 10:  10....20....30....40....50..
Fold  4 of 10:  10....20....30....40....50..
Fold  5 of 10:  10....20....30....40....50..
Fold  6 of 10:  10....20....30....40....50..
Fold  7 of 10:  10....20....30....40....50..
Fold  8 of 10:  10....20....30....40....50..
Fold  9 of 10:  10....20....30....40....50..
Fold 10 of 10:  10....20....30....40....50..
... cross-validation complete

Lasso probit model                         No. of obs         =         55
                                           No. of covariates  =         17
Selection: Adaptive                        No. of lasso steps =          2

Final adaptive step results
--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
       6 |    first lambda    .1945349         0      -0.0180     1.227576
      59 |   lambda before    .0014047         1       0.0163     1.186301
    * 60 | selected lambda    .0012799         1       0.0163       1.1863
--------------------------------------------------------------------------
* lambda selected by cross-validation in final adaptive step.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, selection(cv)

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.227679
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.226411
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.235367
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.247462
Grid value 5:     lambda = .1340854   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.265905
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
       1 |    first lambda    .1945349         0      -0.0180     1.227679
     * 2 | selected lambda     .177253         1      -0.0170     1.226411
       3 |    lambda after    .1615063         1      -0.0244     1.235367
       5 |     last lambda    .1340854         3      -0.0497     1.265905
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lassocoef

---------------------------
                |  active  
----------------+----------
game_lead_facil |     x    
          _cons |     x    
---------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted
  x - estimated

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lassogof

Penalized coefficients
------------------------------------
                 Deviance
    Deviance        ratio        Obs
------------------------------------
    1.186255       0.0086         56
------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lassogof, over(sample) postselection

Postselection coefficients
-------------------------------------------------
            |                 Deviance
     sample |    Deviance        ratio        Obs
------------+------------------------------------
          1 |    1.299367      -0.0957         25
          2 |    1.001118       0.1691         31
-------------------------------------------------

.  
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, alpha(0.1) cv(10)
option alphas(0.1)   cv(10) not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, alpha(0.5) cv(5)
option alphas(0.5)   cv(5) not allowed
r(198);

end of do-file

r(198);

. help lasso

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game,  cvtolerance(5)

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.240864
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.254551
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.272926
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.297212
Grid value 5:     lambda = .1340854   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.320511
Grid value 6:     lambda = .1221736   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.348593
Grid value 7:     lambda =   .11132   no. of nonzero coef. =       5
Folds: 1...5....10   CVF = 1.379978
Grid value 8:     lambda = .1014307   no. of nonzero coef. =       5
Folds: 1...5....10   CVF = 1.412919
Grid value 9:     lambda = .0924198   no. of nonzero coef. =       5
Folds: 1...5....10   CVF = 1.447531
Grid value 10:    lambda = .0842095   no. of nonzero coef. =       9
Folds: 1...5....10   CVF = 1.484177
Grid value 11:    lambda = .0767286   no. of nonzero coef. =      11
Folds: 1...5....10   CVF = 1.519931
Grid value 12:    lambda = .0699122   no. of nonzero coef. =      12
Folds: 1...5....10   CVF = 1.551637
Grid value 13:    lambda = .0637014   no. of nonzero coef. =      12
Folds: 1...5....10   CVF = 1.580527
Grid value 14:    lambda = .0580424   no. of nonzero coef. =      12
Folds: 1...5....10   CVF = 1.612805
Grid value 15:    lambda =  .052886   no. of nonzero coef. =      12
Folds: 1...5....10   CVF = 1.645138
Grid value 16:    lambda = .0481878   no. of nonzero coef. =      13
Folds: 1...5....10   CVF = 1.674543
Grid value 17:    lambda = .0439069   no. of nonzero coef. =      14
Folds: 1...5....10   CVF = 1.705298
Grid value 18:    lambda = .0400063   no. of nonzero coef. =      15
Folds: 1...5....10   CVF = 1.736955
Grid value 19:    lambda = .0364523   no. of nonzero coef. =      15
Folds: 1...5....10   CVF = 1.770239
Grid value 20:    lambda =  .033214   no. of nonzero coef. =      15
Folds: 1...5....10   CVF = 1.802896
Grid value 21:    lambda = .0302633   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 1.835067
Grid value 22:    lambda = .0275748   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 1.865849
Grid value 23:    lambda = .0251252   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 1.900866
Grid value 24:    lambda = .0228931   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 1.935947
Grid value 25:    lambda = .0208593   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 1.971429
Grid value 26:    lambda = .0190063   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 2.008899
Grid value 27:    lambda = .0173178   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 2.050379
Grid value 28:    lambda = .0157793   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 2.093782
Grid value 29:    lambda = .0143775   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 2.138047
Grid value 30:    lambda = .0131003   no. of nonzero coef. =      16
Folds: 1...5....10   CVF = 2.182014
Grid value 31:    lambda = .0119365   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.225835
Grid value 32:    lambda = .0108761   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.270719
Grid value 33:    lambda = .0099099   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.316351
Grid value 34:    lambda = .0090295   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.36504
Grid value 35:    lambda = .0082274   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.415321
Grid value 36:    lambda = .0074965   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.466363
Grid value 37:    lambda = .0068305   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.517488
Grid value 38:    lambda = .0062237   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.568004
Grid value 39:    lambda = .0056708   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.618332
Grid value 40:    lambda =  .005167   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.669292
Grid value 41:    lambda =  .004708   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.719711
Grid value 42:    lambda = .0042897   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.769159
Grid value 43:    lambda = .0039087   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.817527
Grid value 44:    lambda = .0035614   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.864785
Grid value 45:    lambda =  .003245   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.910381
Grid value 46:    lambda = .0029568   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.95417
Grid value 47:    lambda = .0026941   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 2.996047
Grid value 48:    lambda = .0024548   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.035941
Grid value 49:    lambda = .0022367   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.073809
Grid value 50:    lambda =  .002038   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.110841
Grid value 51:    lambda = .0018569   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.146546
Grid value 52:    lambda =  .001692   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.180082
Grid value 53:    lambda = .0015417   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.211507
Grid value 54:    lambda = .0014047   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.240945
Grid value 55:    lambda = .0012799   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.268459
Grid value 56:    lambda = .0011662   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.294123
Grid value 57:    lambda = .0010626   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.318016
Grid value 58:    lambda = .0009682   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.34022
Grid value 59:    lambda = .0008822   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.360825
Grid value 60:    lambda = .0008038   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.379927
Grid value 61:    lambda = .0007324   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.397599
Grid value 62:    lambda = .0006673   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.413928
Grid value 63:    lambda = .0006081   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.428998
Grid value 64:    lambda =  .000554   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.442892
Grid value 65:    lambda = .0005048   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.455688
Grid value 66:    lambda =   .00046   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.467463
Grid value 67:    lambda = .0004191   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.478288
Grid value 68:    lambda = .0003819   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.488234
Grid value 69:    lambda =  .000348   no. of nonzero coef. =      17
Folds: 1...5....10   CVF = 3.497364
... change in deviance stopping tolerance reached ... last lambda selected

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0290     1.240864
       2 |    lambda after     .177253         1      -0.0403     1.254551
      69 |     last lambda     .000348        17      -1.9001     3.497364
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. lassocoef

------------------------
             |  active  
-------------+----------
       _cons |     x    
------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted
  x - estimated

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. lasso probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, 

10-fold cross-validation with 100 lambdas ...
Grid value 1:     lambda = .1945349   no. of nonzero coef. =       0
Folds: 1...5....10   CVF = 1.31951
Grid value 2:     lambda =  .177253   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.329557
Grid value 3:     lambda = .1615063   no. of nonzero coef. =       1
Folds: 1...5....10   CVF = 1.342151
Grid value 4:     lambda = .1471585   no. of nonzero coef. =       3
Folds: 1...5....10   CVF = 1.358808
... cross-validation complete ... minimum found

Lasso probit model                          No. of obs        =         55
                                            No. of covariates =         17
Selection: Cross-validation                 No. of CV folds   =         10

--------------------------------------------------------------------------
         |                                No. of      Out-of-
         |                               nonzero       sample      CV mean
      ID |     Description      lambda     coef.   dev. ratio     deviance
---------+----------------------------------------------------------------
     * 1 | selected lambda    .1945349         0      -0.0942      1.31951
       2 |    lambda after     .177253         1      -0.1025     1.329557
       4 |     last lambda    .1471585         3      -0.1268     1.358808
--------------------------------------------------------------------------
* lambda selected by cross-validation.

. lassocoef

------------------------
             |  active  
-------------+----------
       _cons |     x    
------------------------
Legend:
  b - base level
  e - empty cell
  o - omitted
  x - estimated

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. 
. stepwise, pr(0.1) hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.2415 >= 0.1000  removing game_discussion
p = 0.3088 >= 0.1000  removing game_come_back_dummy
p = 0.6395 >= 0.1000  removing communication_rules
p = 0.2231 >= 0.1000  removing game_optimal_inv_r10
p = 0.1217 >= 0.1000  removing game_count_intervention
p = 0.0530 <  0.1000  keeping  game_lead_facil

Probit regression                               Number of obs     =         55
                                                Wald chi2(12)     =      16.07
                                                Prob > chi2       =     0.1879
Log pseudolikelihood =  -25.62799               Pseudo R2         =     0.2272

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .5262746   .4332606     1.21   0.224    -.3229006     1.37545
                       No_HH |   .0009223   .0026641     0.35   0.729    -.0042993    .0061439
                    FES_site |   .4403481   .4682498     0.94   0.347    -.4774046    1.358101
                    Shar_Lit |   .0449267   .0245625     1.83   0.067    -.0032149    .0930682
                   Shar_SCST |  -.0126112   .0153704    -0.82   0.412    -.0427366    .0175142
survey_dam_for_irrigation_FS |   .1520318   .4014616     0.38   0.705    -.6348184    .9388821
    share_female_percent3_BS |   .3236337   .1895291     1.71   0.088    -.0478366     .695104
                leader2_2_BS |  -.0035025    .494103    -0.01   0.994    -.9719265    .9649215
                leader2_3_BS |  -.4325905   .5713832    -0.76   0.449    -1.552481       .6873
             d_illiterate_BS |   .6333736   .4146902     1.53   0.127    -.1794042    1.446151
   participants_primary_only |  -.0925675   .0933584    -0.99   0.321    -.2755465    .0904115
             game_lead_facil |  -1.135944   .5870603    -1.93   0.053    -2.286561    .0146731
                       _cons |  -1.303953   2.268534    -0.57   0.565    -5.750198    3.142291
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(0.05) hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.2415 >= 0.0500  removing game_discussion
p = 0.3088 >= 0.0500  removing game_come_back_dummy
p = 0.6395 >= 0.0500  removing communication_rules
p = 0.2231 >= 0.0500  removing game_optimal_inv_r10
p = 0.1217 >= 0.0500  removing game_count_intervention
p = 0.0530 >= 0.0500  removing game_lead_facil
p = 0.4989 >= 0.0500  removing participants_primary_only
p = 0.1667 >= 0.0500  removing d_illiterate_BS
p = 0.6367 >= 0.0500  removing leader2_3_BS
p = 0.4331 >= 0.0500  removing leader2_2_BS
p = 0.1062 >= 0.0500  removing share_female_percent3_BS
p = 0.3926 >= 0.0500  removing survey_dam_for_irrigation_FS
p = 0.5093 >= 0.0500  removing Shar_SCST
p = 0.1754 >= 0.0500  removing Shar_Lit
p = 0.2187 >= 0.0500  removing FES_site
p = 0.8368 >= 0.0500  removing No_HH
p = 0.3090 >= 0.0500  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(0)      =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -33.163001               Pseudo R2         =     0.0000

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               _cons |   .5507309   .1802953     3.05   0.002     .1973586    .9041032
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
at least one of pr(#) and pe(#) must be specified
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.1) hierarchical  : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.2415 >= 0.1000  removing game_discussion
p = 0.3088 >= 0.1000  removing game_come_back_dummy
p = 0.6395 >= 0.1000  removing communication_rules
p = 0.2231 >= 0.1000  removing game_optimal_inv_r10
p = 0.1217 >= 0.1000  removing game_count_intervention
p = 0.0530 <  0.1000  keeping  game_lead_facil

Probit regression                               Number of obs     =         55
                                                Wald chi2(12)     =      16.07
                                                Prob > chi2       =     0.1879
Log pseudolikelihood =  -25.62799               Pseudo R2         =     0.2272

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .5262746   .4332606     1.21   0.224    -.3229006     1.37545
                       No_HH |   .0009223   .0026641     0.35   0.729    -.0042993    .0061439
                    FES_site |   .4403481   .4682498     0.94   0.347    -.4774046    1.358101
                    Shar_Lit |   .0449267   .0245625     1.83   0.067    -.0032149    .0930682
                   Shar_SCST |  -.0126112   .0153704    -0.82   0.412    -.0427366    .0175142
survey_dam_for_irrigation_FS |   .1520318   .4014616     0.38   0.705    -.6348184    .9388821
    share_female_percent3_BS |   .3236337   .1895291     1.71   0.088    -.0478366     .695104
                leader2_2_BS |  -.0035025    .494103    -0.01   0.994    -.9719265    .9649215
                leader2_3_BS |  -.4325905   .5713832    -0.76   0.449    -1.552481       .6873
             d_illiterate_BS |   .6333736   .4146902     1.53   0.127    -.1794042    1.446151
   participants_primary_only |  -.0925675   .0933584    -0.99   0.321    -.2755465    .0904115
             game_lead_facil |  -1.135944   .5870603    -1.93   0.053    -2.286561    .0146731
                       _cons |  -1.303953   2.268534    -0.57   0.565    -5.750198    3.142291
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.1) : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9333 >= 0.1000  removing leader2_2_BS
p = 0.7638 >= 0.1000  removing No_HH
p = 0.5802 >= 0.1000  removing communication_rules
p = 0.4679 >= 0.1000  removing leader2_3_BS
p = 0.4807 >= 0.1000  removing d_illiterate_BS
p = 0.3909 >= 0.1000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.1000  removing FES_site
p = 0.2930 >= 0.1000  removing game_count_intervention
p = 0.2635 >= 0.1000  removing game_discussion
p = 0.2195 >= 0.1000  removing Shar_SCST
p = 0.2596 >= 0.1000  removing game_come_back_dummy
p = 0.1676 >= 0.1000  removing game_optimal_inv_r10
p = 0.2141 >= 0.1000  removing participants_primary_only
p = 0.2331 >= 0.1000  removing share_female_percent3_BS
p = 0.2162 >= 0.1000  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.2) : probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9333 >= 0.2000  removing leader2_2_BS
p = 0.7638 >= 0.2000  removing No_HH
p = 0.5802 >= 0.2000  removing communication_rules
p = 0.4679 >= 0.2000  removing leader2_3_BS
p = 0.4807 >= 0.2000  removing d_illiterate_BS
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. tab participants_primary_only

participant |
s_primary_o |
        nly |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         28       33.33       33.33
          4 |          3        3.57       36.90
          5 |          5        5.95       42.86
          6 |          3        3.57       46.43
          7 |         11       13.10       59.52
          8 |         10       11.90       71.43
          9 |          7        8.33       79.76
         10 |          6        7.14       86.90
         11 |          5        5.95       92.86
         12 |          3        3.57       96.43
         13 |          3        3.57      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. gen share_participants_primary = participants_primary_only/14

. 
end of do-file

. tab game_share_illit_vill

 Illiterate |
participans |
       (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       58.93       58.93
   .0714286 |         14       25.00       83.93
   .1428571 |          6       10.71       94.64
   .2142857 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. tab share_female_percent2_BS

          0 |
share_femal |
e_percent2_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
   7.142858 |          5        8.93       21.43
   14.28572 |          8       14.29       35.71
   21.42857 |         11       19.64       55.36
   28.57143 |          7       12.50       67.86
   35.71429 |         10       17.86       85.71
   42.85714 |          4        7.14       92.86
         50 |          2        3.57       96.43
   64.28571 |          1        1.79       98.21
   92.85714 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *drop variables with all missings
. dropmiss
(game_av_inv_vill_R6_10 survey_CWRgroup_already_FS survey_CWRgroup_new_FS survey_activity_any_FS survey_activity_earthwall_BS survey_activity_earthwall_FS
survey_activity_mainwall_BS survey_activity_mainwall_FS survey_activity_silt_BS survey_activity_silt_FS survey_activity_sluicegate_BS survey_activity_sluicegate_FS
survey_activity_vege_BS survey_activity_vege_FS survey_benefit_agri_BS survey_change_benefit_FS survey_collact_new_FS survey_compay_community_FS
survey_compay_equal_FS survey_compay_leader_FS survey_compay_otheruser_FS survey_cwr_bori_FS survey_cwr_dam_FS survey_cwr_other_FS survey_cwr_pond_FS
survey_indipay_comm_FS survey_indipay_equally_FS survey_indipay_other_FS survey_indipayn_notspent_FS survey_interview_others_BS survey_interview_others_FS
survey_interview_waterua_BS survey_interview_waterua_FS survey_rules_alloc_BS survey_rules_alloc_FS survey_rules_extr_alloc_BS survey_rules_extr_alloc_FS
survey_rules_extr_opre_BS survey_rules_extr_opre_FS survey_rules_extr_other_BS survey_rules_extr_other_FS survey_rules_old_all_BS survey_rules_old_alloc_BS
survey_rules_old_maint_BS survey_rules_old_oper_BS survey_rules_old_other_BS survey_rules_oper_BS survey_rules_oper_FS survey_rules_other_BS survey_rules_other_FS
dropped)

. *----------------------------------------------------------------------
. 
. alpha game_propose_rule game_agree_rule game_reject_rule, gen(communication_rules)

Test scale = mean(unstandardized items)

Average interitem covariance:     32.60909
Number of items in the scale:            3
Scale reliability coefficient:      0.5822

. alpha survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_friends_FS survey_share_exp_family_FS survey_share_exp_comm_meet_FS, gen(game_discu
> ssion)

Test scale = mean(unstandardized items)
Reversed items:  survey_share_exp_vc_meet_FS survey_share_exp_others_FS survey_share_exp_comm_meet_FS

Average interitem covariance:     .0591246
Number of items in the scale:            5
Scale reliability coefficient:      0.6929

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. egen participants_primary_only = rowtotal(game_edu_fem_prim_vill game_edu_male_prim_vill)

. gen share_participants_primary = (participants_primary_only/14)*10

. replace game_share_illit_vill = game_share_illit_vill*10
(23 real changes made)

. 
. * Setting globals
. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control if treatment == 1, vce(robust)

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.264794  
Iteration 2:   log pseudolikelihood = -30.242173  
Iteration 3:   log pseudolikelihood = -30.242171  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       4.72
                                                Prob > chi2       =     0.5801
Log pseudolikelihood = -30.242171               Pseudo R2         =     0.0973

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .2086678   .3778404     0.55   0.581    -.5318858    .9492214
                       No_HH |   .0003425   .0023272     0.15   0.883    -.0042188    .0049037
                    FES_site |   .6110363    .442816     1.38   0.168    -.2568672     1.47894
                    Shar_Lit |   .0321091   .0257749     1.25   0.213    -.0184088    .0826269
                   Shar_SCST |  -.0085564   .0112214    -0.76   0.446    -.0305499    .0134371
survey_dam_for_irrigation_FS |   .3568292    .387003     0.92   0.357    -.4016828    1.115341
                       _cons |  -1.090933   1.892781    -0.58   0.564    -4.800715     2.61885
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $participants, robust

Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood =  -31.08779  
Iteration 2:   log pseudolikelihood = -31.035063  
Iteration 3:   log pseudolikelihood = -31.034918  
Iteration 4:   log pseudolikelihood = -31.034918  

Probit regression                               Number of obs     =         56
                                                Wald chi2(6)      =       6.23
                                                Prob > chi2       =     0.3978
Log pseudolikelihood = -31.034918               Pseudo R2         =     0.0737

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .5222381   .3908347     1.34   0.181    -.2437839     1.28826
 share_female_percent3_BS |   .2510095   .1250754     2.01   0.045     .0058662    .4961528
             leader2_2_BS |  -.0150169   .4624161    -0.03   0.974    -.9213358    .8913019
             leader2_3_BS |  -.4665658   .4940931    -0.94   0.345     -1.43497    .5018389
    game_share_illit_vill |  -.0695731   .3351887    -0.21   0.836    -.7265309    .5873848
participants_primary_only |  -.1045845   .0885069    -1.18   0.237    -.2780549    .0688859
                    _cons |   .7540249   .8503909     0.89   0.375    -.9127107     2.42076
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -29.070834  
Iteration 2:   log pseudolikelihood = -29.029874  
Iteration 3:   log pseudolikelihood = -29.029843  
Iteration 4:   log pseudolikelihood = -29.029843  

Probit regression                               Number of obs     =         55
                                                Wald chi2(7)      =       8.27
                                                Prob > chi2       =     0.3098
Log pseudolikelihood = -29.029843               Pseudo R2         =     0.1246

-----------------------------------------------------------------------------------------
                        |               Robust
   survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    survey_maint_12m_BS |   .4250073   .4036134     1.05   0.292    -.3660604    1.216075
        game_lead_facil |  -.7586651   .4992644    -1.52   0.129    -1.737205    .2198752
game_count_intervention |   .0079461     .01427     0.56   0.578    -.0200226    .0359148
   game_optimal_inv_r10 |  -.3429244   .4198226    -0.82   0.414    -1.165762    .4799129
    communication_rules |  -.0395443   .0234723    -1.68   0.092    -.0855491    .0064605
   game_come_back_dummy |  -.0243904   .5742522    -0.04   0.966    -1.149904    1.101123
        game_discussion |  -.3446509   .6930917    -0.50   0.619    -1.703086    1.013784
                  _cons |   1.609086   .8463349     1.90   0.057    -.0496997    3.267872
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust

Iteration 0:   log pseudolikelihood = -33.163001  
Iteration 1:   log pseudolikelihood = -23.883991  
Iteration 2:   log pseudolikelihood = -22.815948  
Iteration 3:   log pseudolikelihood = -22.784485  
Iteration 4:   log pseudolikelihood = -22.784421  
Iteration 5:   log pseudolikelihood = -22.784421  

Probit regression                               Number of obs     =         55
                                                Wald chi2(17)     =      24.37
                                                Prob > chi2       =     0.1098
Log pseudolikelihood = -22.784421               Pseudo R2         =     0.3130

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .7651739   .5060717     1.51   0.131    -.2267084    1.757056
                       No_HH |   -.001172   .0025515    -0.46   0.646    -.0061729    .0038289
                    FES_site |   .3538648   .5091165     0.70   0.487    -.6439853    1.351715
                    Shar_Lit |    .052898   .0304455     1.74   0.082     -.006774      .11257
                   Shar_SCST |  -.0195361    .015481    -1.26   0.207    -.0498782     .010806
survey_dam_for_irrigation_FS |   .4496608   .4953943     0.91   0.364    -.5212941    1.420616
    share_female_percent3_BS |   .2979964    .177877     1.68   0.094    -.0506362    .6466289
                leader2_2_BS |   .0551454   .4973624     0.11   0.912     -.919667    1.029958
                leader2_3_BS |  -.2995009   .6549192    -0.46   0.647    -1.583119    .9841173
       game_share_illit_vill |   .0166491   .3264746     0.05   0.959    -.6232293    .6565275
   participants_primary_only |  -.2985748   .1320064    -2.26   0.024    -.5573026   -.0398469
             game_lead_facil |  -.6159979   .6267667    -0.98   0.326    -1.844438    .6124422
     game_count_intervention |   .0218571   .0196005     1.12   0.265    -.0165591    .0602733
        game_optimal_inv_r10 |  -1.107984   .5590173    -1.98   0.047    -2.203638   -.0123304
         communication_rules |  -.0236241   .0332335    -0.71   0.477    -.0887606    .0415124
        game_come_back_dummy |   1.007159   .7984511     1.26   0.207     -.557776    2.572095
             game_discussion |  -1.185827   .8789447    -1.35   0.177    -2.908527    .5368724
                       _cons |   .9477276   2.919211     0.32   0.745    -4.773822    6.669277
----------------------------------------------------------------------------------------------
Note: 0 failures and 1 success completely determined.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo det5:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         55
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : survey_maint_12m_BS game_optimal_inv_r10 participants_primary_only Shar_Lit share_female_percent3_BS game_lead_facil

-------------------------------------------------------------------------------------------
                          |            Delta-method
                          |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .2201222   .1133841     1.94   0.052    -.0021064    .4423509
     game_optimal_inv_r10 |  -.1970289   .1352318    -1.46   0.145    -.4620784    .0680205
participants_primary_only |  -.0439106   .0246667    -1.78   0.075    -.0922564    .0044353
                 Shar_Lit |   .0127562   .0067865     1.88   0.060    -.0005451    .0260575
 share_female_percent3_BS |    .067301   .0363924     1.85   0.064    -.0040267    .1386288
          game_lead_facil |  -.2733758   .1283671    -2.13   0.033    -.5249708   -.0217808
-------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .20465503

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.1): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.1000  removing game_share_illit_vill
p = 0.9097 >= 0.1000  removing leader2_2_BS
p = 0.6406 >= 0.1000  removing No_HH
p = 0.5048 >= 0.1000  removing leader2_3_BS
p = 0.5826 >= 0.1000  removing communication_rules
p = 0.3909 >= 0.1000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.1000  removing FES_site
p = 0.2930 >= 0.1000  removing game_count_intervention
p = 0.2635 >= 0.1000  removing game_discussion
p = 0.2195 >= 0.1000  removing Shar_SCST
p = 0.2596 >= 0.1000  removing game_come_back_dummy
p = 0.1676 >= 0.1000  removing game_optimal_inv_r10
p = 0.2141 >= 0.1000  removing participants_primary_only
p = 0.2331 >= 0.1000  removing share_female_percent3_BS
p = 0.2162 >= 0.1000  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.15): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.1500  removing game_share_illit_vill
p = 0.9097 >= 0.1500  removing leader2_2_BS
p = 0.6406 >= 0.1500  removing No_HH
p = 0.5048 >= 0.1500  removing leader2_3_BS
p = 0.5826 >= 0.1500  removing communication_rules
p = 0.3909 >= 0.1500  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.1500  removing FES_site
p = 0.2930 >= 0.1500  removing game_count_intervention
p = 0.2635 >= 0.1500  removing game_discussion
p = 0.2195 >= 0.1500  removing Shar_SCST
p = 0.2596 >= 0.1500  removing game_come_back_dummy
p = 0.1676 >= 0.1500  removing game_optimal_inv_r10
p = 0.2141 >= 0.1500  removing participants_primary_only
p = 0.2331 >= 0.1500  removing share_female_percent3_BS
p = 0.2162 >= 0.1500  removing survey_maint_12m_BS

Probit regression                               Number of obs     =         55
                                                Wald chi2(2)      =       7.39
                                                Prob > chi2       =     0.0249
Log pseudolikelihood =  -29.73999               Pseudo R2         =     0.1032

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            Shar_Lit |   .0450059   .0224004     2.01   0.045      .001102    .0889098
     game_lead_facil |  -1.071165    .499655    -2.14   0.032     -2.05047   -.0918588
               _cons |  -1.502328   1.138494    -1.32   0.187    -3.733735    .7290793
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. stepwise, pr(.2): probit survey_maint_2017_FS survey_maint_12m_BS $control $participants $game, robust
                      begin with full model
p = 0.9593 >= 0.2000  removing game_share_illit_vill
p = 0.9097 >= 0.2000  removing leader2_2_BS
p = 0.6406 >= 0.2000  removing No_HH
p = 0.5048 >= 0.2000  removing leader2_3_BS
p = 0.5826 >= 0.2000  removing communication_rules
p = 0.3909 >= 0.2000  removing survey_dam_for_irrigation_FS
p = 0.4467 >= 0.2000  removing FES_site
p = 0.2930 >= 0.2000  removing game_count_intervention
p = 0.2635 >= 0.2000  removing game_discussion
p = 0.2195 >= 0.2000  removing Shar_SCST
p = 0.2596 >= 0.2000  removing game_come_back_dummy

Probit regression                               Number of obs     =         55
                                                Wald chi2(6)      =      13.33
                                                Prob > chi2       =     0.0380
Log pseudolikelihood = -26.376026               Pseudo R2         =     0.2047

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      survey_maint_12m_BS |   .8211779   .4542732     1.81   0.071    -.0691811    1.711537
     game_optimal_inv_r10 |  -.7350271   .5326724    -1.38   0.168    -1.779046    .3089916
participants_primary_only |  -.1638108   .0971612    -1.69   0.092    -.3542432    .0266216
                 Shar_Lit |   .0475878    .025789     1.85   0.065    -.0029577    .0981332
 share_female_percent3_BS |   .2510701   .1394369     1.80   0.072    -.0222213    .5243614
          game_lead_facil |  -1.019843   .5168308    -1.97   0.048    -2.032813   -.0068735
                    _cons |  -.7260984   1.785809    -0.41   0.684    -4.226219    2.774023
-------------------------------------------------------------------------------------------

. 
end of do-file

. help stepwise

. help dsregress

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS survey_maint_12m_BS controls($control $participants $game)
option controls() required
r(198);

end of do-file

r(198);

. help dslogit

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  controls(survey_maint_12m_BS $control $participants $game)
option controls() required
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS ,  controls(survey_maint_12m_BS $control $participants $game)
varsofinterest required
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS share_female_percent3_BS,  controls(survey_maint_12m_BS $control $participants $game)
share_female_percent3_BS cannot be specified both in varsofinterest and controls
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS $participants,  controls(survey_maint_12m_BS $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin
Estimating lasso for leader2_2_BS using plugin
Estimating lasso for leader2_3_BS using plugin
Estimating lasso for game_share_illit_vill using plugin
Estimating lasso for participants_primary_only using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         12
                                      Number of selected controls =          2
                                      Wald chi2(5)                =       3.88
                                      Prob > chi2                 =     0.5664

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
 share_female_percent3_BS |   1.248561   .2979568     0.93   0.352     .7821302    1.993153
             leader2_2_BS |   1.158015    .895398     0.19   0.850     .2544192    5.270824
             leader2_3_BS |   .5209909   .4791781    -0.71   0.478       .08589    3.160221
    game_share_illit_vill |   1.234468   .7480149     0.35   0.728      .376445    4.048162
participants_primary_only |   .8489167    .130869    -1.06   0.288     .6275435    1.148382
-------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. local r2_p= e(r2_p)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. eststo det4:  margins, dydx(*) post
command margins not appropriate after dslogit
r(322);

end of do-file

r(322);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS survey_maint_12m_BS share_female_percent3_BS,  controls(leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for survey_maint_12m_BS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         14
                                      Number of selected controls =          1
                                      Wald chi2(2)                =       4.34
                                      Prob > chi2                 =     0.1144

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
     survey_maint_12m_BS |   1.993441   1.226271     1.12   0.262     .5970137     6.65614
share_female_percent3_BS |   1.399367     .27641     1.70   0.089     .9501629    2.060939
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       0.97
                                      Prob > chi2                 =     0.3254

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    1.23461   .2645662     0.98   0.325     .8111941    1.879035
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. lassoinfo

                  Estimate:  active
                   Command:  dslogit
--------------------------------------------------------------------
                          |                                   No. of
                          |           Selection             selected
                 Variable |    Model     method    lambda  variables
--------------------------+-----------------------------------------
     survey_maint_2017_FS |    logit     plugin  .2460516          0
 share_female_percent3_BS |   linear     plugin  .4664071          2
--------------------------------------------------------------------

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dsregress survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection linear model         Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       1.01
                                      Prob > chi2                 =     0.3143

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    .035134   .0349193     1.01   0.314    -.0333066    .1035746
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       0.97
                                      Prob > chi2                 =     0.3254

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    1.23461   .2645662     0.98   0.325     .8111941    1.879035
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       0.97
                                      Prob > chi2                 =     0.3254

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    1.23461   .2645662     0.98   0.325     .8111941    1.879035
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. eststo det4:  margins, dydx(*) post
command margins not appropriate after dslogit
r(322);

end of do-file

r(322);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dsregress survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection linear model         Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       1.01
                                      Prob > chi2                 =     0.3143

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    .035134   .0349193     1.01   0.314    -.0333066    .1035746
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. local r2_p= e(r2_p)

. eststo det4:  margins, dydx(*) post
command margins not appropriate after dsregress
r(322);

end of do-file

r(322);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global control                  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

. global participants             share_female_percent3_BS leader2_2_BS leader2_3_BS game_share_illit_vill participants_primary_only

. global participants2    share_female_percent2_BS leader2_2_BS leader2_3_BS game_share_illit_vill share_participants_primary

. global game                     game_lead_facil game_count_intervention game_optimal_inv_r10 communication_rules game_come_back_dummy game_discussion

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for share_female_percent3_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       0.97
                                      Prob > chi2                 =     0.3254

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    1.23461   .2645662     0.98   0.325     .8111941    1.879035
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) ) selectio
> n(cv) rseed(1228)
option selection(cv) ) ) rseed(1228) not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) selection(
> cv) rseed(1228)

Estimating lasso for survey_maint_2017_FS using cv
Estimating lasso for share_female_percent3_BS using cv

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          4
                                      Wald chi2(1)                =       1.08
                                      Prob > chi2                 =     0.2977

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |   1.329679    .363841     1.04   0.298     .7777357    2.273326
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(cv), stop(0)) rseed(1228)
invalid 'stop' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(cv), stop(0) rseed(1228))
invalid 'stop' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. *stepwise backward selection
. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(cv)) rseed(1228)

Estimating lasso for survey_maint_2017_FS using cv
Estimating lasso for share_female_percent3_BS using cv

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          4
                                      Wald chi2(1)                =       1.08
                                      Prob > chi2                 =     0.2977

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |   1.329679    .363841     1.04   0.298     .7777357    2.273326
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(cv, alllambdas)) rseed(1228)

Estimating lasso for survey_maint_2017_FS using cv
Estimating lasso for share_female_percent3_BS using cv

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          4
                                      Wald chi2(1)                =       1.08
                                      Prob > chi2                 =     0.2977

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |   1.329679    .363841     1.04   0.298     .7777357    2.273326
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(bic, alllambdas)) rseed(1228)
must specify one of selection(cv), selection(adaptive), or selection(plugin) in lasso()
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  share_female_percent3_BS,  controls(survey_maint_12m_BS leader2_2_BS leader2_3_BS game_share_illit_vill  $control $game) lasso(*, s
> election(adaptive)) rseed(1228)

Estimating lasso for survey_maint_2017_FS using adaptive
Estimating lasso for share_female_percent3_BS using adaptive

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         15
                                      Number of selected controls =          2
                                      Wald chi2(1)                =       0.97
                                      Prob > chi2                 =     0.3254

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
share_female_percent3_BS |    1.23461   .2645662     0.98   0.325     .8111941    1.879035
------------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. doubselect urvey_maint_2017_FS survey_maint_12m_BS $control $participants $game, scoremethod(lasso) selectmethod(lasso)
command doubselect is unrecognized
r(199);

end of do-file

r(199);

. help doubleselect

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. dslogit survey_maint_2017_FS  survey_maint_12m_BS ,  controls( $participants $control $game) rseed(1228)

Estimating lasso for survey_maint_2017_FS using plugin
Estimating lasso for survey_maint_12m_BS using plugin

Double-selection logit model          Number of obs               =         55
                                      Number of controls          =         16
                                      Number of selected controls =          0
                                      Wald chi2(1)                =       1.03
                                      Prob > chi2                 =     0.3104

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
 survey_maint_12m_BS |   1.848214   1.119066     1.01   0.310     .5641083    6.055391
--------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. global working_ANALYSIS "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\BOSCH\4-Paper\Endogenous Preferences Haiyan\analysis"

. 
. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. 
. 
. *--------------------------------------------------
. * Set global Working Directory
. *--------------------------------------------------
. * Define this global macro to point where the replication folder is saved locally that includes this run.do script
. global working_ANALYSIS "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\BOSCH\4-Paper\Endogenous Preferences Haiyan\analysis"

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. *Load dataset
. use "$working_ANALYSIS/processed/analysis_rdy.dta", replace

. 
. 
. 
end of do-file

. tab h11wom

   women were |
excluded from |
          aid |      Freq.     Percent        Cum.
--------------+-----------------------------------
never occured |        537       66.63       66.63
  very seldom |         47        5.83       72.46
       seldom |        101       12.53       84.99
    sometimes |         47        5.83       90.82
        often |         32        3.97       94.79
   very often |         10        1.24       96.03
 all the time |          5        0.62       96.65
          999 |         27        3.35      100.00
--------------+-----------------------------------
        Total |        806      100.00

. tab h9exp

  (desired) |
  according |
 to peoples |
   exposure |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        123       15.26       15.26
          2 |        140       17.37       32.63
          3 |        110       13.65       46.28
          4 |        126       15.63       61.91
          5 |        153       18.98       80.89
          6 |         72        8.93       89.83
          7 |         42        5.21       95.04
          8 |         38        4.71       99.75
          9 |          2        0.25      100.00
------------+-----------------------------------
      Total |        806      100.00

. tab h10exp

   (actual) |
  according |
 to peoples |
   exposure |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        145       17.99       17.99
          2 |        129       16.00       34.00
          3 |        118       14.64       48.64
          4 |        122       15.14       63.77
          5 |        125       15.51       79.28
          6 |         75        9.31       88.59
          7 |         50        6.20       94.79
          8 |         41        5.09       99.88
          9 |          1        0.12      100.00
------------+-----------------------------------
      Total |        806      100.00

. bysort session:sum h10egalexp h10exp

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    3.592593    1.646891          1          7
      h10exp |         27    4.444444    2.275849          1          9

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.555556    1.908147          2          8
      h10exp |         27    3.962963    2.156947          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    3.703704     1.70553          1          7
      h10exp |         27    3.740741    2.104804          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         25        4.28    1.541644          2          7
      h10exp |         25        3.56    2.042874          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.222222    2.224571          1          8
      h10exp |         27    3.703704    2.034601          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.037037    1.890899          1          8
      h10exp |         27     3.62963    2.021959          1          7

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.111111    2.224571          1          8
      h10exp |         27    3.592593    2.135042          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    3.888889    2.275849          1          8
      h10exp |         27    3.925926    2.352183          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.925926    1.817139          2          8
      h10exp |         27    3.407407    2.152981          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    3.925926    1.939983          1          7
      h10exp |         27    3.148148    2.013487          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.148148    1.747607          1          7
      h10exp |         27    3.148148    1.610153          1          6

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27     4.37037    2.096667          1          9
      h10exp |         27    3.925926    2.251938          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         26    4.192308     2.20942          1          8
      h10exp |         26    4.269231    2.324783          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.296296    2.180593          1          8
      h10exp |         27    3.740741    1.933363          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         26    4.461538    1.964297          1          8
      h10exp |         26    3.961538    1.708351          1          7

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.407407    2.308167          1          8
      h10exp |         27    2.740741    2.104804          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.259259    1.953155          1          8
      h10exp |         27           4    2.093947          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.074074    1.817139          1          7
      h10exp |         27    3.481481    2.118969          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.925926    2.432566          1          8
      h10exp |         27    3.740741    2.104804          1          7

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    3.666667    1.754116          1          7
      h10exp |         27    3.407407    2.170772          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.814815    2.527343          1          9
      h10exp |         27    3.518519    2.100739          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 22

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27     4.37037    2.114931          1          8
      h10exp |         27    4.074074    1.979237          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 23

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.592593    2.024072          1          8
      h10exp |         27    3.296296    1.835857          1          6

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.259259    1.913366          1          8
      h10exp |         27    3.703704    2.072064          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 25

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.259259    2.246238          1          9
      h10exp |         27           4    2.019139          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 26

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.074074    1.979237          1          8
      h10exp |         27    4.111111    2.081666          1          7

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.222222    1.527525          2          7
      h10exp |         27    4.481481    2.343081          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 28

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.222222    1.846688          1          8
      h10exp |         27     3.62963    1.924501          1          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 29

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.296296    2.539152          1          8
      h10exp |         27    4.333333    1.617215          2          8

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> session = 30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  h10egalexp |         27    4.111111    1.804553          1          8
      h10exp |         27    3.259259    2.011364          1          7


. do "C:\Users\istei\AppData\Local\Temp\STD940_000000.tmp"

. 
. 
. *--------------------------------------------------
. * Set global Working Directory
. *--------------------------------------------------
. * Define this global macro to point where the replication folder is saved locally that includes this run.do script
. global working_ANALYSIS "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\BOSCH\4-Paper\Endogenous Preferences Haiyan\analysis"

. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. * Initialize log and record system parameters
. clear

. set more off

. cap mkdir "$working_ANALYSIS/scripts/logs"

. cap log close
