-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2023.03.20-09.44.01.log.txt
  log type:  text
 opened on:  20 Mar 2023, 09:44:02

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 20 Mar 2023 09:44:02

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *----------------------------------------------------------------------
. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
. *----------------------------------------------------------------------
. * PAPER IDEA
. * There is an effect of the workshops, it depends on female participation which is driven by whether there were female leaders were present
. * (1) +20pp maintenance, no effect on rules
. * (2) within games villages, we find that higher female participation
. * (3) 
. 
. 
. 
. *-----------------------------------------------------------
. *new 10.03.2023
. *-----------------------------------------------------------
. 
. bysort treatment: tab FES_site

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         16       57.14       57.14
    NGO active in village |         12       42.86      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         17       30.36       30.36
    NGO active in village |         39       69.64      100.00
--------------------------+-----------------------------------
                    Total |         56      100.00


. 
. tab site_ID if No_HH ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_Lit ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_SCST ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. 
. tab Village if site_ID == 236 // Urdali (=control)

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Urdali  |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. 
. 
. pwcorr share_female_percent3 game_total_all game_total_gamerelated  com_outside_game
variable com_outside_game not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Long.dta", clear

. 
. *----------------------------------------------------------------------
. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
. *----------------------------------------------------------------------
. 
end of do-file

. sum  treatment

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   treatment |        168    .6666667    .4728138          0          1

. tab survey_maint_12m_

    BS: Dam |
   received |
        any |
maintenance |
    in last |
      year? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         40       47.06       47.06
          1 |         45       52.94      100.00
------------+-----------------------------------
      Total |         85      100.00

. tab survey_maint_2017_

    FS: Dam |
   received |
        any |
maintenance |
since 2017? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       36.05       36.05
          1 |         55       63.95      100.00
------------+-----------------------------------
      Total |         86      100.00

. tab survey_maint_com_

   BS & FS: |
  Community |
 maintained |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        141       85.45       85.45
          1 |         24       14.55      100.00
------------+-----------------------------------
      Total |        165      100.00

. tab survey_maint_12m_

    BS: Dam |
   received |
        any |
maintenance |
    in last |
      year? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         40       47.06       47.06
          1 |         45       52.94      100.00
------------+-----------------------------------
      Total |         85      100.00

. tab survey_maint_2017_

    FS: Dam |
   received |
        any |
maintenance |
since 2017? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       36.05       36.05
          1 |         55       63.95      100.00
------------+-----------------------------------
      Total |         86      100.00

. tab survey_activity_any_
no observations

. tab survey_rules_extr_maint_

     BS&FS: |
  There are |
maintenance |
rules/pract |
   ices for |
      water |
 etxraction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        166      100.00      100.00
------------+-----------------------------------
      Total |        166      100.00

. tab survey_rules_maint_

     BS&FS: |
  There are |
        dam |
maintenance |
      rules |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        127       76.51       76.51
          1 |         39       23.49      100.00
------------+-----------------------------------
      Total |        166      100.00

. tab survey_rules_maint_all_

  There are |
   rules by |
        the |
  community |
    for dam |
maintenance |
          ? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       56.25       56.25
          1 |         56       43.75      100.00
------------+-----------------------------------
      Total |        128      100.00

. tab survey_maint_rule

Maintenance |
 rule exist |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        129       76.79       76.79
          1 |         39       23.21      100.00
------------+-----------------------------------
      Total |        168      100.00

. tab treatment

 Identifier |
        for |
   villages |
where games |
       were |
    played. |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         56       33.33       33.33
      Games |        112       66.67      100.00
------------+-----------------------------------
      Total |        168      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. pwcorr share_female_percent3 game_total_all game_total_gamerelated  com_outside_game
variable game_total_all not found
r(111);

end of do-file

r(111);

. tab survey_conflicts_any_

  BS: There |
   were any |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       94.74       94.74
          1 |          4        5.26      100.00
------------+-----------------------------------
      Total |         76      100.00

. tab survey_conflicts_other_

  FS: There |
 were other |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80       95.24       95.24
          1 |          4        4.76      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab survey_conflict_alloc_

     BS&FS: |
 There were |
 allocation |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        146       91.25       91.25
          1 |         14        8.75      100.00
------------+-----------------------------------
      Total |        160      100.00

. tab survey_conflict_maint_

     BS&FS: |
 There were |
maintenance |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        155       96.88       96.88
          1 |          5        3.13      100.00
------------+-----------------------------------
      Total |        160      100.00

. tab BS_FS

      BS_FS |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         84       50.00       50.00
          1 |         84       50.00      100.00
------------+-----------------------------------
      Total |        168      100.00

. tab survey_activity_any_
no observations

. tab survey_benefit_agri_

     BS&FS: |
  There are |
agricultura |
 l benefits |
 related to |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       62.65       62.65
          1 |         31       37.35      100.00
------------+-----------------------------------
      Total |         83      100.00

. tab survey_benefit_domuse_

     BS&FS: |
  There are |
   domestic |
        use |
   benefits |
 related to |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         38       23.17       23.17
          1 |        126       76.83      100.00
------------+-----------------------------------
      Total |        164      100.00

. tab survey_benefit_fish_

     BS&FS: |
  There are |
    fishing |
   benefits |
 related to |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         85       55.56       55.56
          1 |         68       44.44      100.00
------------+-----------------------------------
      Total |        153      100.00

. tab survey_benefit_livestock_

     BS&FS: |
  There are |
  livestock |
   benefits |
 related to |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20       12.20       12.20
          1 |        144       87.80      100.00
------------+-----------------------------------
      Total |        164      100.00

. tab survey_benefit_other_

     BS&FS: |
  There are |
      other |
   benefits |
 related to |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        149       90.85       90.85
          1 |         15        9.15      100.00
------------+-----------------------------------
      Total |        164      100.00

. tab survey_change_benefit_
no observations

. tab survey_collact_new_
no observations

. tab survey_conflict_alloc_

     BS&FS: |
 There were |
 allocation |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        146       91.25       91.25
          1 |         14        8.75      100.00
------------+-----------------------------------
      Total |        160      100.00

. tab survey_conflict_maint_

     BS&FS: |
 There were |
maintenance |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        155       96.88       96.88
          1 |          5        3.13      100.00
------------+-----------------------------------
      Total |        160      100.00

. tab survey_conflict_oper_

     BS&FS: |
 There were |
operational |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       98.75       98.75
          1 |          2        1.25      100.00
------------+-----------------------------------
      Total |        160      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen any_conflict = rowmax(survey_conflict_alloc_ survey_conflict_maint_ survey_conflict_oper_)
(8 missing values generated)

. 
end of do-file

. tab any_conflict

any_conflic |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        140       87.50       87.50
          1 |         20       12.50      100.00
------------+-----------------------------------
      Total |        160      100.00

. tab egen
variable egen not found
r(111);

. help egen

. tab survey_conflicts_any_

  BS: There |
   were any |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       94.74       94.74
          1 |          4        5.26      100.00
------------+-----------------------------------
      Total |         76      100.00

. tab survey_conflicts_other_

  FS: There |
 were other |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80       95.24       95.24
          1 |          4        4.76      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/2023_03_Survey&Game_Wide.dta", clear

. 
. *----------------------------------------------------------------------
. 
.  
. * Setting globals
. {
. global control                          No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS
. global session_composition      share_female_percent3 leader2_2 leader2_3 d_illiterate
. global session_composition2     share_female_percent2 leader2_2 leader2_3 d_illiterate
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. 
. bysort treatment: tab FES_site

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         16       57.14       57.14
    NGO active in village |         12       42.86      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

        NGO presence (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         17       30.36       30.36
    NGO active in village |         39       69.64      100.00
--------------------------+-----------------------------------
                    Total |         56      100.00


. 
. tab site_ID if No_HH ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_Lit ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab site_ID if Shar_SCST ==. //  236 

    Site ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        236 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. 
. 
. tab Village if site_ID == 236 // Urdali (=control)

                      0 Village_ |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Urdali  |          1      100.00      100.00
---------------------------------+-----------------------------------
                           Total |          1      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. pwcorr share_female_percent3 game_total_all game_total_gamerelated  com_outside_game
variable com_outside_game not found
r(111);

end of do-file

r(111);

. tab survey_conflicts_any_BS

  BS: There |
   were any |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       94.74       94.74
          1 |          4        5.26      100.00
------------+-----------------------------------
      Total |         76      100.00

. tab1 survey_conflict_alloc_BS survey_conflict_maint_BS survey_conflict_oper_BS

-> tabulation of survey_conflict_alloc_BS  

  BS: Hhere |
       were |
 allocation |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         73       96.05       96.05
          1 |          3        3.95      100.00
------------+-----------------------------------
      Total |         76      100.00

-> tabulation of survey_conflict_maint_BS  

  BS: There |
       were |
maintenance |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       98.68       98.68
          1 |          1        1.32      100.00
------------+-----------------------------------
      Total |         76      100.00

-> tabulation of survey_conflict_oper_BS  

  BS: Hhere |
       were |
operational |
  conflicts |
 around the |
        dam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         76      100.00      100.00
------------+-----------------------------------
      Total |         76      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen survey_conflicts_any_FS = rowmax(survey_conflict_alloc_FS survey_conflict_maint_FS survey_conflict_oper_FS)

. 
end of do-file

. tab survey_conflicts_any_FS

survey_conf |
licts_any_F |
          S |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         68       80.95       80.95
          1 |         16       19.05      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1


. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. probit survey_maint_2017_FS treatment survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. probit survey_maint_2017_FS treatment survey_maint_12m_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. probit survey_conflicts_any_FS treatment survey_conflicts_any_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -34.773904  
Iteration 1:   log pseudolikelihood = -34.166865  
Iteration 2:   log pseudolikelihood =  -34.16313  
Iteration 3:   log pseudolikelihood = -34.163129  

Probit regression                               Number of obs     =         76
                                                Wald chi2(2)      =       1.45
                                                Prob > chi2       =     0.4851
Log pseudolikelihood = -34.163129               Pseudo R2         =     0.0176

-----------------------------------------------------------------------------------------
                        |               Robust
survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
           treatment_BS |   .3901113   .3722917     1.05   0.295     -.339567     1.11979
survey_conflicts_any_BS |   .3969613   .7399878     0.54   0.592    -1.053388    1.847311
                  _cons |  -1.246998   .3146739    -3.96   0.000    -1.863748   -.6302488
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. probit survey_conflicts_any_FS treatment survey_conflicts_any_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -34.773904  
Iteration 1:   log pseudolikelihood = -29.284748  
Iteration 2:   log pseudolikelihood = -28.829968  
Iteration 3:   log pseudolikelihood = -28.825578  
Iteration 4:   log pseudolikelihood = -28.825578  

Probit regression                               Number of obs     =         76
                                                Wald chi2(7)      =      15.12
                                                Prob > chi2       =     0.0345
Log pseudolikelihood = -28.825578               Pseudo R2         =     0.1711

----------------------------------------------------------------------------------------------
                             |               Robust
     survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5750033    .349344     1.65   0.100    -.1096984    1.259705
     survey_conflicts_any_BS |   .7648464   .6852569     1.12   0.264    -.5782326    2.107925
                       No_HH |   .0045488   .0017838     2.55   0.011     .0010527     .008045
                    FES_site |    .782392   .4057551     1.93   0.054    -.0128734    1.577657
                    Shar_Lit |   .0261426   .0237886     1.10   0.272    -.0204821    .0727674
                   Shar_SCST |   .0174169   .0123979     1.40   0.160    -.0068826    .0417164
survey_dam_for_irrigation_FS |   .5536807   .3793576     1.46   0.144    -.1898464    1.297208
                       _cons |  -5.821878    2.03625    -2.86   0.004    -9.812854   -1.830901
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. *-----------------------------------------
. bys treatment: sum $control

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100
survey_da~FS |         28    .3571429      .48795          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100
survey_da~FS |         56    .4285714    .4993502          0          1


. *Figure 1.      Treatment effects, NGO presence & female participation
. *Panel A: Treatment effects
. 
. *maintenance
. probit survey_maint_2017_FS treatment survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment survey_maint_12m_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .199991   .0980867     2.04   0.041     .0077446    .3922375
         survey_maint_12m_BS |   .1937148   .0940361     2.06   0.039     .0094075    .3780222
                       No_HH |   -.000358   .0004645    -0.77   0.441    -.0012685    .0005525
                    FES_site |   .0200957   .1104538     0.18   0.856    -.1963897    .2365811
                    Shar_Lit |   .0056405    .006322     0.89   0.372    -.0067504    .0180314
                   Shar_SCST |  -.0051376   .0027227    -1.89   0.059     -.010474    .0001988
survey_dam_for_irrigation_FS |   .0383799   .1037738     0.37   0.712     -.165013    .2417728
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11851538

. 
. *rules
. probit survey_maint_rule_FS treatment survey_maint_rule_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.707752  
Iteration 2:   log pseudolikelihood = -51.707685  
Iteration 3:   log pseudolikelihood = -51.707685  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       0.53
                                                Prob > chi2       =     0.7669
Log pseudolikelihood = -51.707685               Pseudo R2         =     0.0051

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .1130016   .3079753     0.37   0.714    -.4906188    .7166221
survey_maint_rule_BS |    .250906    .389699     0.64   0.520      -.51289    1.014702
               _cons |  -.6138882   .2628291    -2.34   0.020    -1.129024   -.0987526
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_rule_BS

--------------------------------------------------------------------------------------
                     |            Delta-method
                     |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .039621   .1077558     0.37   0.713    -.1715765    .2508185
survey_maint_rule_BS |   .0879735   .1356664     0.65   0.517    -.1779278    .3538749
--------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .0050935

. 
. probit survey_maint_rule_FS treatment survey_maint_rule_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.78618  
Iteration 1:   log pseudolikelihood = -48.109524  
Iteration 2:   log pseudolikelihood =   -48.0902  
Iteration 3:   log pseudolikelihood = -48.090194  
Iteration 4:   log pseudolikelihood = -48.090194  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =       3.92
                                                Prob > chi2       =     0.7891
Log pseudolikelihood = -48.090194               Pseudo R2         =     0.0531

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1685262   .3310294     0.51   0.611    -.4802794    .8173318
        survey_maint_rule_BS |   .2308962   .4183569     0.55   0.581    -.5890684    1.050861
                       No_HH |  -.0022713   .0016899    -1.34   0.179    -.0055834    .0010408
                    FES_site |   .0741613   .3104021     0.24   0.811    -.5342156    .6825383
                    Shar_Lit |   .0008443   .0190561     0.04   0.965    -.0365049    .0381935
                   Shar_SCST |  -.0044503   .0083918    -0.53   0.596    -.0208979    .0119974
survey_dam_for_irrigation_FS |  -.4374285   .3358966    -1.30   0.193    -1.095774    .2209167
                       _cons |   .1260744    1.31204     0.10   0.923    -2.445476    2.697625
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_rule_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0557472   .1091281     0.51   0.609    -.1581399    .2696344
        survey_maint_rule_BS |   .0763788    .137253     0.56   0.578    -.1926323    .3453898
                       No_HH |  -.0007513   .0005384    -1.40   0.163    -.0018066    .0003039
                    FES_site |    .024532   .1022383     0.24   0.810    -.1758513    .2249154
                    Shar_Lit |   .0002793   .0063029     0.04   0.965    -.0120742    .0126328
                   Shar_SCST |  -.0014721   .0027508    -0.54   0.593    -.0068636    .0039194
survey_dam_for_irrigation_FS |  -.1446982   .1071625    -1.35   0.177    -.3547327    .0653364
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .05308503

. 
. *conflict
. probit survey_conflicts_any_FS treatment survey_conflicts_any_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -34.773904  
Iteration 1:   log pseudolikelihood = -34.166865  
Iteration 2:   log pseudolikelihood =  -34.16313  
Iteration 3:   log pseudolikelihood = -34.163129  

Probit regression                               Number of obs     =         76
                                                Wald chi2(2)      =       1.45
                                                Prob > chi2       =     0.4851
Log pseudolikelihood = -34.163129               Pseudo R2         =     0.0176

-----------------------------------------------------------------------------------------
                        |               Robust
survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
           treatment_BS |   .3901113   .3722917     1.05   0.295     -.339567     1.11979
survey_conflicts_any_BS |   .3969613   .7399878     0.54   0.592    -1.053388    1.847311
                  _cons |  -1.246998   .3146739    -3.96   0.000    -1.863748   -.6302488
-----------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment5:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         76
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : treatment_BS survey_conflicts_any_BS

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
           treatment_BS |    .097214   .0927104     1.05   0.294     -.084495    .2789231
survey_conflicts_any_BS |    .098921   .1846036     0.54   0.592    -.2628953    .4607374
-----------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01756418

. 
. probit survey_conflicts_any_FS treatment survey_conflicts_any_BS $control, vce(robust)

Iteration 0:   log pseudolikelihood = -34.773904  
Iteration 1:   log pseudolikelihood = -29.284748  
Iteration 2:   log pseudolikelihood = -28.829968  
Iteration 3:   log pseudolikelihood = -28.825578  
Iteration 4:   log pseudolikelihood = -28.825578  

Probit regression                               Number of obs     =         76
                                                Wald chi2(7)      =      15.12
                                                Prob > chi2       =     0.0345
Log pseudolikelihood = -28.825578               Pseudo R2         =     0.1711

----------------------------------------------------------------------------------------------
                             |               Robust
     survey_conflicts_any_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5750033    .349344     1.65   0.100    -.1096984    1.259705
     survey_conflicts_any_BS |   .7648464   .6852569     1.12   0.264    -.5782326    2.107925
                       No_HH |   .0045488   .0017838     2.55   0.011     .0010527     .008045
                    FES_site |    .782392   .4057551     1.93   0.054    -.0128734    1.577657
                    Shar_Lit |   .0261426   .0237886     1.10   0.272    -.0204821    .0727674
                   Shar_SCST |   .0174169   .0123979     1.40   0.160    -.0068826    .0417164
survey_dam_for_irrigation_FS |   .5536807   .3793576     1.46   0.144    -.1898464    1.297208
                       _cons |  -5.821878    2.03625    -2.86   0.004    -9.812854   -1.830901
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment6:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         76
Model VCE    : Robust

Expression   : Pr(survey_conflicts_any_FS), predict()
dy/dx w.r.t. : treatment_BS survey_conflicts_any_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .120706   .0779969     1.55   0.122     -.032165     .273577
     survey_conflicts_any_BS |   .1605583   .1471985     1.09   0.275    -.1279455    .4490621
                       No_HH |   .0009549   .0003736     2.56   0.011     .0002226    .0016872
                    FES_site |   .1642415   .0903113     1.82   0.069    -.0127654    .3412484
                    Shar_Lit |   .0054879   .0049303     1.11   0.266    -.0041753    .0151511
                   Shar_SCST |   .0036562   .0025851     1.41   0.157    -.0014106     .008723
survey_dam_for_irrigation_FS |   .1162299   .0756535     1.54   0.124    -.0320482    .2645081
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .17105721

. 
. 
. *plot coefficients
. coefplot (treatment2) (treatment4) (treatment6),  keep(treatment) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(top))
>  coeflabels(treatment  = "Treated (=1)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) msize
> (4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", con
> d(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule exists (=1)" 9 "Conflict (=1)") pos(6) rin
> g(1) rows(2))
(treatment2: no coefficients found, all dropped, or none kept)
(treatment4: no coefficients found, all dropped, or none kept)
(treatment6: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. coefplot (treatment2) (treatment4) (treatment6),  keep(treatment_BS) title("{bf: A} Game Impact") subtitle(, nobox margin(tiny) justification(center)  bmargin(to
> p)) coeflabels(treatment  = "Treated (=1)") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Regression estimated impact in pp relative to control")   msymbol(d) ms
> ize(4pt) xla(-.3(.1).3, nogrid) grid(none)  levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", 
> cond(@pval<.1, "*", "")))) mlabsize(5pt) mlabposition(12) mlabgap(-0.2) legend(order(3 "Dam Maintenance (=1)" 6 "Dam rule exists (=1)" 9 "Conflict (=1)") pos(6) 
> ring(1) rows(2))
(note:  named style medthin not found in class linestyle, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/figure1_a.gph saved)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen survey_benefit_any_BS = rowmaxsurvey_benefit_agri_BS survey_benefit_domuse_BS survey_benefit_fish_BS survey_benefit_livestock_BS survey_benefit_other_BS)
unknown egen function rowmaxsurvey_benefit_agri_BS()
r(133);

end of do-file

r(133);

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen survey_benefit_any_BS = rowtotal(survey_benefit_agri_BS survey_benefit_domuse_BS survey_benefit_fish_BS survey_benefit_livestock_BS survey_benefit_other_BS)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen survey_benefit_total_BS = rowtotal(survey_benefit_agri_BS survey_benefit_domuse_BS survey_benefit_fish_BS survey_benefit_livestock_BS survey_benefit_other_B
> S)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. egen survey_benefit_total_FS = rowtotal(survey_benefit_agri_FS survey_benefit_domuse_FS survey_benefit_fish_FS survey_benefit_livestock_FS survey_benefit_other_F
> S)

. 
end of do-file

. tab survey_benefit_total_FS

survey_bene |
fit_total_F |
          S |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        2.38        2.38
          1 |         10       11.90       14.29
          2 |         32       38.10       52.38
          3 |         29       34.52       86.90
          4 |         11       13.10      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4870_000000.tmp"

. reg survey_benefit_total_FS treatment_BS survey_benefit_total_BS $control, vce(robust)

Linear regression                               Number of obs     =         83
                                                F(7, 75)          =       3.54
                                                Prob > F          =     0.0025
                                                R-squared         =     0.2451
                                                Root MSE          =     .86526

----------------------------------------------------------------------------------------------
                             |               Robust
     survey_benefit_total_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |  -.0922236    .209515    -0.44   0.661    -.5095989    .3251517
     survey_benefit_total_BS |   .2266832   .1250081     1.81   0.074    -.0223458    .4757121
                       No_HH |   .0005223   .0008911     0.59   0.560    -.0012528    .0022974
                    FES_site |  -.1723758   .2224399    -0.77   0.441    -.6154989    .2707472
                    Shar_Lit |   .0096102    .011399     0.84   0.402    -.0130977    .0323181
                   Shar_SCST |  -.0006187    .005778    -0.11   0.915     -.012129    .0108916
survey_dam_for_irrigation_FS |   .7756677   .2269805     3.42   0.001     .3234994    1.227836
                       _cons |   1.272371   .7857511     1.62   0.110    -.2929252    2.837668
----------------------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
