----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2024.07.24-14.37.58.log.txt
  log type:  text
 opened on:  24 Jul 2024, 14:37:58

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 24 Jul 2024 14:37:58

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD14c_000000.tmp"

. 
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD14c_000000.tmp"

. *Globals
. gen VP10=VP/10
(132 missing values generated)

. gen HH10=No_HH/10
(105 missing values generated)

. 
. egen z_VP2 = std(norm_progressive2)
(132 missing values generated)

. egen z_VP = std(VP)
(132 missing values generated)

. egen z_HH = std(No_HH)
(105 missing values generated)

. egen z_SHG_before2017 = std(n_SHG_before2017)
(129 missing values generated)

. global village z_VP z_SHG_before2017 z_HH FES_site 

. global village2 VP n_SHG_before2017 No_HH FES_site 

. 
. *Graph share female leaders / share non-leaders female --> same for men?
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD14c_000000.tmp"

. *SEM including composition of leaders
. sem ($village sequence-> leader_comp1_BS ) ($village sequence-> leader_comp2_BS ) ($village sequence-> leader_comp3_BS ) ($village sequence-> leader_comp4_BS ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_lea
> ders $village sequence -> share_female_percent3_BS , )  (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS survey_maint_rule_BS $village survey_dam_for_irrigation_FS sequence -> sur
> vey_maint_rule_FS, ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS  total_leaders share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_FS $village survey_dam_for_irrigation_FS sequence -> survey_maint_2017
> _FS , ), vce(robust) nocapslatent
(132 observations with missing values excluded)

Endogenous variables

Observed:  leader_comp1_BS leader_comp2_BS leader_comp3_BS leader_comp4_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  z_VP z_SHG_before2017 z_HH FES_site sequence total_leaders survey_maint_rule_BS survey_dam_for_irrigation_FS survey_maint_12m_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -874.3351  
Iteration 1:   log pseudolikelihood =  -874.3351  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -874.3351

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
                         _cons |  -.0198109    .102636    -0.19   0.847    -.2209738     .181352
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
                         _cons |   .6771111   .1608046     4.21   0.000     .3619399    .9922824
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
                         _cons |   .0668201   .0985169     0.68   0.498    -.1262694    .2599096
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
                         _cons |   .2758797   .1388335     1.99   0.047      .003771    .5479884
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |   .5331561   .3136015     1.70   0.089    -.0814915    1.147804
              z_SHG_before2017 |  -.5044327   .1994346    -2.53   0.011    -.8953173   -.1135482
                          z_HH |    .203265   .2777418     0.73   0.464     -.341099     .747629
                      FES_site |  -.3958435   .4406409    -0.90   0.369    -1.259484    .4677968
                      sequence |   .0447183   .0171311     2.61   0.009     .0111419    .0782947
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
                         _cons |   1.037405   .7468919     1.39   0.165    -.4264766    2.501286
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0068891   .1742541     0.04   0.968    -.3346426    .3484209
               leader_comp3_BS |  -.1292705    .293916    -0.44   0.660    -.7053352    .4467943
               leader_comp4_BS |  -.1331494   .1653909    -0.81   0.421    -.4573096    .1910107
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |  -.0516892   .0515743    -1.00   0.316    -.1527731    .0493946
              z_SHG_before2017 |   .2272703   .0690363     3.29   0.001     .0919615     .362579
                          z_HH |  -.1809819   .0789774    -2.29   0.022    -.3357748    -.026189
                      FES_site |   .2868158   .1103715     2.60   0.009     .0704917    .5031398
                      sequence |  -.0050865   .0057154    -0.89   0.373    -.0162886    .0061155
                 total_leaders |   .0497399   .0556108     0.89   0.371    -.0592552     .158735
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
                         _cons |  -.0189546   .2406838    -0.08   0.937    -.4906863    .4527771
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0489187   .1736482     0.28   0.778    -.2914255     .389263
               leader_comp3_BS |   .4644573   .2248425     2.07   0.039     .0237741    .9051405
               leader_comp4_BS |   -.125413   .1656059    -0.76   0.449    -.4499946    .1991687
      share_female_percent3_BS |  -.0188341   .0333651    -0.56   0.572    -.0842285    .0465603
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2078824   .0553341     3.76   0.000     .0994295    .3163353
              z_SHG_before2017 |  -.0847831   .0649061    -1.31   0.191    -.2119967    .0424304
                          z_HH |    .181209   .0736774     2.46   0.014     .0368041     .325614
                      FES_site |   .0283921   .1359419     0.21   0.835     -.238049    .2948333
                      sequence |   .0110343   .0039686     2.78   0.005     .0032559    .0188126
                 total_leaders |  -.0861377   .0496955    -1.73   0.083    -.1835391    .0112636
  survey_dam_for_irrigation_FS |   .3420162   .1119264     3.06   0.002     .1226445    .5613879
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
                         _cons |   .2796448    .199383     1.40   0.161    -.1111387    .6704282
-------------------------------+----------------------------------------------------------------
         var(e.leader_comp1_BS)|   .0894423   .0168339                      .0618498    .1293443
         var(e.leader_comp2_BS)|     .21125   .0210414                      .1737855    .2567911
         var(e.leader_comp3_BS)|   .1106685   .0278016                      .0676378    .1810752
         var(e.leader_comp4_BS)|   .1490047   .0289977                      .1017532    .2181983
var(e.share_female_percent3_BS)|   1.663778   .3486625                      1.103359    2.508844
    var(e.survey_maint_rule_FS)|   .1412993    .020883                      .1057642    .1887737
    var(e.survey_maint_2017_FS)|   .1168902   .0183991                      .0858608    .1591334
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD14c_000000.tmp"

. estat teffects


Direct effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |   .5331561   .3136015     1.70   0.089    -.0814915    1.147804
              z_SHG_before2017 |  -.5044327   .1994346    -2.53   0.011    -.8953173   -.1135482
                          z_HH |    .203265   .2777418     0.73   0.464     -.341099     .747629
                      FES_site |  -.3958435   .4406409    -0.90   0.369    -1.259484    .4677968
                      sequence |   .0447183   .0171311     2.61   0.009     .0111419    .0782947
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0068891   .1742541     0.04   0.968    -.3346426    .3484209
               leader_comp3_BS |  -.1292705    .293916    -0.44   0.660    -.7053352    .4467943
               leader_comp4_BS |  -.1331494   .1653909    -0.81   0.421    -.4573096    .1910107
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |  -.0516892   .0515743    -1.00   0.316    -.1527731    .0493946
              z_SHG_before2017 |   .2272703   .0690363     3.29   0.001     .0919615     .362579
                          z_HH |  -.1809819   .0789774    -2.29   0.022    -.3357748    -.026189
                      FES_site |   .2868158   .1103715     2.60   0.009     .0704917    .5031398
                      sequence |  -.0050865   .0057154    -0.89   0.373    -.0162886    .0061155
                 total_leaders |   .0497399   .0556108     0.89   0.371    -.0592552     .158735
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0489187   .1736482     0.28   0.778    -.2914255     .389263
               leader_comp3_BS |   .4644573   .2248425     2.07   0.039     .0237741    .9051405
               leader_comp4_BS |   -.125413   .1656059    -0.76   0.449    -.4499946    .1991687
      share_female_percent3_BS |  -.0188341   .0333651    -0.56   0.572    -.0842285    .0465603
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2078824   .0553341     3.76   0.000     .0994295    .3163353
              z_SHG_before2017 |  -.0847831   .0649061    -1.31   0.191    -.2119967    .0424304
                          z_HH |    .181209   .0736774     2.46   0.014     .0368041     .325614
                      FES_site |   .0283921   .1359419     0.21   0.835     -.238049    .2948333
                      sequence |   .0110343   .0039686     2.78   0.005     .0032559    .0188126
                 total_leaders |  -.0861377   .0496955    -1.73   0.083    -.1835391    .0112636
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |   .3420162   .1119264     3.06   0.002     .1226445    .5613879
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |          0  (no path)
               leader_comp3_BS |          0  (no path)
               leader_comp4_BS |          0  (no path)
                          z_VP |  -.0083661   .1120985    -0.07   0.941    -.2280752     .211343
              z_SHG_before2017 |   .1627873   .2041429     0.80   0.425    -.2373256    .5629001
                          z_HH |   .1392668   .1843276     0.76   0.450    -.2220085    .5005422
                      FES_site |   .0292977   .2936398     0.10   0.921    -.5462257    .6048211
                      sequence |  -.0078732   .0094111    -0.84   0.403    -.0263187    .0105723
                 total_leaders |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1278738   .1054215     1.21   0.225    -.0787485    .3344961
               leader_comp3_BS |     .14858    .133904     1.11   0.267    -.1138669     .411027
               leader_comp4_BS |   .3161769   .1318952     2.40   0.017      .057667    .5746869
      share_female_percent3_BS |          0  (no path)
                          z_VP |   .0709724   .0568004     1.25   0.211    -.0403544    .1822993
              z_SHG_before2017 |  -.0590627   .0537368    -1.10   0.272    -.1643848    .0462594
                          z_HH |   .0433536    .048884     0.89   0.375    -.0524572    .1391645
                      FES_site |  -.0505801   .0861752    -0.59   0.557    -.2194803    .1183202
                      sequence |   .0051461   .0036302     1.42   0.156     -.001969    .0122612
                 total_leaders |  -.0587757   .0258295    -2.28   0.023    -.1094006   -.0081508
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |    .033918   .0701145     0.48   0.629    -.1035039    .1713399
               leader_comp3_BS |  -.0120145   .1121098    -0.11   0.915    -.2317456    .2077166
               leader_comp4_BS |   .0276043   .0862253     0.32   0.749    -.1413941    .1966028
      share_female_percent3_BS |   .0544625   .0208361     2.61   0.009     .0136244    .0953006
          survey_maint_rule_FS |          0  (no path)
                          z_VP |   .0252418   .0340742     0.74   0.459    -.0415425     .092026
              z_SHG_before2017 |   .1108874   .0608823     1.82   0.069    -.0084397    .2302145
                          z_HH |  -.1136586   .0499951    -2.27   0.023    -.2116472     -.01567
                      FES_site |   .1783788   .0902383     1.98   0.048      .001515    .3552426
                      sequence |   -.001603   .0036498    -0.44   0.661    -.0087564    .0055504
                 total_leaders |   .0042293   .0248405     0.17   0.865    -.0444573    .0529159
          survey_maint_rule_BS |  -.0119875   .0704623    -0.17   0.865     -.150091    .1261161
  survey_dam_for_irrigation_FS |  -.0895852   .0475755    -1.88   0.060    -.1828314     .003661
           survey_maint_12m_BS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |     .52479   .3722614     1.41   0.159    -.2048289    1.254409
              z_SHG_before2017 |  -.3416455   .2548285    -1.34   0.180    -.8411002    .1578092
                          z_HH |   .3425318   .3523069     0.97   0.331     -.347977    1.033041
                      FES_site |  -.3665458   .4615255    -0.79   0.427    -1.271119    .5380275
                      sequence |   .0368451   .0205701     1.79   0.073    -.0034715    .0771617
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |    .134763   .2064408     0.65   0.514    -.2698536    .5393796
               leader_comp3_BS |   .0193096   .3280192     0.06   0.953    -.6235962    .6622154
               leader_comp4_BS |   .1830275   .2011161     0.91   0.363    -.2111527    .5772077
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |   .0192832   .0745639     0.26   0.796    -.1268593    .1654257
              z_SHG_before2017 |   .1682076   .0662715     2.54   0.011     .0383178    .2980974
                          z_HH |  -.1376283   .0816361    -1.69   0.092    -.2976321    .0223756
                      FES_site |   .2362357   .1260299     1.87   0.061    -.0107783    .4832497
                      sequence |   .0000595   .0059553     0.01   0.992    -.0116127    .0117317
                 total_leaders |  -.0090358   .0633028    -0.14   0.886    -.1331071    .1150355
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0828367   .1898869     0.44   0.663    -.2893347    .4550081
               leader_comp3_BS |   .4524428   .2405034     1.88   0.060    -.0189353    .9238209
               leader_comp4_BS |  -.0978086   .1665369    -0.59   0.557    -.4242149    .2285976
      share_female_percent3_BS |   .0356284   .0293257     1.21   0.224    -.0218488    .0931057
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2331242   .0567642     4.11   0.000     .1218683      .34438
              z_SHG_before2017 |   .0261043   .0802054     0.33   0.745    -.1310954     .183304
                          z_HH |   .0675504   .0810526     0.83   0.405    -.0913097    .2264106
                      FES_site |    .206771   .1467297     1.41   0.159    -.0808141     .494356
                      sequence |   .0094313   .0045586     2.07   0.039     .0004966    .0183659
                 total_leaders |  -.0819084   .0553561    -1.48   0.139    -.1904044    .0265875
          survey_maint_rule_BS |  -.0119875   .0704623    -0.17   0.865     -.150091    .1261161
  survey_dam_for_irrigation_FS |    .252431   .1224949     2.06   0.039     .0123454    .4925165
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
------------------------------------------------------------------------------------------------

. 
end of do-file

. tab game_no_leader_fem_vill

     Sum of |
    females |
that are no |
 leaders in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
          1 |          5        8.93       21.43
          2 |          8       14.29       35.71
          3 |         11       19.64       55.36
          4 |          7       12.50       67.86
          5 |         10       17.86       85.71
          6 |          4        7.14       92.86
          7 |          2        3.57       96.43
          9 |          1        1.79       98.21
         13 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab share_female_percent3_BS

 Non-leader |
     female |
participant |
 s (in 10%) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
   .7142857 |          5        8.93       21.43
   1.428571 |          8       14.29       35.71
   2.142857 |         11       19.64       55.36
   2.857143 |          7       12.50       67.86
   3.571429 |         10       17.86       85.71
   4.285714 |          4        7.14       92.86
          5 |          2        3.57       96.43
   6.428571 |          1        1.79       98.21
   9.285714 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. sum share_female_percent3_BS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
share_f~3_BS |         56     2.44898    1.754174          0   9.285714

. do "C:\Users\istei\AppData\Local\Temp\STD14c_000000.tmp"

. 
. mlogit leader_present_BS $village sequence, vce(robust)

Iteration 0:   log pseudolikelihood = -70.202666  
Iteration 1:   log pseudolikelihood = -54.161871  
Iteration 2:   log pseudolikelihood = -49.942549  
Iteration 3:   log pseudolikelihood = -49.241518  
Iteration 4:   log pseudolikelihood = -49.226159  
Iteration 5:   log pseudolikelihood =  -49.22612  
Iteration 6:   log pseudolikelihood =  -49.22612  

Multinomial logistic regression                 Number of obs     =         56
                                                Wald chi2(15)     =      41.15
                                                Prob > chi2       =     0.0003
Log pseudolikelihood =  -49.22612               Pseudo R2         =     0.2988

----------------------------------------------------------------------------------
                 |               Robust
leader_present~S |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
None             |
            z_VP |   .2296098    .615292     0.37   0.709    -.9763405     1.43556
z_SHG_before2017 |  -3.736348   1.301049    -2.87   0.004    -6.286358   -1.186338
            z_HH |  -.1658354   .7416256    -0.22   0.823    -1.619395    1.287724
        FES_site |  -3.432065   1.479231    -2.32   0.020    -6.331305   -.5328245
        sequence |    .197278   .0518618     3.80   0.000     .0956308    .2989253
           _cons |  -7.303559   2.244383    -3.25   0.001    -11.70247    -2.90465
-----------------+----------------------------------------------------------------
Only_Male        |  (base outcome)
-----------------+----------------------------------------------------------------
Both             |
            z_VP |   .7880027   .4852634     1.62   0.104     -.163096    1.739101
z_SHG_before2017 |   1.556576   .8025295     1.94   0.052    -.0163528    3.129505
            z_HH |  -2.045242   .8157175    -2.51   0.012    -3.644019   -.4464656
        FES_site |   1.221231   1.105679     1.10   0.269    -.9458598    3.388321
        sequence |   .0153633   .0387073     0.40   0.691    -.0605016    .0912283
           _cons |  -3.532116   1.345666    -2.62   0.009    -6.169572   -.8946601
-----------------+----------------------------------------------------------------
Only_Female      |
            z_VP |  -.0463444   .4162294    -0.11   0.911     -.862139    .7694503
z_SHG_before2017 |  -.5619519   .5921352    -0.95   0.343    -1.722516    .5986118
            z_HH |   1.016056   .6235594     1.63   0.103    -.2060979     2.23821
        FES_site |  -1.391544   1.043682    -1.33   0.182    -3.437123    .6540348
        sequence |    .046812   .0268365     1.74   0.081    -.0057864    .0994105
           _cons |  -1.220976   .9066618    -1.35   0.178    -2.998001    .5560481
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

dy/dx w.r.t. : z_VP z_SHG_before2017 z_HH FES_site sequence
1._predict   : Pr(leader_present_BS==None), predict(pr outcome(0))
2._predict   : Pr(leader_present_BS==Only_Male), predict(pr outcome(1))
3._predict   : Pr(leader_present_BS==Both), predict(pr outcome(2))
4._predict   : Pr(leader_present_BS==Only_Female), predict(pr outcome(3))

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
z_VP             |
        _predict |
              1  |   .0091032   .0389776     0.23   0.815    -.0672916    .0854979
              2  |  -.0636835   .0609678    -1.04   0.296    -.1831782    .0558112
              3  |   .0806422   .0450633     1.79   0.074    -.0076803    .1689647
              4  |  -.0260619   .0516189    -0.50   0.614    -.1272331    .0751094
-----------------+----------------------------------------------------------------
z_SHG_before2017 |
        _predict |
              1  |  -.2474127   .0516605    -4.79   0.000    -.3486654     -.14616
              2  |   .0412477   .0882824     0.47   0.640    -.1317826     .214278
              3  |   .2067743   .0840117     2.46   0.014     .0421144    .3714342
              4  |  -.0006093   .0502097    -0.01   0.990    -.0990184    .0977998
-----------------+----------------------------------------------------------------
z_HH             |
        _predict |
              1  |   -.019694    .045476    -0.43   0.665    -.1088254    .0694374
              2  |    .069889   .1049696     0.67   0.506    -.1358477    .2756257
              3  |  -.2285944   .0985736    -2.32   0.020    -.4217952   -.0353936
              4  |   .1783994   .0664831     2.68   0.007      .048095    .3087039
-----------------+----------------------------------------------------------------
FES_site         |
        _predict |
              1  |   -.201221    .078952    -2.55   0.011    -.3559641   -.0464779
              2  |    .134911   .1386789     0.97   0.331    -.1368946    .4067166
              3  |   .1831152   .1105981     1.66   0.098    -.0336531    .3998836
              4  |  -.1168052   .1111644    -1.05   0.293    -.3346835     .101073
-----------------+----------------------------------------------------------------
sequence         |
        _predict |
              1  |   .0116727   .0018241     6.40   0.000     .0080975    .0152479
              2  |  -.0113354   .0037369    -3.03   0.002    -.0186596   -.0040112
              3  |  -.0010559   .0029735    -0.36   0.722    -.0068838    .0047719
              4  |   .0007186    .002727     0.26   0.792    -.0046262    .0060634
----------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
