--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2024.07.15-09.30.00.log.txt
  log type:  text
 opened on:  15 Jul 2024, 09:30:00

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 15 Jul 2024 09:30:00

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmataps
> s;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduc
> es transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
end of do-file

. tab game_sum_leader_CR

     Sum of |
 leaders in |
     common |
  resources |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         37       66.07       66.07
          1 |          9       16.07       82.14
          2 |          4        7.14       89.29
          3 |          1        1.79       91.07
          4 |          3        5.36       96.43
          5 |          1        1.79       98.21
          6 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab leader2_3_BS

     Female |
     leader |
participate |
     d (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43       76.79       76.79
          1 |         13       23.21      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab leader2_3_BS FES_site

    Female |
    leader | NGO active in village
participat |         (=1)
   ed (=1) | NGO not a  NGO activ |     Total
-----------+----------------------+----------
         0 |        12         31 |        43 
         1 |         5          8 |        13 
-----------+----------------------+----------
     Total |        17         39 |        56 

. reg share_female_percent_BS FES_site

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(1, 54)        =      0.28
       Model |  96.5015067         1  96.5015067   Prob > F        =    0.5973
    Residual |  18452.1504        54  341.706489   R-squared       =    0.0052
-------------+----------------------------------   Adj R-squared   =   -0.0132
       Total |  18548.6519        55  337.248217   Root MSE        =    18.485

------------------------------------------------------------------------------
share_f~t_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -2.854988   5.372345    -0.53   0.597    -13.62589    7.915914
       _cons |   29.41177   4.483345     6.56   0.000      20.4232    38.40033
------------------------------------------------------------------------------

. reg game_leader_fem_vill FES_site

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(1, 54)        =      0.24
       Model |   .08750808         1   .08750808   Prob > F        =    0.6242
    Residual |  19.4660633        54  .360482655   R-squared       =    0.0045
-------------+----------------------------------   Adj R-squared   =   -0.0140
       Total |  19.5535714        55  .355519481   Root MSE        =     .6004

------------------------------------------------------------------------------
game_leade.. |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -.0859729   .1744936    -0.49   0.624    -.4358114    .2638657
       _cons |   .4705882   .1456189     3.23   0.002     .1786399    .7625365
------------------------------------------------------------------------------

. ttest game_leader_fem_vill, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      17    .4705882    .1514063    .6242643    .1496212    .7915553
NGO acti |      39    .3846154    .0944862    .5900662     .193338    .5758927
---------+--------------------------------------------------------------------
combined |      56    .4107143    .0796779    .5962545    .2510363    .5703923
---------+--------------------------------------------------------------------
    diff |            .0859729    .1744936               -.2638657    .4358114
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =   0.4927
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6879         Pr(|T| > |t|) = 0.6242          Pr(T > t) = 0.3121

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. probit leader2_3_BS FES_Site, vce(robust)
variable FES_Site not found
r(111);

. probit leader2_3_BS FES_site, vce(robust)

Iteration 0:   log pseudolikelihood = -30.343748  
Iteration 1:   log pseudolikelihood = -30.088487  
Iteration 2:   log pseudolikelihood = -30.088326  
Iteration 3:   log pseudolikelihood = -30.088326  

Probit regression                               Number of obs     =         56
                                                Wald chi2(1)      =       0.51
                                                Prob > chi2       =     0.4772
Log pseudolikelihood = -30.088326               Pseudo R2         =     0.0084

------------------------------------------------------------------------------
             |               Robust
leader2_3_BS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -.2820474    .396774    -0.71   0.477     -1.05971    .4956154
       _cons |  -.5413951   .3236328    -1.67   0.094    -1.175704    .0929136
------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(leader2_3_BS), predict()
dy/dx w.r.t. : FES_site

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -.0853319   .1187207    -0.72   0.472    -.3180203    .1473564
------------------------------------------------------------------------------

. tab leader2_3_BS FES_site

    Female |
    leader | NGO active in village
participat |         (=1)
   ed (=1) | NGO not a  NGO activ |     Total
-----------+----------------------+----------
         0 |        12         31 |        43 
         1 |         5          8 |        13 
-----------+----------------------+----------
     Total |        17         39 |        56 

. tab leader2_3_BS FES_site, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Female |
    leader | NGO active in village
participat |         (=1)
   ed (=1) | NGO not a  NGO activ |     Total
-----------+----------------------+----------
         0 |        12         31 |        43 
           |     27.91      72.09 |    100.00 
-----------+----------------------+----------
         1 |         5          8 |        13 
           |     38.46      61.54 |    100.00 
-----------+----------------------+----------
     Total |        17         39 |        56 
           |     30.36      69.64 |    100.00 

. tab leader2_3_BS FES_site, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Female |
    leader | NGO active in village
participat |         (=1)
   ed (=1) | NGO not a  NGO activ |     Total
-----------+----------------------+----------
         0 |        12         31 |        43 
           |     70.59      79.49 |     76.79 
-----------+----------------------+----------
         1 |         5          8 |        13 
           |     29.41      20.51 |     23.21 
-----------+----------------------+----------
     Total |        17         39 |        56 
           |    100.00     100.00 |    100.00 

. reg leader2_3_BS FES_site Shar_SCST , vce(robust)

Linear regression                               Number of obs     =         56
                                                F(2, 53)          =       0.49
                                                Prob > F          =     0.6170
                                                R-squared         =     0.0158
                                                Root MSE          =     .43055

------------------------------------------------------------------------------
             |               Robust
leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -.0932712   .1315149    -0.71   0.481    -.3570566    .1705142
   Shar_SCST |   .0019503   .0032474     0.60   0.551    -.0045632    .0084638
       _cons |   .1442131   .2816067     0.51   0.611    -.4206184    .7090446
------------------------------------------------------------------------------

. reg leader2_3_BS FES_site Shar_Lit Shar_SCST , vce(robust)

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.61
                                                Prob > F          =     0.6134
                                                R-squared         =     0.0261
                                                Root MSE          =     .43238

------------------------------------------------------------------------------
             |               Robust
leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |  -.0841193   .1339314    -0.63   0.533    -.3528723    .1846336
    Shar_Lit |   .0052341   .0067785     0.77   0.444    -.0083679    .0188361
   Shar_SCST |   .0023449   .0031434     0.75   0.459    -.0039627    .0086525
       _cons |  -.1614899   .4596826    -0.35   0.727     -1.08391    .7609307
------------------------------------------------------------------------------

. reg leader2_3_BS FES_site Shar_Lit Shar_SCST No_HH , vce(robust)

Linear regression                               Number of obs     =         56
                                                F(4, 51)          =       1.54
                                                Prob > F          =     0.2059
                                                R-squared         =     0.0778
                                                Root MSE          =     .42486

------------------------------------------------------------------------------
             |               Robust
leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |   .0021954   .1553298     0.01   0.989    -.3096422     .314033
    Shar_Lit |   .0039499   .0071674     0.55   0.584    -.0104393     .018339
   Shar_SCST |    .004712   .0033503     1.41   0.166    -.0020139    .0114379
       No_HH |   .0011654   .0007421     1.57   0.122    -.0003244    .0026551
       _cons |  -.5326524   .5045032    -1.06   0.296    -1.545485      .48018
------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : FES_site Shar_Lit Shar_SCST No_HH

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |   .0021954   .1553298     0.01   0.989    -.3096422     .314033
    Shar_Lit |   .0039499   .0071674     0.55   0.584    -.0104393     .018339
   Shar_SCST |    .004712   .0033503     1.41   0.166    -.0020139    .0114379
       No_HH |   .0011654   .0007421     1.57   0.122    -.0003244    .0026551
------------------------------------------------------------------------------

. tab No_HH

    Village |
       size |
(households |
          ) |      Freq.     Percent        Cum.
------------+-----------------------------------
         24 |          1        1.20        1.20
         25 |          1        1.20        2.41
         31 |          2        2.41        4.82
         34 |          1        1.20        6.02
         40 |          1        1.20        7.23
         43 |          1        1.20        8.43
         47 |          1        1.20        9.64
         49 |          1        1.20       10.84
         57 |          1        1.20       12.05
         61 |          1        1.20       13.25
         64 |          1        1.20       14.46
         65 |          1        1.20       15.66
         73 |          1        1.20       16.87
         76 |          1        1.20       18.07
         83 |          1        1.20       19.28
         85 |          1        1.20       20.48
         87 |          1        1.20       21.69
         89 |          1        1.20       22.89
         90 |          1        1.20       24.10
         91 |          1        1.20       25.30
         95 |          1        1.20       26.51
         96 |          1        1.20       27.71
         97 |          1        1.20       28.92
        101 |          1        1.20       30.12
        104 |          2        2.41       32.53
        105 |          1        1.20       33.73
        107 |          1        1.20       34.94
        109 |          1        1.20       36.14
        110 |          1        1.20       37.35
        111 |          1        1.20       38.55
        118 |          2        2.41       40.96
        123 |          1        1.20       42.17
        129 |          1        1.20       43.37
        132 |          1        1.20       44.58
        136 |          1        1.20       45.78
        141 |          1        1.20       46.99
        146 |          1        1.20       48.19
        149 |          2        2.41       50.60
        150 |          1        1.20       51.81
        152 |          2        2.41       54.22
        156 |          1        1.20       55.42
        160 |          1        1.20       56.63
        167 |          1        1.20       57.83
        169 |          1        1.20       59.04
        170 |          2        2.41       61.45
        172 |          1        1.20       62.65
        178 |          1        1.20       63.86
        180 |          1        1.20       65.06
        183 |          1        1.20       66.27
        187 |          1        1.20       67.47
        188 |          1        1.20       68.67
        191 |          1        1.20       69.88
        193 |          1        1.20       71.08
        216 |          1        1.20       72.29
        221 |          1        1.20       73.49
        222 |          1        1.20       74.70
        228 |          1        1.20       75.90
        236 |          1        1.20       77.11
        244 |          1        1.20       78.31
        250 |          1        1.20       79.52
        255 |          1        1.20       80.72
        256 |          1        1.20       81.93
        264 |          1        1.20       83.13
        283 |          1        1.20       84.34
        294 |          1        1.20       85.54
        302 |          1        1.20       86.75
        305 |          1        1.20       87.95
        329 |          1        1.20       89.16
        335 |          1        1.20       90.36
        356 |          1        1.20       91.57
        364 |          1        1.20       92.77
        410 |          1        1.20       93.98
        418 |          2        2.41       96.39
        432 |          1        1.20       97.59
        633 |          2        2.41      100.00
------------+-----------------------------------
      Total |         83      100.00

. gen no_hh100 = No_HH/100
(1 missing value generated)

. reg leader2_3_BS FES_site Shar_Lit Shar_SCST no_hh100 , vce(robust)

Linear regression                               Number of obs     =         56
                                                F(4, 51)          =       1.54
                                                Prob > F          =     0.2059
                                                R-squared         =     0.0778
                                                Root MSE          =     .42486

------------------------------------------------------------------------------
             |               Robust
leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |   .0021954   .1553298     0.01   0.989    -.3096422     .314033
    Shar_Lit |   .0039499   .0071674     0.55   0.584    -.0104393     .018339
   Shar_SCST |    .004712   .0033503     1.41   0.166    -.0020139    .0114379
    no_hh100 |   .1165368   .0742064     1.57   0.122    -.0324387    .2655123
       _cons |  -.5326524   .5045032    -1.06   0.296    -1.545485      .48018
------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : FES_site Shar_Lit Shar_SCST no_hh100

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    FES_site |   .0021954   .1553298     0.01   0.989    -.3096422     .314033
    Shar_Lit |   .0039499   .0071674     0.55   0.584    -.0104393     .018339
   Shar_SCST |    .004712   .0033503     1.41   0.166    -.0020139    .0114379
    no_hh100 |   .1165368   .0742064     1.57   0.122    -.0324387    .2655123
------------------------------------------------------------------------------

. tab share_female_percent3_BS

 Non-leader |
     female |
participant |
 s (in 10%) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       12.50       12.50
   .7142857 |          5        8.93       21.43
   1.428571 |          8       14.29       35.71
   2.142857 |         11       19.64       55.36
   2.857143 |          7       12.50       67.86
   3.571429 |         10       17.86       85.71
   4.285714 |          4        7.14       92.86
          5 |          2        3.57       96.43
   6.428571 |          1        1.79       98.21
   9.285714 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tabtab share_no_leader_male_vill_BS
command tabtab is unrecognized
r(199);

. tab share_no_leader_male_vill_BS

          0 |
share_no_le |
ader_male_v |
       ill_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.79        1.79
   .3571429 |          1        1.79        3.57
   .4285714 |          3        5.36        8.93
         .5 |          9       16.07       25.00
   .5714286 |          6       10.71       35.71
   .6428571 |         15       26.79       62.50
   .7142857 |          8       14.29       76.79
   .7857143 |          6       10.71       87.50
   .8571429 |          3        5.36       92.86
   .9285714 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_male_vill

Sum of male |
 leaders in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       37.50       37.50
          1 |         19       33.93       71.43
          2 |          9       16.07       87.50
          3 |          2        3.57       91.07
          4 |          3        5.36       96.43
          5 |          1        1.79       98.21
          6 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab survey_maint_rule_BS

  Baseline: |
Maintenance |
  rule (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         71       84.52       84.52
          1 |         13       15.48      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab survey_maint_rule_FS survey_maint_rule_BS

  Endline: |
Maintenanc | Baseline: Maintenance
    e rule |       rule (=1)
      (=1) |         0          1 |     Total
-----------+----------------------+----------
         0 |        50          8 |        58 
         1 |        21          5 |        26 
-----------+----------------------+----------
     Total |        71         13 |        84 

. tab  survey_maint_rule_BS

  Baseline: |
Maintenance |
  rule (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         71       84.52       84.52
          1 |         13       15.48      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab survey_maint_rule_FS

   Endline: |
Maintenance |
  rule (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         58       69.05       69.05
          1 |         26       30.95      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab survey_rules_maint_all_BS

  BS: There |
  are rules |
     by the |
  community |
    for dam |
maintenance |
          ? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         61       74.39       74.39
          1 |         21       25.61      100.00
------------+-----------------------------------
      Total |         82      100.00

. tab survey_rules_maint_BS

  BS: There |
    are dam |
maintenance |
      rules |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         69       84.15       84.15
          1 |         13       15.85      100.00
------------+-----------------------------------
      Total |         82      100.00

. tab survey_rules_extr_maint_BS

  BS: There |
        are |
maintenance |
rules/pract |
   ices for |
      water |
 etxraction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82      100.00      100.00
------------+-----------------------------------
      Total |         82      100.00

. tab survey_rules_extr_maint_FS

  FS: There |
        are |
maintenance |
rules/pract |
   ices for |
      water |
 etxraction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         84      100.00      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab census_tribes_total

    Census: |
      Total |
  scheduled |
     tribes |
 population |
 of village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.27        1.27
         62 |          1        1.27        2.53
         85 |          1        1.27        3.80
         94 |          2        2.53        6.33
         95 |          1        1.27        7.59
        100 |          1        1.27        8.86
        115 |          1        1.27       10.13
        117 |          1        1.27       11.39
        125 |          1        1.27       12.66
        127 |          1        1.27       13.92
        147 |          1        1.27       15.19
        154 |          1        1.27       16.46
        166 |          1        1.27       17.72
        169 |          1        1.27       18.99
        191 |          1        1.27       20.25
        192 |          2        2.53       22.78
        193 |          1        1.27       24.05
        222 |          1        1.27       25.32
        232 |          1        1.27       26.58
        233 |          1        1.27       27.85
        266 |          1        1.27       29.11
        272 |          1        1.27       30.38
        286 |          1        1.27       31.65
        299 |          1        1.27       32.91
        300 |          1        1.27       34.18
        303 |          1        1.27       35.44
        304 |          2        2.53       37.97
        307 |          1        1.27       39.24
        310 |          1        1.27       40.51
        312 |          1        1.27       41.77
        337 |          1        1.27       43.04
        357 |          1        1.27       44.30
        358 |          1        1.27       45.57
        371 |          1        1.27       46.84
        374 |          1        1.27       48.10
        382 |          1        1.27       49.37
        390 |          1        1.27       50.63
        393 |          1        1.27       51.90
        422 |          1        1.27       53.16
        428 |          2        2.53       55.70
        440 |          1        1.27       56.96
        444 |          1        1.27       58.23
        454 |          1        1.27       59.49
        455 |          1        1.27       60.76
        458 |          1        1.27       62.03
        473 |          1        1.27       63.29
        483 |          1        1.27       64.56
        492 |          1        1.27       65.82
        493 |          1        1.27       67.09
        508 |          1        1.27       68.35
        540 |          1        1.27       69.62
        544 |          1        1.27       70.89
        555 |          1        1.27       72.15
        581 |          1        1.27       73.42
        586 |          1        1.27       74.68
        641 |          1        1.27       75.95
        642 |          1        1.27       77.22
        645 |          1        1.27       78.48
        656 |          1        1.27       79.75
        667 |          1        1.27       81.01
        677 |          1        1.27       82.28
        687 |          1        1.27       83.54
        715 |          1        1.27       84.81
        738 |          1        1.27       86.08
        766 |          1        1.27       87.34
        868 |          1        1.27       88.61
        915 |          1        1.27       89.87
        944 |          1        1.27       91.14
        994 |          1        1.27       92.41
       1079 |          1        1.27       93.67
       1086 |          1        1.27       94.94
       1149 |          1        1.27       96.20
       1202 |          1        1.27       97.47
       1337 |          1        1.27       98.73
       1561 |          1        1.27      100.00
------------+-----------------------------------
      Total |         79      100.00

. tab census_tribes_males

    Census: |
 Total male |
  scheduled |
     tribes |
 population |
 of village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.27        1.27
         30 |          1        1.27        2.53
         44 |          1        1.27        3.80
         45 |          1        1.27        5.06
         48 |          1        1.27        6.33
         51 |          1        1.27        7.59
         52 |          1        1.27        8.86
         55 |          1        1.27       10.13
         59 |          1        1.27       11.39
         60 |          1        1.27       12.66
         63 |          1        1.27       13.92
         70 |          1        1.27       15.19
         81 |          1        1.27       16.46
         82 |          1        1.27       17.72
         88 |          1        1.27       18.99
         93 |          1        1.27       20.25
         97 |          2        2.53       22.78
        105 |          1        1.27       24.05
        112 |          1        1.27       25.32
        115 |          1        1.27       26.58
        118 |          1        1.27       27.85
        121 |          1        1.27       29.11
        138 |          1        1.27       30.38
        139 |          1        1.27       31.65
        142 |          1        1.27       32.91
        145 |          1        1.27       34.18
        147 |          1        1.27       35.44
        148 |          1        1.27       36.71
        150 |          1        1.27       37.97
        156 |          3        3.80       41.77
        160 |          2        2.53       44.30
        161 |          1        1.27       45.57
        180 |          1        1.27       46.84
        181 |          1        1.27       48.10
        188 |          1        1.27       49.37
        199 |          2        2.53       51.90
        207 |          1        1.27       53.16
        209 |          1        1.27       54.43
        210 |          1        1.27       55.70
        212 |          1        1.27       56.96
        215 |          1        1.27       58.23
        217 |          1        1.27       59.49
        218 |          1        1.27       60.76
        222 |          1        1.27       62.03
        233 |          1        1.27       63.29
        234 |          1        1.27       64.56
        235 |          1        1.27       65.82
        242 |          1        1.27       67.09
        243 |          1        1.27       68.35
        262 |          1        1.27       69.62
        276 |          2        2.53       72.15
        278 |          1        1.27       73.42
        282 |          1        1.27       74.68
        300 |          1        1.27       75.95
        310 |          1        1.27       77.22
        317 |          1        1.27       78.48
        321 |          1        1.27       79.75
        331 |          1        1.27       81.01
        334 |          1        1.27       82.28
        337 |          1        1.27       83.54
        349 |          1        1.27       84.81
        353 |          1        1.27       86.08
        370 |          1        1.27       87.34
        401 |          1        1.27       88.61
        437 |          1        1.27       89.87
        459 |          1        1.27       91.14
        484 |          1        1.27       92.41
        532 |          1        1.27       93.67
        544 |          1        1.27       94.94
        574 |          1        1.27       96.20
        606 |          1        1.27       97.47
        656 |          1        1.27       98.73
        768 |          1        1.27      100.00
------------+-----------------------------------
      Total |         79      100.00

. tab census_tribes_females_share

    Census: |
   Share of |
    females |
      among |
  scheduled |
     tribes |
 population |
 of village |      Freq.     Percent        Cum.
------------+-----------------------------------
   .4468085 |          1        1.28        1.28
        .45 |          1        1.28        2.56
   .4521739 |          1        1.28        3.85
    .453125 |          1        1.28        5.13
   .4631579 |          1        1.28        6.41
   .4669118 |          1        1.28        7.69
    .474026 |          1        1.28        8.97
   .4792899 |          1        1.28       10.26
   .4823529 |          1        1.28       11.54
   .4871795 |          1        1.28       12.82
   .4879121 |          1        1.28       14.10
   .4888889 |          1        1.28       15.38
   .4897436 |          1        1.28       16.67
   .4918567 |          1        1.28       17.95
   .4926471 |          1        1.28       19.23
   .4935622 |          1        1.28       20.51
   .4936387 |          1        1.28       21.79
   .4947526 |          1        1.28       23.08
   .4947917 |          1        1.28       24.36
   .4954955 |          1        1.28       25.64
   .4958403 |          1        1.28       26.92
   .4965438 |          1        1.28       28.21
   .4967742 |          1        1.28       29.49
   .4974093 |          1        1.28       30.77
   .4990792 |          1        1.28       32.05
   .4990991 |          1        1.28       33.33
         .5 |          2        2.56       35.90
   .5004352 |          1        1.28       37.18
   .5023256 |          1        1.28       38.46
   .5031713 |          1        1.28       39.74
   .5034965 |          1        1.28       41.03
   .5043104 |          1        1.28       42.31
   .5050167 |          1        1.28       43.59
   .5060241 |          1        1.28       44.87
   .5060976 |          1        1.28       46.15
   .5069509 |          1        1.28       47.44
   .5078534 |          1        1.28       48.72
   .5080077 |          1        1.28       50.00
   .5093458 |          1        1.28       51.28
   .5093493 |          1        1.28       52.56
   .5094787 |          1        1.28       53.85
   .5110783 |          1        1.28       55.13
   .5116823 |          1        1.28       56.41
   .5118881 |          1        1.28       57.69
   .5130785 |          1        1.28       58.97
    .513089 |          1        1.28       60.26
   .5137712 |          1        1.28       61.54
   .5138282 |          1        1.28       62.82
   .5148248 |          1        1.28       64.10
   .5160428 |          1        1.28       65.38
    .516129 |          1        1.28       66.67
   .5164474 |          1        1.28       67.95
   .5167683 |          1        1.28       69.23
   .5169713 |          1        1.28       70.51
    .517134 |          1        1.28       71.79
   .5181818 |          1        1.28       73.08
   .5187714 |          1        1.28       74.36
   .5212766 |          1        1.28       75.64
   .5216802 |          1        1.28       76.92
   .5220264 |          1        1.28       78.21
    .523622 |          1        1.28       79.49
   .5238096 |          1        1.28       80.77
   .5252225 |          1        1.28       82.05
    .525355 |          1        1.28       83.33
    .527559 |          1        1.28       84.62
       .528 |          1        1.28       85.90
   .5305677 |          1        1.28       87.18
   .5319813 |          1        1.28       88.46
   .5427632 |          1        1.28       89.74
   .5445545 |          1        1.28       91.03
   .5451128 |          1        1.28       92.31
   .5486543 |          1        1.28       93.59
   .5490196 |          1        1.28       94.87
   .5490534 |          1        1.28       96.15
   .5617486 |          1        1.28       97.44
   .5642458 |          1        1.28       98.72
   .5897436 |          1        1.28      100.00
------------+-----------------------------------
      Total |         78      100.00

. tab census_tribes_fem

    Census: |
      Total |
     female |
  scheduled |
     tribes |
 population |
 of village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.27        1.27
         32 |          1        1.27        2.53
         41 |          1        1.27        3.80
         42 |          1        1.27        5.06
         44 |          1        1.27        6.33
         45 |          1        1.27        7.59
         49 |          1        1.27        8.86
         52 |          1        1.27       10.13
         66 |          1        1.27       11.39
         67 |          1        1.27       12.66
         69 |          1        1.27       13.92
         73 |          1        1.27       15.19
         77 |          1        1.27       16.46
         81 |          1        1.27       17.72
         84 |          1        1.27       18.99
         87 |          1        1.27       20.25
         95 |          1        1.27       21.52
         96 |          1        1.27       22.78
         98 |          1        1.27       24.05
        110 |          1        1.27       25.32
        115 |          1        1.27       26.58
        117 |          1        1.27       27.85
        127 |          1        1.27       29.11
        144 |          1        1.27       30.38
        145 |          1        1.27       31.65
        150 |          1        1.27       32.91
        151 |          2        2.53       35.44
        152 |          1        1.27       36.71
        154 |          1        1.27       37.97
        157 |          1        1.27       39.24
        165 |          2        2.53       41.77
        177 |          1        1.27       43.04
        191 |          2        2.53       45.57
        193 |          1        1.27       46.84
        194 |          2        2.53       49.37
        196 |          1        1.27       50.63
        202 |          1        1.27       51.90
        215 |          1        1.27       53.16
        218 |          1        1.27       54.43
        219 |          1        1.27       55.70
        222 |          2        2.53       58.23
        228 |          1        1.27       59.49
        237 |          1        1.27       60.76
        238 |          1        1.27       62.03
        243 |          1        1.27       63.29
        249 |          1        1.27       64.56
        259 |          1        1.27       65.82
        264 |          1        1.27       67.09
        265 |          1        1.27       68.35
        266 |          1        1.27       69.62
        268 |          1        1.27       70.89
        277 |          1        1.27       72.15
        304 |          1        1.27       73.42
        319 |          1        1.27       74.68
        324 |          1        1.27       75.95
        330 |          1        1.27       77.22
        332 |          1        1.27       78.48
        339 |          1        1.27       79.75
        341 |          1        1.27       81.01
        346 |          1        1.27       82.28
        353 |          1        1.27       83.54
        366 |          1        1.27       84.81
        385 |          1        1.27       86.08
        396 |          1        1.27       87.34
        431 |          1        1.27       88.61
        485 |          1        1.27       89.87
        510 |          1        1.27       91.14
        514 |          1        1.27       92.41
        542 |          1        1.27       93.67
        547 |          1        1.27       94.94
        575 |          1        1.27       96.20
        596 |          1        1.27       97.47
        681 |          1        1.27       98.73
        793 |          1        1.27      100.00
------------+-----------------------------------
      Total |         79      100.00

. reg leader2_3_BS FES_site Shar_Lit census_tribes_females_share no_hh100 , vce(robust)

Linear regression                               Number of obs     =         56
                                                F(4, 51)          =       0.90
                                                Prob > F          =     0.4686
                                                R-squared         =     0.0583
                                                Root MSE          =     .42933

---------------------------------------------------------------------------------------------
                            |               Robust
               leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                   FES_site |  -.0225061   .1505269    -0.15   0.882    -.3247015    .2796893
                   Shar_Lit |   .0037862   .0071036     0.53   0.596    -.0104749    .0180474
census_tribes_females_share |  -1.891649    2.14224    -0.88   0.381    -6.192375    2.409077
                   no_hh100 |   .0845519   .0731944     1.16   0.253     -.062392    .2314957
                      _cons |   .8790329   1.079163     0.81   0.419    -1.287478    3.045544
---------------------------------------------------------------------------------------------

. margins, dydx(*)

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : FES_site Shar_Lit census_tribes_females_share no_hh100

---------------------------------------------------------------------------------------------
                            |            Delta-method
                            |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
                   FES_site |  -.0225061   .1505269    -0.15   0.882    -.3247015    .2796893
                   Shar_Lit |   .0037862   .0071036     0.53   0.596    -.0104749    .0180474
census_tribes_females_share |  -1.891649    2.14224    -0.88   0.381    -6.192375    2.409077
                   no_hh100 |   .0845519   .0731944     1.16   0.253     -.062392    .2314957
---------------------------------------------------------------------------------------------

. tab Shar_Lit

      Share |
literacy in |
          % |      Freq.     Percent        Cum.
------------+-----------------------------------
   33.55556 |          1        1.20        1.20
   35.53299 |          1        1.20        2.41
   36.34312 |          1        1.20        3.61
   36.51926 |          1        1.20        4.82
   37.26708 |          1        1.20        6.02
   37.30887 |          1        1.20        7.23
    37.4031 |          1        1.20        8.43
   37.51724 |          1        1.20        9.64
   38.97181 |          1        1.20       10.84
   40.72165 |          1        1.20       12.05
   41.48936 |          1        1.20       13.25
   42.41922 |          1        1.20       14.46
   42.82297 |          1        1.20       15.66
   43.13725 |          1        1.20       16.87
   43.26425 |          1        1.20       18.07
   43.44023 |          1        1.20       19.28
   43.49315 |          1        1.20       20.48
   44.44444 |          1        1.20       21.69
   45.72464 |          1        1.20       22.89
   46.66667 |          1        1.20       24.10
   46.69604 |          1        1.20       25.30
    47.2103 |          1        1.20       26.51
   47.34848 |          1        1.20       27.71
   47.39726 |          1        1.20       28.92
   47.70798 |          1        1.20       30.12
   48.06071 |          1        1.20       31.33
   48.08126 |          1        1.20       32.53
   48.12834 |          1        1.20       33.73
   48.39961 |          1        1.20       34.94
   48.79518 |          1        1.20       36.14
   48.96907 |          1        1.20       37.35
   49.19094 |          1        1.20       38.55
   49.28155 |          2        2.41       40.96
   49.90291 |          1        1.20       42.17
         50 |          1        1.20       43.37
   50.23474 |          1        1.20       44.58
   50.27933 |          1        1.20       45.78
   50.72604 |          1        1.20       46.99
    51.1811 |          1        1.20       48.19
   51.93966 |          1        1.20       49.40
   52.07469 |          1        1.20       50.60
   52.17391 |          1        1.20       51.81
   52.33083 |          1        1.20       53.01
   52.74949 |          1        1.20       54.22
   53.08311 |          1        1.20       55.42
   53.36323 |          1        1.20       56.63
   53.42466 |          1        1.20       57.83
   53.46084 |          1        1.20       59.04
    53.7601 |          1        1.20       60.24
   53.85935 |          1        1.20       61.45
   53.99061 |          1        1.20       62.65
   54.18251 |          1        1.20       63.86
       54.2 |          1        1.20       65.06
   54.51807 |          1        1.20       66.27
   54.70085 |          1        1.20       67.47
   55.02152 |          1        1.20       68.67
   55.10949 |          1        1.20       69.88
   55.31915 |          1        1.20       71.08
   55.36723 |          1        1.20       72.29
   55.57769 |          1        1.20       73.49
   55.87045 |          1        1.20       74.70
   56.12245 |          1        1.20       75.90
   56.57371 |          1        1.20       77.11
   56.68571 |          1        1.20       78.31
   56.88801 |          1        1.20       79.52
   57.83582 |          1        1.20       80.72
   58.33333 |          1        1.20       81.93
   58.76289 |          1        1.20       83.13
   58.85057 |          1        1.20       84.34
   58.93204 |          1        1.20       85.54
   59.58466 |          1        1.20       86.75
   60.55684 |          1        1.20       87.95
   61.34663 |          1        1.20       89.16
   61.47186 |          1        1.20       90.36
   62.44784 |          1        1.20       91.57
   64.72695 |          1        1.20       92.77
   65.26316 |          1        1.20       93.98
   65.54364 |          1        1.20       95.18
   67.15976 |          1        1.20       96.39
   68.21429 |          1        1.20       97.59
   69.11977 |          1        1.20       98.80
   73.15914 |          1        1.20      100.00
------------+-----------------------------------
      Total |         83      100.00

. tab d_illiterate_BS

          0 |
d_illiterat |
         e_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       58.93       58.93
          1 |         23       41.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_sum_illit_vill

     Sum of |
participant |
   that are |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       58.93       58.93
          1 |         14       25.00       83.93
          2 |          6       10.71       94.64
          3 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. hist Shar_Lit
(bin=9, start=33.555556, width=4.4003988)

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *only treated villages
. drop if treatment_BS==0
(28 observations deleted)

. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(28 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. 
. * Setting globals
. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS 

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem ($village -> leader2_3_BS) (leader2_3_BS sequence $village -> share_female_percent3_BS, )(leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_r
> ule_FS $village -> survey_maint_2017_FS, ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ), vce(robust) nocapslatent

Endogenous variables

Observed:  leader2_3_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS sequence survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1305.1047  
Iteration 1:   log pseudolikelihood = -1305.1047  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1305.1047

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader2_3_BS                 |
                         No_HH |   .0011736   .0007201     1.63   0.103    -.0002378    .0025851
                      FES_site |   .0086142   .1428612     0.06   0.952    -.2713886     .288617
                      Shar_Lit |   .0056427   .0067073     0.84   0.400    -.0075035    .0187888
                     Shar_SCST |   .0051374   .0032625     1.57   0.115    -.0012571    .0115319
  survey_dam_for_irrigation_FS |  -.1427598   .1067023    -1.34   0.181    -.3518925    .0663729
                         _cons |  -.5974518   .4667789    -1.28   0.201    -1.512322     .317418
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
                  leader2_3_BS |     1.4667   .4361627     3.36   0.001     .6118365    2.321563
                         No_HH |   -.000875   .0022406    -0.39   0.696    -.0052664    .0035165
                      FES_site |  -.3553535   .4463803    -0.80   0.426    -1.230243    .5195357
                      Shar_Lit |   .0453721   .0269041     1.69   0.092     -.007359    .0981033
                     Shar_SCST |   .0083391   .0152386     0.55   0.584    -.0215281    .0382063
  survey_dam_for_irrigation_FS |  -.2586125   .3580406    -0.72   0.470    -.9603592    .4431342
                      sequence |   .0401192   .0132749     3.02   0.003     .0141009    .0661375
                         _cons |  -1.513233   2.319178    -0.65   0.514    -6.058738    3.032272
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
                  leader2_3_BS |  -.0490874   .1575887    -0.31   0.755    -.3579557    .2597808
      share_female_percent3_BS |   .0984611   .0315147     3.12   0.002     .0366935    .1602288
                         No_HH |  -.0007113   .0007893    -0.90   0.368    -.0022583    .0008357
                      FES_site |   .1632504    .116572     1.40   0.161    -.0652266    .3917273
                      Shar_Lit |  -.0070133   .0061729    -1.14   0.256    -.0191119    .0050854
                     Shar_SCST |  -.0024439   .0038073    -0.64   0.521    -.0099061    .0050184
  survey_dam_for_irrigation_FS |  -.1121161   .1245392    -0.90   0.368    -.3562085    .1319762
          survey_maint_rule_BS |   -.003165   .1699549    -0.02   0.985    -.3362705    .3299404
                         _cons |   .6944957   .5793969     1.20   0.231    -.4411014    1.830093
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
                  leader2_3_BS |  -.0985917    .134111    -0.74   0.462    -.3614443     .164261
      share_female_percent3_BS |   .0350463   .0298397     1.17   0.240    -.0234385    .0935312
          survey_maint_rule_FS |   .2517777   .1163678     2.16   0.030     .0237011    .4798544
                         No_HH |   .0003171   .0008083     0.39   0.695    -.0012671    .0019014
                      FES_site |   .1661181   .1454955     1.14   0.254    -.1190479    .4512841
                      Shar_Lit |   .0094157   .0073716     1.28   0.201    -.0050323    .0238637
                     Shar_SCST |  -.0021449   .0039659    -0.54   0.589    -.0099178     .005628
  survey_dam_for_irrigation_FS |   .1689281   .1076548     1.57   0.117    -.0420715    .3799277
           survey_maint_12m_BS |   .0324682   .1176961     0.28   0.783    -.1982118    .2631483
                         _cons |   -.001821    .630043    -0.00   0.998    -1.236683    1.233041
-------------------------------+----------------------------------------------------------------
            var(e.leader2_3_BS)|   .1596208   .0272436                      .1142375    .2230336
var(e.share_female_percent3_BS)|   1.946461   .4293975                      1.263185    2.999331
    var(e.survey_maint_rule_FS)|   .1721073   .0272441                      .1261992    .2347156
    var(e.survey_maint_2017_FS)|   .1628929   .0245646                      .1212102    .2189098
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.046   Standardized root mean squared residual
                  CD |      0.441   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
             raw | -0.0   0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
    leader2_3_BS | -0.0                                                                   
    share_f~3_BS |  0.0   0.1                                                             
    survey~le_FS |  0.0   0.0   0.0                                                       
    survey_~7_FS |  0.0  -0.0   0.0   0.0                                                 
           No_HH |  0.0   0.0   0.0   0.0   0.0                                           
        FES_site | -0.0  -0.0  -0.0  -0.0   0.0   0.0                                     
        Shar_Lit | -0.0   0.0   0.0   0.0   0.0   0.0   0.0                               
       Shar_SCST | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0                         
    survey_da~FS |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                   
        sequence |  0.9   1.3  -0.5   1.1   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS |  0.0  -0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.0   0.2   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct
command te_direct is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *only treated villages
. drop if treatment_BS==0
(28 observations deleted)

. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(28 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. 
. * Setting globals
. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS 

. 
. 
. *STRUCTURAL EQUATION MODEL
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. 
. 
. *define SEM and store estimates using above programs
. sem ($village -> leader2_3_BS) (leader2_3_BS sequence $village -> share_female_percent3_BS, )(leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_r
> ule_FS $village -> survey_maint_2017_FS, ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ), vce(robust) nocapslatent

Endogenous variables

Observed:  leader2_3_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS sequence survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1305.0585  
Iteration 1:   log pseudolikelihood = -1305.0585  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1305.0585

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader2_3_BS                 |
                         No_HH |   .0011736   .0007201     1.63   0.103    -.0002378    .0025851
                      FES_site |   .0086142   .1428612     0.06   0.952    -.2713886     .288617
                      Shar_Lit |   .0056427   .0067073     0.84   0.400    -.0075035    .0187888
                     Shar_SCST |   .0051374   .0032625     1.57   0.115    -.0012571    .0115319
  survey_dam_for_irrigation_FS |  -.1427598   .1067023    -1.34   0.181    -.3518925    .0663729
                         _cons |  -.5974518   .4667789    -1.28   0.201    -1.512322     .317418
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
                  leader2_3_BS |   1.468493   .4349326     3.38   0.001     .6160409    2.320945
                         No_HH |  -.0008978    .002236    -0.40   0.688    -.0052803    .0034847
                      FES_site |  -.3567165   .4460762    -0.80   0.424     -1.23101    .5175768
                      Shar_Lit |   .0453779   .0269933     1.68   0.093     -.007528    .0982838
                     Shar_SCST |    .008301   .0152515     0.54   0.586    -.0215914    .0381934
  survey_dam_for_irrigation_FS |  -.2558747   .3584445    -0.71   0.475     -.958413    .4466637
                      sequence |   .0400752   .0133645     3.00   0.003     .0138812    .0662692
                         _cons |  -1.506175   2.327379    -0.65   0.518    -6.067754    3.055405
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
                  leader2_3_BS |  -.0490874   .1575887    -0.31   0.755    -.3579557    .2597808
      share_female_percent3_BS |   .0984611   .0315147     3.12   0.002     .0366935    .1602288
                         No_HH |  -.0007113   .0007893    -0.90   0.368    -.0022583    .0008357
                      FES_site |   .1632504    .116572     1.40   0.161    -.0652266    .3917273
                      Shar_Lit |  -.0070133   .0061729    -1.14   0.256    -.0191119    .0050854
                     Shar_SCST |  -.0024439   .0038073    -0.64   0.521    -.0099061    .0050184
  survey_dam_for_irrigation_FS |  -.1121161   .1245392    -0.90   0.368    -.3562085    .1319762
          survey_maint_rule_BS |   -.003165   .1699549    -0.02   0.985    -.3362705    .3299404
                         _cons |   .6944957   .5793969     1.20   0.231    -.4411014    1.830093
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
                  leader2_3_BS |  -.0985917    .134111    -0.74   0.462    -.3614443     .164261
      share_female_percent3_BS |   .0350463   .0298397     1.17   0.240    -.0234385    .0935312
          survey_maint_rule_FS |   .2517777   .1163678     2.16   0.030     .0237011    .4798544
                         No_HH |   .0003171   .0008083     0.39   0.695    -.0012671    .0019014
                      FES_site |   .1661181   .1454955     1.14   0.254    -.1190479    .4512841
                      Shar_Lit |   .0094157   .0073716     1.28   0.201    -.0050323    .0238637
                     Shar_SCST |  -.0021449   .0039659    -0.54   0.589    -.0099178     .005628
  survey_dam_for_irrigation_FS |   .1689281   .1076548     1.57   0.117    -.0420715    .3799277
           survey_maint_12m_BS |   .0324682   .1176961     0.28   0.783    -.1982118    .2631483
                         _cons |   -.001821    .630043    -0.00   0.998    -1.236683    1.233041
-------------------------------+----------------------------------------------------------------
            var(e.leader2_3_BS)|   .1596208   .0272436                      .1142375    .2230336
var(e.share_female_percent3_BS)|   1.948264   .4297855                      1.264368     3.00208
    var(e.survey_maint_rule_FS)|   .1721073   .0272441                      .1261992    .2347156
    var(e.survey_maint_2017_FS)|   .1628929   .0245646                      .1212102    .2189098
------------------------------------------------------------------------------------------------

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.045   Standardized root mean squared residual
                  CD |      0.440   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
             raw | -0.0  -0.0   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
    leader2_3_BS |  0.0                                                                   
    share_f~3_BS |  0.0   0.1                                                             
    survey~le_FS |  0.0   0.0   0.0                                                       
    survey_~7_FS |  0.0  -0.0   0.0   0.0                                                 
           No_HH |  0.0   0.0   0.0  -0.0   0.0                                           
        FES_site | -0.0   0.0  -0.0   0.0   0.0   0.0                                     
        Shar_Lit | -0.0   0.0   0.0  -0.0   0.0   0.0   0.0                               
       Shar_SCST |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                         
    survey_da~FS |  0.0   0.0   0.0  -0.0   0.0   0.0   0.0   0.0   0.0                   
        sequence |  0.9   1.3  -0.5   1.1   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS |  0.0  -0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.0   0.2   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. * Table S7.     Direct, indirect, and total effects from SEM
. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf)

. 
end of do-file

. bys leader2_3_BS: tab1 game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader2_3_BS = 0

-> tabulation of game_sum_leader_CR  

     Sum of |
 leaders in |
     common |
  resources |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       60.47       60.47
          1 |          7       16.28       76.74
          2 |          4        9.30       86.05
          3 |          1        2.33       88.37
          4 |          3        6.98       95.35
          5 |          1        2.33       97.67
          6 |          1        2.33      100.00
------------+-----------------------------------
      Total |         43      100.00

-> tabulation of game_sum_leader_SHG  

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43      100.00      100.00
------------+-----------------------------------
      Total |         43      100.00

-> tabulation of game_sum_leader_culturestate  

   Total of |
 leaders in |
  social or |
   cultural |
  groups in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         40       93.02       93.02
          1 |          3        6.98      100.00
------------+-----------------------------------
      Total |         43      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader2_3_BS = 1

-> tabulation of game_sum_leader_CR  

     Sum of |
 leaders in |
     common |
  resources |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       84.62       84.62
          1 |          2       15.38      100.00
------------+-----------------------------------
      Total |         13      100.00

-> tabulation of game_sum_leader_SHG  

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       46.15       46.15
          1 |          7       53.85      100.00
------------+-----------------------------------
      Total |         13      100.00

-> tabulation of game_sum_leader_culturestate  

   Total of |
 leaders in |
  social or |
   cultural |
  groups in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13      100.00      100.00
------------+-----------------------------------
      Total |         13      100.00

. tab census_population_total

    Census: |
      Total |
 population |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
         95 |          1        1.79        1.79
        102 |          1        1.79        3.57
        117 |          1        1.79        5.36
        120 |          1        1.79        7.14
        127 |          1        1.79        8.93
        161 |          1        1.79       10.71
        194 |          1        1.79       12.50
        233 |          1        1.79       14.29
        264 |          1        1.79       16.07
        268 |          1        1.79       17.86
        292 |          1        1.79       19.64
        302 |          1        1.79       21.43
        374 |          1        1.79       23.21
        394 |          1        1.79       25.00
        401 |          1        1.79       26.79
        418 |          1        1.79       28.57
        431 |          1        1.79       30.36
        435 |          1        1.79       32.14
        443 |          2        3.57       35.71
        446 |          1        1.79       37.50
        470 |          1        1.79       39.29
        482 |          1        1.79       41.07
        515 |          1        1.79       42.86
        516 |          1        1.79       44.64
        526 |          1        1.79       46.43
        583 |          1        1.79       48.21
        626 |          1        1.79       50.00
        653 |          1        1.79       51.79
        658 |          1        1.79       53.57
        665 |          1        1.79       55.36
        676 |          1        1.79       57.14
        681 |          1        1.79       58.93
        686 |          1        1.79       60.71
        693 |          1        1.79       62.50
        701 |          1        1.79       64.29
        708 |          1        1.79       66.07
        725 |          1        1.79       67.86
        730 |          1        1.79       69.64
        746 |          1        1.79       71.43
        759 |          1        1.79       73.21
        875 |          1        1.79       75.00
        895 |          1        1.79       76.79
        982 |          1        1.79       78.57
       1009 |          1        1.79       80.36
       1029 |          1        1.79       82.14
       1031 |          1        1.79       83.93
       1098 |          1        1.79       85.71
       1178 |          1        1.79       87.50
       1207 |          1        1.79       89.29
       1328 |          1        1.79       91.07
       1380 |          1        1.79       92.86
       1394 |          1        1.79       94.64
       1400 |          1        1.79       96.43
       1617 |          1        1.79       98.21
       1704 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. sum census_population_total

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
census_pop~l |         56    660.4643    400.6635         95       1704

. sum census_population_total, detail

             Census: Total population in village
-------------------------------------------------------------
      Percentiles      Smallest
 1%           95             95
 5%          117            102
10%          161            117       Obs                  56
25%        397.5            120       Sum of Wgt.          56

50%        639.5                      Mean           660.4643
                        Largest       Std. Dev.      400.6635
75%          885           1394
90%         1328           1400       Variance       160531.2
95%         1400           1617       Skewness       .7330837
99%         1704           1704       Kurtosis       2.915565

. tab No_HH

    Village |
       size |
(households |
          ) |      Freq.     Percent        Cum.
------------+-----------------------------------
         24 |          1        1.79        1.79
         25 |          1        1.79        3.57
         31 |          2        3.57        7.14
         34 |          1        1.79        8.93
         43 |          1        1.79       10.71
         57 |          1        1.79       12.50
         61 |          1        1.79       14.29
         64 |          1        1.79       16.07
         65 |          1        1.79       17.86
         76 |          1        1.79       19.64
         83 |          1        1.79       21.43
         87 |          1        1.79       23.21
         91 |          1        1.79       25.00
         95 |          1        1.79       26.79
         97 |          1        1.79       28.57
        101 |          1        1.79       30.36
        104 |          2        3.57       33.93
        110 |          1        1.79       35.71
        111 |          1        1.79       37.50
        118 |          1        1.79       39.29
        123 |          1        1.79       41.07
        132 |          1        1.79       42.86
        136 |          1        1.79       44.64
        141 |          1        1.79       46.43
        149 |          2        3.57       50.00
        150 |          1        1.79       51.79
        156 |          1        1.79       53.57
        160 |          1        1.79       55.36
        167 |          1        1.79       57.14
        169 |          1        1.79       58.93
        170 |          1        1.79       60.71
        172 |          1        1.79       62.50
        178 |          1        1.79       64.29
        180 |          1        1.79       66.07
        183 |          1        1.79       67.86
        188 |          1        1.79       69.64
        191 |          1        1.79       71.43
        221 |          1        1.79       73.21
        222 |          1        1.79       75.00
        228 |          1        1.79       76.79
        236 |          1        1.79       78.57
        250 |          1        1.79       80.36
        255 |          1        1.79       82.14
        256 |          1        1.79       83.93
        264 |          1        1.79       85.71
        294 |          1        1.79       87.50
        302 |          1        1.79       89.29
        305 |          1        1.79       91.07
        329 |          1        1.79       92.86
        335 |          1        1.79       94.64
        364 |          1        1.79       96.43
        410 |          1        1.79       98.21
        418 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. sum No_HH

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418

. sum No_HH, detail

                  Village size (households)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           24             24
 5%           31             25
10%           43             31       Obs                  56
25%           93             31       Sum of Wgt.          56

50%        149.5                      Mean           164.1964
                        Largest       Std. Dev.      98.70736
75%          225            335
90%          305            364       Variance       9743.143
95%          364            410       Skewness       .7249131
99%          418            418       Kurtosis       2.924344

. pwcorr census_no_hh game_sum_leader_no

             | census~h game_s~o
-------------+------------------
census_no_hh |   1.0000 
game_sum_l~o |   0.0776   1.0000 

. pwcorr census_no_hh game_sum_leader_no, sig

             | census~h game_s~o
-------------+------------------
census_no_hh |   1.0000 
             |
             |
game_sum_l~o |   0.0776   1.0000 
             |   0.5697
             |

. tab game_sum_leader_state

   Total of |
 leaders in |
   state or |
  political |
position in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         32       57.14       57.14
          1 |         16       28.57       85.71
          2 |          4        7.14       92.86
          3 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_sum_leader_state

   Total of |
 leaders in |
   state or |
  political |
position in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         32       57.14       57.14
          1 |         16       28.57       85.71
          2 |          4        7.14       92.86
          3 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab leader2_3_BS

     Female |
     leader |
participate |
     d (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43       76.79       76.79
          1 |         13       23.21      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem ($village sequence -> leader2_3_BS) (leader2_3_BS sequence $village -> share_female_percent3_BS, )(leader2_3_BS share_female_percent3_BS survey_maint_12m_BS surve
> y_maint_rule_FS $village -> survey_maint_2017_FS, ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ), vce(robust) nocap
> slatent

Endogenous variables

Observed:  leader2_3_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS sequence survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -1304.345  
Iteration 1:   log pseudolikelihood =  -1304.345  (backed up)

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -1304.345

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader2_3_BS                 |
                         No_HH |   .0009727   .0007817     1.24   0.213    -.0005594    .0025048
                      FES_site |  -.0357995   .1436534    -0.25   0.803     -.317355     .245756
                      Shar_Lit |   .0071485   .0066595     1.07   0.283    -.0059038    .0202008
                     Shar_SCST |   .0053434   .0032651     1.64   0.102    -.0010561    .0117429
  survey_dam_for_irrigation_FS |  -.1003434   .1204596    -0.83   0.405    -.3364398     .135753
                      sequence |    .004467   .0039843     1.12   0.262    -.0033422    .0122761
                         _cons |  -.7723838   .4778279    -1.62   0.106    -1.708909    .1641417
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
                  leader2_3_BS |   1.468493   .4349326     3.38   0.001     .6160409    2.320945
                         No_HH |  -.0008978    .002236    -0.40   0.688    -.0052803    .0034847
                      FES_site |  -.3567165   .4460762    -0.80   0.424     -1.23101    .5175768
                      Shar_Lit |   .0453779   .0269933     1.68   0.093     -.007528    .0982838
                     Shar_SCST |    .008301   .0152515     0.54   0.586    -.0215914    .0381934
  survey_dam_for_irrigation_FS |  -.2558747   .3584445    -0.71   0.475     -.958413    .4466637
                      sequence |   .0400752   .0133645     3.00   0.003     .0138812    .0662692
                         _cons |  -1.506175   2.327379    -0.65   0.518    -6.067754    3.055405
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
                  leader2_3_BS |  -.0490874   .1575887    -0.31   0.755    -.3579557    .2597808
      share_female_percent3_BS |   .0984611   .0315147     3.12   0.002     .0366935    .1602288
                         No_HH |  -.0007113   .0007893    -0.90   0.368    -.0022583    .0008357
                      FES_site |   .1632504    .116572     1.40   0.161    -.0652266    .3917273
                      Shar_Lit |  -.0070133   .0061729    -1.14   0.256    -.0191119    .0050854
                     Shar_SCST |  -.0024439   .0038073    -0.64   0.521    -.0099061    .0050184
  survey_dam_for_irrigation_FS |  -.1121161   .1245392    -0.90   0.368    -.3562085    .1319762
          survey_maint_rule_BS |   -.003165   .1699549    -0.02   0.985    -.3362705    .3299404
                         _cons |   .6944957   .5793969     1.20   0.231    -.4411014    1.830093
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
                  leader2_3_BS |  -.0985917    .134111    -0.74   0.462    -.3614443     .164261
      share_female_percent3_BS |   .0350463   .0298397     1.17   0.240    -.0234385    .0935312
          survey_maint_rule_FS |   .2517777   .1163678     2.16   0.030     .0237011    .4798544
                         No_HH |   .0003171   .0008083     0.39   0.695    -.0012671    .0019014
                      FES_site |   .1661181   .1454955     1.14   0.254    -.1190479    .4512841
                      Shar_Lit |   .0094157   .0073716     1.28   0.201    -.0050323    .0238637
                     Shar_SCST |  -.0021449   .0039659    -0.54   0.589    -.0099178     .005628
  survey_dam_for_irrigation_FS |   .1689281   .1076548     1.57   0.117    -.0420715    .3799277
           survey_maint_12m_BS |   .0324682   .1176961     0.28   0.783    -.1982118    .2631483
                         _cons |   -.001821    .630043    -0.00   0.998    -1.236683    1.233041
-------------------------------+----------------------------------------------------------------
            var(e.leader2_3_BS)|   .1556048   .0251175                      .1134027    .2135121
var(e.share_female_percent3_BS)|   1.948264   .4297855                      1.264368     3.00208
    var(e.survey_maint_rule_FS)|   .1721073   .0272441                      .1261992    .2347156
    var(e.survey_maint_2017_FS)|   .1628929   .0245646                      .1212102    .2189098
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.044   Standardized root mean squared residual
                  CD |      0.449   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
             raw |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | lead  shar  surv  surv  No_H  FES_  Shar  Shar  surv  sequ  surv  surv 
    -------------+------------------------------------------------------------------------
    leader2_3_BS |  0.0                                                                   
    share_f~3_BS |  0.0   0.0                                                             
    survey~le_FS | -0.0  -0.0  -0.0                                                       
    survey_~7_FS | -0.0  -0.0   0.0   0.0                                                 
           No_HH |  0.0   0.0  -0.0  -0.0   0.0                                           
        FES_site | -0.0   0.0   0.0   0.0   0.0   0.0                                     
        Shar_Lit |  0.0   0.0  -0.0  -0.0   0.0   0.0   0.0                               
       Shar_SCST | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0                         
    survey_da~FS | -0.0   0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0                   
        sequence |  0.0   0.0  -0.6   1.1   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS | -0.0  -0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.0   0.2   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
end of do-file

. tab treatment_BS

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab treatment_BS, nolab

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         28       33.33       33.33
          1 |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. reg survey_maint_2017_FS survey_maint_12m_BS survey_maint_rule_FS $village if treatment_BS, vce(robust) 

Linear regression                               Number of obs     =         56
                                                F(7, 48)          =       1.96
                                                Prob > F          =     0.0798
                                                R-squared         =     0.1884
                                                Root MSE          =      .4396

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .0222038   .1286606     0.17   0.864    -.2364856    .2808933
        survey_maint_rule_FS |   .2899449   .1125042     2.58   0.013     .0637402    .5161497
                       No_HH |   .0003243   .0008271     0.39   0.697    -.0013387    .0019874
                    FES_site |   .1633879   .1582119     1.03   0.307    -.1547185    .4814943
                    Shar_Lit |   .0103483   .0076714     1.35   0.184     -.005076    .0257726
                   Shar_SCST |  -.0021097    .004005    -0.53   0.601    -.0101624    .0059429
survey_dam_for_irrigation_FS |   .1615124   .1199136     1.35   0.184      -.07959    .4026148
                       _cons |   .0076701   .6495255     0.01   0.991    -1.298288    1.313629
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS survey_maint_12m_BS survey_maint_rule_FS $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(7, 19)          =       8.87
                                                Prob > F          =     0.0001
                                                R-squared         =     0.4420
                                                Root MSE          =     .44491

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
         survey_maint_12m_BS |   .7106261   .1461528     4.86   0.000     .4047247    1.016527
        survey_maint_rule_FS |  -.1041274   .2218561    -0.47   0.644    -.5684777    .3602228
                       No_HH |   -.000624   .0007491    -0.83   0.415    -.0021919    .0009439
                    FES_site |  -.2125648    .186894    -1.14   0.270    -.6037384    .1786088
                    Shar_Lit |  -.0097309   .0124411    -0.78   0.444    -.0357705    .0163086
                   Shar_SCST |  -.0069237   .0045467    -1.52   0.144    -.0164401    .0025927
survey_dam_for_irrigation_FS |  -.4187517   .1851732    -2.26   0.036    -.8063238   -.0311797
                       _cons |   1.555906   .7137273     2.18   0.042     .0620579    3.049755
----------------------------------------------------------------------------------------------

. 
end of do-file

. tab FES_site

    NGO active in village |
                     (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         33       39.29       39.29
    NGO active in village |         51       60.71      100.00
--------------------------+-----------------------------------
                    Total |         84      100.00

. bys treatment_BS: sum no_HH FES_site Shar_Lit Shar_SCST

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control
variable no_HH not found
r(111);

. bys treatment_BS: sum No_HH FES_site Shar_Lit Shar_SCST

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         27    198.2222    163.1918         40        633
    FES_site |         28    .4285714    .5039526          0          1
    Shar_Lit |         27    51.74044    8.389528   33.55556   73.15914
   Shar_SCST |         27    76.31058    23.12849   16.90491        100

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         56    164.1964    98.70736         24        418
    FES_site |         56    .6964286    .4639609          0          1
    Shar_Lit |         56    51.27821    8.432409   35.53299   69.11977
   Shar_SCST |         56     78.3905    17.44676   34.62658        100


. bys treatment_BS: tab survey_dam_for_irrigation_FS

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

   Dam used |
        for |
 irrigation |
       (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         18       64.29       64.29
          1 |         10       35.71      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

   Dam used |
        for |
 irrigation |
       (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         32       57.14       57.14
          1 |         24       42.86      100.00
------------+-----------------------------------
      Total |         56      100.00


. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST  

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS survey_maint_12m_BS survey_maint_rule_FS $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       8.03
                                                Prob > F          =     0.0002
                                                R-squared         =     0.3496
                                                Root MSE          =      .4682

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
 survey_maint_12m_BS |   .5111993   .1834444     2.79   0.011      .128541    .8938577
survey_maint_rule_FS |  -.1045498   .2420513    -0.43   0.670    -.6094601    .4003604
               No_HH |  -.0009441   .0007235    -1.30   0.207    -.0024532     .000565
            FES_site |  -.1611916   .1979099    -0.81   0.425    -.5740243    .2516412
            Shar_Lit |  -.0086011   .0151478    -0.57   0.576     -.040199    .0229967
           Shar_SCST |   -.009054      .0045    -2.01   0.058    -.0184409    .0003329
               _cons |   1.657172   .8418194     1.97   0.063    -.0988323    3.413177
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  survey_maint_rule_FS $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(5, 21)          =       1.41
                                                Prob > F          =     0.2596
                                                R-squared         =     0.1375
                                                Root MSE          =     .52618

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
survey_maint_rule_FS |  -.1579486   .2224019    -0.71   0.485    -.6204587    .3045615
               No_HH |  -.0004985   .0007554    -0.66   0.516    -.0020695    .0010724
            FES_site |  -.2384544   .2276633    -1.05   0.307    -.7119061    .2349973
            Shar_Lit |   .0010621   .0132916     0.08   0.937    -.0265793    .0287036
           Shar_SCST |   -.005835   .0053333    -1.09   0.286    -.0169263    .0052563
               _cons |   1.117548   .8482127     1.32   0.202    -.6464071    2.881502
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS   $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(4, 22)          =       0.88
                                                Prob > F          =     0.4936
                                                R-squared         =     0.1204
                                                Root MSE          =     .51914

------------------------------------------------------------------------------
             |               Robust
survey_~7_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |  -.0003937   .0007611    -0.52   0.610     -.001972    .0011846
    FES_site |  -.2076087   .2244453    -0.92   0.365    -.6730798    .2578625
    Shar_Lit |  -.0003252   .0118272    -0.03   0.978    -.0248533     .024203
   Shar_SCST |   -.005786   .0053669    -1.08   0.293    -.0169163    .0053443
       _cons |    1.11015   .8273853     1.34   0.193    -.6057417    2.826042
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS survey_maint_rule_FS $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(5, 21)          =       1.41
                                                Prob > F          =     0.2596
                                                R-squared         =     0.1375
                                                Root MSE          =     .52618

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
survey_maint_rule_FS |  -.1579486   .2224019    -0.71   0.485    -.6204587    .3045615
               No_HH |  -.0004985   .0007554    -0.66   0.516    -.0020695    .0010724
            FES_site |  -.2384544   .2276633    -1.05   0.307    -.7119061    .2349973
            Shar_Lit |   .0010621   .0132916     0.08   0.937    -.0265793    .0287036
           Shar_SCST |   -.005835   .0053333    -1.09   0.286    -.0169263    .0052563
               _cons |   1.117548   .8482127     1.32   0.202    -.6464071    2.881502
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(4, 22)          =       0.83
                                                Prob > F          =     0.5223
                                                R-squared         =     0.1113
                                                Root MSE          =     .45767

------------------------------------------------------------------------------
             |               Robust
survey~le_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |  -.0006636   .0004534    -1.46   0.157    -.0016038    .0002767
    FES_site |  -.1952898   .1829612    -1.07   0.297    -.5747282    .1841486
    Shar_Lit |   .0087831   .0124327     0.71   0.487    -.0170008    .0345669
   Shar_SCST |  -.0003104   .0038708    -0.08   0.937     -.008338    .0077172
       _cons |   .0468337   .7555772     0.06   0.951    -1.520137    1.613805
------------------------------------------------------------------------------

. 
end of do-file

. tab census_gov_school_middle

    Census: |
  Number of |
govt middle |
    schools |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         51       64.56       64.56
          1 |         28       35.44      100.00
------------+-----------------------------------
      Total |         79      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  census_gov_school_middle $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         23
                                                F(5, 17)          =       0.57
                                                Prob > F          =     0.7250
                                                R-squared         =     0.1104
                                                Root MSE          =     .54385

------------------------------------------------------------------------------------------
                         |               Robust
    survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
census_gov_school_middle |   .0197033    .271733     0.07   0.943    -.5536033    .5930099
                   No_HH |    .000186   .0007892     0.24   0.816    -.0014791    .0018511
                FES_site |  -.2654435   .2608029    -1.02   0.323    -.8156896    .2848026
                Shar_Lit |  -.0052741    .013097    -0.40   0.692    -.0329062    .0223581
               Shar_SCST |  -.0022446   .0056526    -0.40   0.696    -.0141706    .0096814
                   _cons |   1.079523   .8251203     1.31   0.208    -.6613284    2.820375
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  census_gov_school_middle census_gov_school_prim census_gov_school_sec census_priv_school_middle census_priv_school_prim census_priv_school_s
> ec $village if treatment_BS==0, vce(robust) 
note: census_priv_school_sec omitted because of collinearity

Linear regression                               Number of obs     =         23
                                                F(8, 13)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2877
                                                Root MSE          =     .55652

-------------------------------------------------------------------------------------------
                          |               Robust
     survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
 census_gov_school_middle |   -.185615   .3873343    -0.48   0.640      -1.0224    .6511698
   census_gov_school_prim |   .1135394   .1902148     0.60   0.561    -.2973947    .5244735
    census_gov_school_sec |   -.428192   .6194134    -0.69   0.502    -1.766353    .9099693
census_priv_school_middle |   .1504229    .522059     0.29   0.778    -.9774171    1.278263
  census_priv_school_prim |   .6521411   .2461357     2.65   0.020     .1203973    1.183885
   census_priv_school_sec |          0  (omitted)
                    No_HH |   .0010571   .0015237     0.69   0.500    -.0022346    .0043488
                 FES_site |  -.2215065   .2790905    -0.79   0.442    -.8244448    .3814318
                 Shar_Lit |   .0013282   .0173386     0.08   0.940    -.0361296     .038786
                Shar_SCST |  -.0054081   .0063602    -0.85   0.411    -.0191486    .0083323
                    _cons |   .6926229   .9376545     0.74   0.473    -1.333057    2.718302
-------------------------------------------------------------------------------------------

. 
end of do-file

. tab census_priv_school_prim

    Census: |
  Number of |
    private |
    primary |
    schools |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         73       92.41       92.41
          1 |          6        7.59      100.00
------------+-----------------------------------
      Total |         79      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. egen school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. egen school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
end of do-file

. tab1 school_gov school_priv

-> tabulation of school_gov  

 school_gov |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         37       44.05       55.95
          2 |         26       30.95       86.90
          3 |          5        5.95       92.86
          4 |          5        5.95       98.81
          7 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of school_priv  

school_priv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          6        7.14       98.81
          2 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab school_gov school_priv

           |           school_priv
school_gov |         0          1          2 |     Total
-----------+---------------------------------+----------
         0 |         9          1          0 |        10 
         1 |        33          4          0 |        37 
         2 |        24          1          1 |        26 
         3 |         5          0          0 |         5 
         4 |         5          0          0 |         5 
         7 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |        77          6          1 |        84 

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST  school_gov school_priv

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       2.91
                                                Prob > F          =     0.0330
                                                R-squared         =     0.2942
                                                Root MSE          =     .48772

------------------------------------------------------------------------------
             |               Robust
survey_~7_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |  -.0004479    .000717    -0.62   0.539    -.0019436    .0010478
    FES_site |  -.1351223   .2415512    -0.56   0.582    -.6389893    .3687446
    Shar_Lit |   .0024996   .0120368     0.21   0.838    -.0226086    .0276079
   Shar_SCST |  -.0048833   .0056445    -0.87   0.397    -.0166575     .006891
  school_gov |    .099354   .0471197     2.11   0.048     .0010639     .197644
 school_priv |   .3840119   .1847793     2.08   0.051    -.0014311    .7694548
       _cons |   .6695504   .9001293     0.74   0.466    -1.208086    2.547187
------------------------------------------------------------------------------

. reg survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       0.67
                                                Prob > F          =     0.6766
                                                R-squared         =     0.1234
                                                Root MSE          =     .47672

------------------------------------------------------------------------------
             |               Robust
survey~le_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       No_HH |   -.000618   .0005767    -1.07   0.297     -.001821    .0005849
    FES_site |  -.2089584   .1967114    -1.06   0.301    -.6192911    .2013744
    Shar_Lit |   .0082814   .0132814     0.62   0.540    -.0194232    .0359859
   Shar_SCST |  -.0006284   .0041145    -0.15   0.880    -.0092112    .0079544
  school_gov |  -.0287555   .0469349    -0.61   0.547      -.12666    .0691489
 school_priv |  -.0746117   .1817614    -0.41   0.686    -.4537595     .304536
       _cons |   .1477664   .8233757     0.18   0.859    -1.569765    1.865298
------------------------------------------------------------------------------

. 
end of do-file

. tab school_gov

 school_gov |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         37       44.05       55.95
          2 |         26       30.95       86.90
          3 |          5        5.95       92.86
          4 |          5        5.95       98.81
          7 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab school_priv

school_priv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          6        7.14       98.81
          2 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. (leader2_3_BS sequence $village school_gov school_priv -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS school_gov school_priv -> survey_maint_2
> 017_FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village  school_gov school_priv-> survey_maint_rule_FS, ) , vce(robust) nocapslatent
( is not a valid command name
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS sequence $village school_gov school_priv -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS school_gov school_priv -> survey_mai
> nt_2017_FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village  school_gov school_priv-> survey_maint_rule_FS, ) , vce(robust) nocapslatent
variable sequence not found;
Perhaps you meant 'sequence' to specify a latent variable.
For 'sequence' to be a valid latent variable specification, 'sequence' must appear in the latent() option.
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS sequence $village school_gov school_priv -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS school_gov school_priv -> survey_mai
> nt_2017_FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village  school_gov school_priv-> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) 
> nocapslatent
variable sequence not found;
Perhaps you meant 'sequence' to specify a latent variable.
For 'sequence' to be a valid latent variable specification, 'sequence' must appear in the latent() option.
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS  $village school_gov school_priv -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS school_gov school_priv -> survey_maint_2017_
> FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village  school_gov school_priv-> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) nocapsla
> tent

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST school_gov school_priv survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1074.2014  
Iteration 1:   log pseudolikelihood = -1074.2014  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1074.2014

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.945846   .5580362     3.49   0.000     .8521155    3.039577
                         No_HH |   .0017332   .0031286     0.55   0.580    -.0043987    .0078652
                      FES_site |   .0616297   .4475453     0.14   0.890     -.815543    .9388024
                      Shar_Lit |   .0165485    .024594     0.67   0.501    -.0316549    .0647519
                     Shar_SCST |   .0029057    .016782     0.17   0.863    -.0299864    .0357977
                    school_gov |  -.1963872   .2599913    -0.76   0.450    -.7059607    .3131863
                   school_priv |   .3025175    .920353     0.33   0.742    -1.501341    2.106376
                         _cons |   .8909214   1.978908     0.45   0.653    -2.987666    4.769509
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0466209   .0285254     1.63   0.102    -.0092878    .1025296
                  leader2_3_BS |   .0147763   .1299109     0.11   0.909    -.2398443    .2693969
                    school_gov |  -.1497999   .0583959    -2.57   0.010    -.2642539   -.0353459
                   school_priv |   .2264193   .0738852     3.06   0.002      .081607    .3712316
                         _cons |   .8239339   .1329232     6.20   0.000     .5634092    1.084459
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .1022859   .0304505     3.36   0.001      .042604    .1619678
                  leader2_3_BS |   .0302528   .1813799     0.17   0.868    -.3252452    .3857508
                         No_HH |  -.0002684   .0009159    -0.29   0.769    -.0020634    .0015266
                      FES_site |    .160011   .1135414     1.41   0.159    -.0625261    .3825481
                      Shar_Lit |  -.0104519   .0066104    -1.58   0.114    -.0234079    .0025042
                     Shar_SCST |  -.0029182   .0036448    -0.80   0.423     -.010062    .0042255
                    school_gov |   -.091656   .0788329    -1.16   0.245    -.2461656    .0628537
                   school_priv |  -.0862631    .179215    -0.48   0.630     -.437518    .2649917
          survey_maint_rule_BS |   -.030071   .1693219    -0.18   0.859     -.361936    .3017939
                         _cons |   .9206561   .5963452     1.54   0.123    -.2481591    2.089471
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.318522   .5794565                       1.42061    3.783971
    var(e.survey_maint_2017_FS)|   .1722746   .0270226                      .1266787     .234282
    var(e.survey_maint_rule_FS)|   .1698802   .0246195                      .1278746    .2256842
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.050   Standardized root mean squared residual
                  CD |      0.422   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  scho  scho  surv 
    -------------+------------------------------------------------------------------
             raw | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  scho  scho  surv 
    -------------+------------------------------------------------------------------
    share_f~3_BS | -0.0                                                             
    survey_~7_FS |  0.0   0.0                                                       
    survey~le_FS | -0.0   0.0  -0.0                                                 
    leader2_3_BS | -0.0   0.0   0.0   0.0                                           
           No_HH | -0.0   8.9  -0.0   0.0   0.0                                     
        FES_site |  0.0   0.0   0.0   0.0   0.0   0.0                               
        Shar_Lit |  0.0   0.5   0.0   0.0   0.0   0.0   0.0                         
       Shar_SCST | -0.0  -1.4   0.0   0.0   0.0   0.0   0.0   0.0                   
      school_gov |  0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
     school_priv | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.1  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. * Table S7.     Direct, indirect, and total effects from SEM
. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf)

. 
. 
end of do-file

. tab school_priv

school_priv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          6        7.14       98.81
          2 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab1 census_priv_school_middle census_priv_school_prim census_priv_school_sec

-> tabulation of census_priv_school_middle  

    Census: |
  Number of |
    private |
     middle |
    schools |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       97.47       97.47
          1 |          2        2.53      100.00
------------+-----------------------------------
      Total |         79      100.00

-> tabulation of census_priv_school_prim  

    Census: |
  Number of |
    private |
    primary |
    schools |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         73       92.41       92.41
          1 |          6        7.59      100.00
------------+-----------------------------------
      Total |         79      100.00

-> tabulation of census_priv_school_sec  

    Census: |
  Number of |
    private |
  secondary |
    schools |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         79      100.00      100.00
------------+-----------------------------------
      Total |         79      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. egen private_school = rowmax(census_priv_school_middle census_priv_school_prim census_priv_school_sec)
(5 missing values generated)

. 
end of do-file

. tab private_school

private_sch |
        ool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       91.14       91.14
          1 |          7        8.86      100.00
------------+-----------------------------------
      Total |         79      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *only treated villages
. drop if treatment_BS==0
(28 observations deleted)

. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(28 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. 
. * Setting globals
. egen private_school = rowmax(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. egen gov_school = rowmax(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. 
end of do-file

. tab private_school gov_school

private_sc |                 gov_school
      hool |         0          1          2          3 |     Total
-----------+--------------------------------------------+----------
         0 |         4         33         11          4 |        52 
         1 |         0          4          0          0 |         4 
-----------+--------------------------------------------+----------
     Total |         4         37         11          4 |        56 

. tab gov_school

 gov_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        7.14        7.14
          1 |         37       66.07       73.21
          2 |         11       19.64       92.86
          3 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

. help egen

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. egen d_public_school = 0 if n_school_gov==0
unknown egen function 0()
r(133);

end of do-file

r(133);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. gen d_public_school = 0 if n_school_gov==0
n_school_gov not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *only treated villages
. drop if treatment_BS==0
(28 observations deleted)

. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(28 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. 
. * Setting globals
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(52 missing values generated)

. replace d_public_school = 1 if f n_school_gov>0
f not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. *only treated villages
. drop if treatment_BS==0
(28 observations deleted)

. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(28 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. 
. * Setting globals
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(52 missing values generated)

. replace d_public_school = 1 if f n_school_gov>0
f not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. replace d_public_school = 1 if n_school_gov>0
(52 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(4 missing values generated)

. replace d_private_school = 1 if f n_school_priv>0
f not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. replace d_private_school = 1 if n_school_priv>0
(4 real changes made)

. 
end of do-file

. tab d_public_school d_private_school

d_public_s |   d_private_school
     chool |         0          1 |     Total
-----------+----------------------+----------
         0 |         4          0 |         4 
         1 |        48          4 |        52 
-----------+----------------------+----------
     Total |        52          4 |        56 

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. * Setting globals
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. gen no_school = 0 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. * Setting globals
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. tab no_school = 0 if  d_public_school>0 | d_private_school>0
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. * created with open-source software (draw.io) based on the SEM analysis below
. * Setting globals
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. replace no_school = 0 if  d_public_school>0 | d_private_school>0
(75 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. tab1 d_public_school d_private_school no_school

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       89.29       89.29
          1 |          9       10.71      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
end of do-file

. pwcorr d_public_school d_private_school no_school

             | d_publ~l d_priv~l no_sch~l
-------------+---------------------------
d_public_s~l |   1.0000 
d_private_~l |  -0.0222   1.0000 
   no_school |  -0.9423  -0.1044   1.0000 

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST d_public_schoold_private_school

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  $village if treatment_BS==0, vce(robust) 
variable d_public_schoold_private_school not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST d_public_school d_private_school

. 
. 
. 
. reg survey_maint_2017_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =      14.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3469
                                                Root MSE          =     .46918

----------------------------------------------------------------------------------
                 |               Robust
survey_maint_2~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0001989   .0006517     0.31   0.763    -.0011605    .0015582
        FES_site |  -.1667956   .2215927    -0.75   0.460    -.6290298    .2954385
        Shar_Lit |   .0025544   .0118005     0.22   0.831     -.022061    .0271698
       Shar_SCST |  -.0042613   .0055225    -0.77   0.449     -.015781    .0072584
 d_public_school |   .3950399   .1254395     3.15   0.005     .1333777    .6567021
d_private_school |   .7121769      .1657     4.30   0.000     .3665327    1.057821
           _cons |   .3081922    .891203     0.35   0.733    -1.550825    2.167209
----------------------------------------------------------------------------------

. reg survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       0.66
                                                Prob > F          =     0.6816
                                                R-squared         =     0.1422
                                                Root MSE          =     .47159

----------------------------------------------------------------------------------
                 |               Robust
survey_main~e_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |  -.0007669   .0005132    -1.49   0.151    -.0018374    .0003036
        FES_site |  -.1847745   .1845729    -1.00   0.329    -.5697868    .2002378
        Shar_Lit |    .008972   .0123179     0.73   0.475    -.0167226    .0346666
       Shar_SCST |  -.0011583   .0039758    -0.29   0.774    -.0094517     .007135
 d_public_school |  -.2057176   .2354225    -0.87   0.393    -.6968003    .2853652
d_private_school |  -.0468067   .2323203    -0.20   0.842    -.5314185     .437805
           _cons |   .2903955   .8900093     0.33   0.748    -1.566131    2.146922
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS  $village school_gov school_priv -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_BS  ->
>  survey_maint_2017_FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village  school_gov school_priv-> survey_maint_rule_FS, ) if treatment_BS==1, v
> ce(robust) nocapslatent
variable school_gov not found;
Perhaps you meant 'school_gov' to specify a latent variable.
For 'school_gov' to be a valid latent variable specification, 'school_gov' must appear in the latent() option.
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS  $village  -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_BS  -> survey_maint_2017_FS 
> , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) nocapslatent

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST d_public_school d_private_school survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -1051.875  
Iteration 1:   log pseudolikelihood =  -1051.875  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -1051.875

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.798431   .5204532     3.46   0.001     .7783615    2.818501
                         No_HH |   .0005382   .0023395     0.23   0.818    -.0040471    .0051236
                      FES_site |   .0540402   .4679582     0.12   0.908     -.863141    .9712215
                      Shar_Lit |   .0227931   .0270407     0.84   0.399    -.0302057    .0757919
                     Shar_SCST |   .0033347   .0166844     0.20   0.842     -.029366    .0360355
               d_public_school |   .1729012   .5448301     0.32   0.751    -.8949461    1.240748
              d_private_school |   .3111241   .9319163     0.33   0.738    -1.515398    2.137646
                         _cons |   .2924988   2.168937     0.13   0.893     -3.95854    4.543537
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0617551    .029433     2.10   0.036     .0040675    .1194428
                  leader2_3_BS |  -.1441472   .1472514    -0.98   0.328    -.4327547    .1444602
           survey_maint_12m_BS |   .1115222   .1172699     0.95   0.342    -.1183226     .341367
          survey_maint_rule_BS |  -.1160932    .171886    -0.68   0.499    -.4529836    .2207971
                         _cons |   .5533521   .1206419     4.59   0.000     .3168983    .7898059
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .1063898   .0301574     3.53   0.000     .0472825    .1654971
                  leader2_3_BS |  -.0463403   .1553401    -0.30   0.765    -.3508013    .2581208
                         No_HH |  -.0008394   .0007921    -1.06   0.289    -.0023919    .0007131
                      FES_site |   .1565898   .1247089     1.26   0.209    -.0878351    .4010147
                      Shar_Lit |  -.0075378   .0061742    -1.22   0.222    -.0196389    .0045634
                     Shar_SCST |  -.0027085   .0039692    -0.68   0.495     -.010488     .005071
               d_public_school |   .0895853    .220053     0.41   0.684    -.3417106    .5208812
              d_private_school |  -.0864195   .1716204    -0.50   0.615    -.4227893    .2499504
          survey_maint_rule_BS |  -.0398628   .1714003    -0.23   0.816    -.3758012    .2960756
                         _cons |   .6279405   .6785105     0.93   0.355    -.7019157    1.957797
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.337773   .5908915                      1.424472    3.836636
    var(e.survey_maint_2017_FS)|   .1909716   .0252255                      .1474121    .2474026
    var(e.survey_maint_rule_FS)|   .1739305   .0272076                      .1280042    .2363347
------------------------------------------------------------------------------------------------

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.048   Standardized root mean squared residual
                  CD |      0.342   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pu  d_pr  surv  surv 
    -------------+------------------------------------------------------------------------
             raw | -0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pu  d_pr  surv  surv 
    -------------+------------------------------------------------------------------------
    share_f~3_BS | -0.0                                                                   
    survey_~7_FS | -0.0  -0.0                                                             
    survey~le_FS | -0.0   0.0  -0.0                                                       
    leader2_3_BS | -0.0   0.0   0.0   0.0                                                 
           No_HH | -0.0  -0.1   0.0   0.0   0.0                                           
        FES_site |  0.0   0.0  -0.0   0.0   0.0   0.0                                     
        Shar_Lit | -0.0   0.7  -0.0   0.0   0.0   0.0   0.0                               
       Shar_SCST | -0.0  -0.8   0.0   0.0   0.0   0.0   0.0   0.0                         
    d_public_s~l | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                   
    d_private_~l |  0.0   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. 
. 
. 
. *REVISIONS
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. replace no_school = 0 if  d_public_school>0 | d_private_school>0
(75 real changes made)

. 
. tab1 d_public_school d_private_school no_school

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       89.29       89.29
          1 |          9       10.71      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST d_public_school d_private_school

. 
. probit survey_maint_2017_FS  survey_maint_2017_BS $village if treatment_BS==0, vce(robust) 
variable survey_maint_2017_BS not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. 
. 
. 
. *REVISIONS
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. replace no_school = 0 if  d_public_school>0 | d_private_school>0
(75 real changes made)

. 
. tab1 d_public_school d_private_school no_school

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       89.29       89.29
          1 |          9       10.71      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST d_public_school d_private_school

. 
. probit survey_maint_2017_FS  survey_maint_2017_BS $village if treatment_BS==0, vce(robust) 
variable survey_maint_2017_BS not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS  survey_maint_12_BS_BS $village if treatment_BS==0, vce(robust) 
variable survey_maint_12_BS_BS not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS  survey_maint_12m_BS $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -1.1124013  
Iteration 2:   log pseudolikelihood = -.05724681  
Iteration 3:   log pseudolikelihood =          0  
Iteration 4:   log pseudolikelihood =          0  

Probit regression                               Number of obs     =         20
                                                Wald chi2(0)      =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =          0               Pseudo R2         =     1.0000

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
 survey_maint_12m_BS |   444.3726          .        .       .            .           .
               No_HH |   .9163505          .        .       .            .           .
            FES_site |  -106.4524          .        .       .            .           .
            Shar_Lit |  -14.78442          .        .       .            .           .
           Shar_SCST |  -1.075882          .        .       .            .           .
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   538.7802          .        .       .            .           .
--------------------------------------------------------------------------------------
Note: 10 failures and 10 successes completely determined.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS   $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -12.139338  
Iteration 2:   log pseudolikelihood = -12.132702  
Iteration 3:   log pseudolikelihood = -12.132701  

Probit regression                               Number of obs     =         20
                                                Wald chi2(4)      =       3.41
                                                Prob > chi2       =     0.4914
Log pseudolikelihood = -12.132701               Pseudo R2         =     0.1248

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0018075   .0021886     0.83   0.409    -.0024821    .0060972
            FES_site |  -.6448143   .6542303    -0.99   0.324    -1.927082    .6374536
            Shar_Lit |  -.0017637   .0316517    -0.06   0.956    -.0637998    .0602724
           Shar_SCST |  -.0082867   .0157261    -0.53   0.598    -.0391093    .0225359
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .6354715   2.159952     0.29   0.769    -3.597956    4.868899
--------------------------------------------------------------------------------------

. probit survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Iteration 0:   log pseudolikelihood = -15.451579  
Iteration 1:   log pseudolikelihood = -13.481533  
Iteration 2:   log pseudolikelihood = -13.457293  
Iteration 3:   log pseudolikelihood = -13.457278  
Iteration 4:   log pseudolikelihood = -13.457278  

Probit regression                               Number of obs     =         27
                                                Wald chi2(6)      =       4.13
                                                Prob > chi2       =     0.6595
Log pseudolikelihood = -13.457278               Pseudo R2         =     0.1291

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |  -.0028527   .0018894    -1.51   0.131    -.0065559    .0008505
            FES_site |  -.5907343   .6044251    -0.98   0.328    -1.775386    .5939171
            Shar_Lit |   .0304266   .0331525     0.92   0.359    -.0345512    .0954043
           Shar_SCST |  -.0024765   .0128725    -0.19   0.847    -.0277061     .022753
     d_public_school |  -.6584517   .6533518    -1.01   0.314    -1.938998    .6220942
    d_private_school |  -.3043364    .735343    -0.41   0.679    -1.745582    1.136909
               _cons |  -.7303966   2.423868    -0.30   0.763    -5.481091    4.020297
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS  survey_maint_12m_BS $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -1.1124013  
Iteration 2:   log pseudolikelihood = -.05724681  
Iteration 3:   log pseudolikelihood =          0  
Iteration 4:   log pseudolikelihood =          0  

Probit regression                               Number of obs     =         20
                                                Wald chi2(0)      =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =          0               Pseudo R2         =     1.0000

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
 survey_maint_12m_BS |   444.3726          .        .       .            .           .
               No_HH |   .9163505          .        .       .            .           .
            FES_site |  -106.4524          .        .       .            .           .
            Shar_Lit |  -14.78442          .        .       .            .           .
           Shar_SCST |  -1.075882          .        .       .            .           .
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   538.7802          .        .       .            .           .
--------------------------------------------------------------------------------------
Note: 10 failures and 10 successes completely determined.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS   $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -12.139338  
Iteration 2:   log pseudolikelihood = -12.132702  
Iteration 3:   log pseudolikelihood = -12.132701  

Probit regression                               Number of obs     =         20
                                                Wald chi2(4)      =       3.41
                                                Prob > chi2       =     0.4914
Log pseudolikelihood = -12.132701               Pseudo R2         =     0.1248

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0018075   .0021886     0.83   0.409    -.0024821    .0060972
            FES_site |  -.6448143   .6542303    -0.99   0.324    -1.927082    .6374536
            Shar_Lit |  -.0017637   .0316517    -0.06   0.956    -.0637998    .0602724
           Shar_SCST |  -.0082867   .0157261    -0.53   0.598    -.0391093    .0225359
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .6354715   2.159952     0.29   0.769    -3.597956    4.868899
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to 56)"

. 
. 
. 
. *REVISIONS
. egen n_school_gov = rowtotal(census_gov_school_middle census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middle census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_school==0
(75 missing values generated)

. replace no_school = 0 if  d_public_school>0 | d_private_school>0
(75 real changes made)

. 
. tab1 d_public_school d_private_school no_school

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       89.29       89.29
          1 |          9       10.71      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST d_public_school d_private_school

. 
. probit survey_maint_2017_FS   $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -12.139338  
Iteration 2:   log pseudolikelihood = -12.132702  
Iteration 3:   log pseudolikelihood = -12.132701  

Probit regression                               Number of obs     =         20
                                                Wald chi2(4)      =       3.41
                                                Prob > chi2       =     0.4914
Log pseudolikelihood = -12.132701               Pseudo R2         =     0.1248

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0018075   .0021886     0.83   0.409    -.0024821    .0060972
            FES_site |  -.6448143   .6542303    -0.99   0.324    -1.927082    .6374536
            Shar_Lit |  -.0017637   .0316517    -0.06   0.956    -.0637998    .0602724
           Shar_SCST |  -.0082867   .0157261    -0.53   0.598    -.0391093    .0225359
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .6354715   2.159952     0.29   0.769    -3.597956    4.868899
--------------------------------------------------------------------------------------

. probit survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Iteration 0:   log pseudolikelihood = -15.451579  
Iteration 1:   log pseudolikelihood = -13.481533  
Iteration 2:   log pseudolikelihood = -13.457293  
Iteration 3:   log pseudolikelihood = -13.457278  
Iteration 4:   log pseudolikelihood = -13.457278  

Probit regression                               Number of obs     =         27
                                                Wald chi2(6)      =       4.13
                                                Prob > chi2       =     0.6595
Log pseudolikelihood = -13.457278               Pseudo R2         =     0.1291

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |  -.0028527   .0018894    -1.51   0.131    -.0065559    .0008505
            FES_site |  -.5907343   .6044251    -0.98   0.328    -1.775386    .5939171
            Shar_Lit |   .0304266   .0331525     0.92   0.359    -.0345512    .0954043
           Shar_SCST |  -.0024765   .0128725    -0.19   0.847    -.0277061     .022753
     d_public_school |  -.6584517   .6533518    -1.01   0.314    -1.938998    .6220942
    d_private_school |  -.3043364    .735343    -0.41   0.679    -1.745582    1.136909
               _cons |  -.7303966   2.423868    -0.30   0.763    -5.481091    4.020297
--------------------------------------------------------------------------------------

. 
end of do-file

. pwcorr d_public_school d_private_school

             | d_publ~l d_priv~l
-------------+------------------
d_public_s~l |   1.0000 
d_private_~l |  -0.0222   1.0000 

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. global village  No_HH FES_site  Shar_SCST d_public_school d_private_school

. 
. probit survey_maint_2017_FS  $village if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood =  -12.14016  
Iteration 2:   log pseudolikelihood = -12.133987  
Iteration 3:   log pseudolikelihood = -12.133986  

Probit regression                               Number of obs     =         20
                                                Wald chi2(3)      =       3.41
                                                Prob > chi2       =     0.3332
Log pseudolikelihood = -12.133986               Pseudo R2         =     0.1247

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0017905   .0021935     0.82   0.414    -.0025086    .0060897
            FES_site |  -.6406696   .6458512    -0.99   0.321    -1.906515    .6251755
           Shar_SCST |  -.0083118   .0157058    -0.53   0.597    -.0390946    .0224709
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .5452548   1.381207     0.39   0.693    -2.161861    3.252371
--------------------------------------------------------------------------------------

. 
end of do-file

. tab d_public_school d_private_school

d_public_s |   d_private_school
     chool |         0          1 |     Total
-----------+----------------------+----------
         0 |         9          1 |        10 
         1 |        68          6 |        74 
-----------+----------------------+----------
     Total |        77          7 |        84 

. tab no_school d_private_school

           |   d_private_school
 no_school |         0          1 |     Total
-----------+----------------------+----------
         0 |        68          7 |        75 
         1 |         9          0 |         9 
-----------+----------------------+----------
     Total |        77          7 |        84 

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS  $village no_school d_private_school if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

note: d_public_school != 1 predicts failure perfectly
      d_public_school dropped and 4 obs not used

note: no_school omitted because of collinearity
note: d_private_school omitted because of collinearity
Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood =  -12.14016  
Iteration 2:   log pseudolikelihood = -12.133987  
Iteration 3:   log pseudolikelihood = -12.133986  

Probit regression                               Number of obs     =         20
                                                Wald chi2(3)      =       3.41
                                                Prob > chi2       =     0.3332
Log pseudolikelihood = -12.133986               Pseudo R2         =     0.1247

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0017905   .0021935     0.82   0.414    -.0025086    .0060897
            FES_site |  -.6406696   .6458512    -0.99   0.321    -1.906515    .6251755
           Shar_SCST |  -.0083118   .0157058    -0.53   0.597    -.0390946    .0224709
     d_public_school |          0  (omitted)
    d_private_school |          0  (omitted)
           no_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .5452548   1.381207     0.39   0.693    -2.161861    3.252371
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST 

. 
. probit survey_maint_2017_FS  $village no_school d_private_school if treatment_BS==0, vce(robust) 

note: no_school != 0 predicts failure perfectly
      no_school dropped and 4 obs not used

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

Iteration 0:   log pseudolikelihood = -13.862944  
Iteration 1:   log pseudolikelihood = -12.139338  
Iteration 2:   log pseudolikelihood = -12.132702  
Iteration 3:   log pseudolikelihood = -12.132701  

Probit regression                               Number of obs     =         20
                                                Wald chi2(4)      =       3.41
                                                Prob > chi2       =     0.4914
Log pseudolikelihood = -12.132701               Pseudo R2         =     0.1248

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |   .0018075   .0021886     0.83   0.409    -.0024821    .0060972
            FES_site |  -.6448143   .6542303    -0.99   0.324    -1.927082    .6374536
            Shar_Lit |  -.0017637   .0316517    -0.06   0.956    -.0637998    .0602724
           Shar_SCST |  -.0082867   .0157261    -0.53   0.598    -.0391093    .0225359
           no_school |          0  (omitted)
    d_private_school |          0  (omitted)
               _cons |   .6354715   2.159952     0.29   0.769    -3.597956    4.868899
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. probit survey_maint_2017_FS  $village  d_private_school if treatment_BS==0, vce(robust) 

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 3 obs not used

Iteration 0:   log pseudolikelihood = -16.300638  
Iteration 1:   log pseudolikelihood = -14.288819  
Iteration 2:   log pseudolikelihood = -14.287251  
Iteration 3:   log pseudolikelihood = -14.287251  

Probit regression                               Number of obs     =         24
                                                Wald chi2(4)      =       3.69
                                                Prob > chi2       =     0.4493
Log pseudolikelihood = -14.287251               Pseudo R2         =     0.1235

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
               No_HH |  -.0002227   .0019394    -0.11   0.909    -.0040239    .0035786
            FES_site |  -.4870423   .6085052    -0.80   0.423    -1.679691     .705606
            Shar_Lit |   .0125591    .031182     0.40   0.687    -.0485566    .0736748
           Shar_SCST |  -.0181391   .0147719    -1.23   0.219    -.0470914    .0108132
    d_private_school |          0  (omitted)
               _cons |   .7480072   2.215552     0.34   0.736    -3.594395    5.090409
--------------------------------------------------------------------------------------

. 
end of do-file

. bys treatment_BS: tab d_private_school d_public_school

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

d_private_ |    d_public_school
    school |         0          1 |     Total
-----------+----------------------+----------
         0 |         5         20 |        25 
         1 |         1          2 |         3 
-----------+----------------------+----------
     Total |         6         22 |        28 

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

d_private_ |    d_public_school
    school |         0          1 |     Total
-----------+----------------------+----------
         0 |         4         48 |        52 
         1 |         0          4 |         4 
-----------+----------------------+----------
     Total |         4         52 |        56 


. bys treatment_BS: tab1 d_private_school d_public_school

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         25       89.29       89.29
          1 |          3       10.71      100.00
------------+-----------------------------------
      Total |         28      100.00

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       21.43       21.43
          1 |         22       78.57      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       92.86       92.86
          1 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        7.14        7.14
          1 |         52       92.86      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_2017_FS  $village  d_private_school if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(5, 21)          =       4.01
                                                Prob > F          =     0.0104
                                                R-squared         =     0.2593
                                                Root MSE          =     .48761

----------------------------------------------------------------------------------
                 |               Robust
survey_maint_2~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   9.83e-06   .0008102     0.01   0.990    -.0016751    .0016948
        FES_site |  -.1451517   .2196555    -0.66   0.516    -.6019503    .3116469
        Shar_Lit |   .0029945   .0118209     0.25   0.802    -.0215885    .0275774
       Shar_SCST |  -.0058921   .0053935    -1.09   0.287    -.0171086    .0053243
d_private_school |    .637099   .2014597     3.16   0.005     .2181407    1.056057
           _cons |   .7679523   .8703383     0.88   0.388    -1.042015     2.57792
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST d_private_school no_school

. 
. reg survey_maint_2017_FS  $village   if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =      12.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3450
                                                Root MSE          =     .46986

----------------------------------------------------------------------------------
                 |               Robust
survey_maint_2~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0003013   .0006334     0.48   0.640    -.0010201    .0016226
        FES_site |  -.1564519   .2197893    -0.71   0.485    -.6149243    .3020204
        Shar_Lit |   .0006859   .0116642     0.06   0.954    -.0236451     .025017
       Shar_SCST |  -.0032083   .0057293    -0.56   0.582    -.0151595    .0087428
d_private_school |   .5705863    .193381     2.95   0.008     .1672007    .9739719
       no_school |  -.4508963   .1752179    -2.57   0.018    -.8163945   -.0853981
           _cons |   .7040422   .8519307     0.83   0.418    -1.073054    2.481138
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       0.51
                                                Prob > F          =     0.7911
                                                R-squared         =     0.1161
                                                Root MSE          =     .47872

----------------------------------------------------------------------------------
                 |               Robust
survey_main~e_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |  -.0007286   .0005418    -1.34   0.194    -.0018587    .0004015
        FES_site |  -.1937122    .188694    -1.03   0.317     -.587321    .1998967
        Shar_Lit |   .0092196   .0125163     0.74   0.470     -.016889    .0353282
       Shar_SCST |  -.0008633   .0043428    -0.20   0.844    -.0099222    .0081957
d_private_school |   .0060248    .284835     0.02   0.983    -.5881307    .6001802
       no_school |   .0931082   .2697766     0.35   0.734     -.469636    .6558523
           _cons |    .064172   .8093451     0.08   0.938    -1.624092    1.752436
----------------------------------------------------------------------------------

. 
end of do-file

. bys treatment_BS: sum d_private_school d_public_school no_school

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
d_private_~l |         28    .1071429    .3149704          0          1
d_public_s~l |         28    .7857143    .4178554          0          1
   no_school |         28    .1785714     .390021          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
d_private_~l |         56    .0714286    .2598701          0          1
d_public_s~l |         56    .9285714    .2598701          0          1
   no_school |         56    .0714286    .2598701          0          1


. bys treatment_BS: tab1 d_private_school d_public_school no_school

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         25       89.29       89.29
          1 |          3       10.71      100.00
------------+-----------------------------------
      Total |         28      100.00

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       21.43       21.43
          1 |         22       78.57      100.00
------------+-----------------------------------
      Total |         28      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         23       82.14       82.14
          1 |          5       17.86      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       92.86       92.86
          1 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        7.14        7.14
          1 |         52       92.86      100.00
------------+-----------------------------------
      Total |         56      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       92.86       92.86
          1 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo ols_control1: reg survey_maint_2017_FS  $village  if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =      12.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3450
                                                Root MSE          =     .46986

----------------------------------------------------------------------------------
                 |               Robust
survey_maint_2~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0003013   .0006334     0.48   0.640    -.0010201    .0016226
        FES_site |  -.1564519   .2197893    -0.71   0.485    -.6149243    .3020204
        Shar_Lit |   .0006859   .0116642     0.06   0.954    -.0236451     .025017
       Shar_SCST |  -.0032083   .0057293    -0.56   0.582    -.0151595    .0087428
d_private_school |   .5705863    .193381     2.95   0.008     .1672007    .9739719
       no_school |  -.4508963   .1752179    -2.57   0.018    -.8163945   -.0853981
           _cons |   .7040422   .8519307     0.83   0.418    -1.073054    2.481138
----------------------------------------------------------------------------------

. eststo ols_control2: reg survey_maint_rule_FS  $village if treatment_BS==0, vce(robust) 

Linear regression                               Number of obs     =         27
                                                F(6, 20)          =       0.51
                                                Prob > F          =     0.7911
                                                R-squared         =     0.1161
                                                Root MSE          =     .47872

----------------------------------------------------------------------------------
                 |               Robust
survey_main~e_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |  -.0007286   .0005418    -1.34   0.194    -.0018587    .0004015
        FES_site |  -.1937122    .188694    -1.03   0.317     -.587321    .1998967
        Shar_Lit |   .0092196   .0125163     0.74   0.470     -.016889    .0353282
       Shar_SCST |  -.0008633   .0043428    -0.20   0.844    -.0099222    .0081957
d_private_school |   .0060248    .284835     0.02   0.983    -.5881307    .6001802
       no_school |   .0931082   .2697766     0.35   0.734     -.469636    .6558523
           _cons |    .064172   .8093451     0.08   0.938    -1.624092    1.752436
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. esttab ols_control1 ols_control2 using "$working_ANALYSIS\results\Tables\revision1_control_villages.rtf", ci transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1
> )" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{bre
> ak}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.
> 01, *** p<0.001") replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_control_villages.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_control_villages.rtf)

. restore
nothing to restore
r(622);

end of do-file

r(622);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab ols_control1 ols_control2 using "$working_ANALYSIS\results\Tables\revision1_control_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1
> )" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{bre
> ak}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.
> 01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_control_villages.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab ols_control1 ols_control2 using "$working_ANALYSIS\results\Tables\revision1_control_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Dam maintenance (=1
> )" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2, labels("N" "R-squared" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break
> }{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.01
> , *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_control_villages.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. reg leader2_3_BS $village, vce(robust)

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       2.76
                                                Prob > F          =     0.0215
                                                R-squared         =     0.0987
                                                Root MSE          =      .4285

----------------------------------------------------------------------------------
                 |               Robust
    leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0010552   .0007527     1.40   0.167    -.0004573    .0025678
        FES_site |   .0213759   .1572419     0.14   0.892    -.2946135    .3373652
        Shar_Lit |   .0056962    .007803     0.73   0.469    -.0099845     .021377
       Shar_SCST |   .0051736   .0034414     1.50   0.139    -.0017422    .0120893
d_private_school |   -.002563   .2317939    -0.01   0.991    -.4683703    .4632443
       no_school |   -.252558   .1131975    -2.23   0.030    -.4800369   -.0250791
           _cons |  -.6354345   .5393161    -1.18   0.244    -1.719231    .4483618
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. 
. 
. *STRUCTURAL EQUATION MODEL
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. 
. *define SEM and store estimates using above programs
. sem (leader2_3_BS  $village  -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_BS  -> survey_maint_2017_FS 
> , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) nocapslatent

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST d_private_school no_school survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -1051.875  
Iteration 1:   log pseudolikelihood =  -1051.875  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -1051.875

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.798431   .5204532     3.46   0.001     .7783615    2.818501
                         No_HH |   .0005382   .0023395     0.23   0.818    -.0040471    .0051236
                      FES_site |   .0540402   .4679582     0.12   0.908     -.863141    .9712215
                      Shar_Lit |   .0227931   .0270407     0.84   0.399    -.0302057    .0757919
                     Shar_SCST |   .0033347   .0166844     0.20   0.842     -.029366    .0360355
              d_private_school |   .3111241   .9319163     0.33   0.738    -1.515398    2.137646
                     no_school |  -.1729012   .5448301    -0.32   0.751    -1.240748    .8949461
                         _cons |   .4653999   2.038557     0.23   0.819    -3.530099    4.460899
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0617551    .029433     2.10   0.036     .0040675    .1194428
                  leader2_3_BS |  -.1441472   .1472514    -0.98   0.328    -.4327547    .1444602
           survey_maint_12m_BS |   .1115222   .1172699     0.95   0.342    -.1183226     .341367
          survey_maint_rule_BS |  -.1160932    .171886    -0.68   0.499    -.4529836    .2207971
                         _cons |   .5533521   .1206419     4.59   0.000     .3168983    .7898059
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .1063898   .0301574     3.53   0.000     .0472825    .1654971
                  leader2_3_BS |  -.0463403   .1553401    -0.30   0.765    -.3508013    .2581208
                         No_HH |  -.0008394   .0007921    -1.06   0.289    -.0023919    .0007131
                      FES_site |   .1565898   .1247089     1.26   0.209    -.0878351    .4010147
                      Shar_Lit |  -.0075378   .0061742    -1.22   0.222    -.0196389    .0045634
                     Shar_SCST |  -.0027085   .0039692    -0.68   0.495     -.010488     .005071
              d_private_school |  -.0864195   .1716204    -0.50   0.615    -.4227893    .2499504
                     no_school |  -.0895853    .220053    -0.41   0.684    -.5208812    .3417106
          survey_maint_rule_BS |  -.0398628   .1714003    -0.23   0.816    -.3758012    .2960756
                         _cons |   .7175258   .6014258     1.19   0.233    -.4612471    1.896299
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.337773   .5908915                      1.424472    3.836636
    var(e.survey_maint_2017_FS)|   .1909716   .0252255                      .1474121    .2474026
    var(e.survey_maint_rule_FS)|   .1739305   .0272076                      .1280042    .2363347
------------------------------------------------------------------------------------------------

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.048   Standardized root mean squared residual
                  CD |      0.342   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  surv  surv 
    -------------+------------------------------------------------------------------------
             raw | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  surv  surv 
    -------------+------------------------------------------------------------------------
    share_f~3_BS | -0.0                                                                   
    survey_~7_FS | -0.0  -0.0                                                             
    survey~le_FS | -0.0   0.0  -0.0                                                       
    leader2_3_BS | -0.0  -0.0  -0.0   0.0                                                 
           No_HH | -0.0  -0.1  -0.0   0.0   0.0                                           
        FES_site |  0.0   0.0   0.0   0.0   0.0   0.0                                     
        Shar_Lit | -0.0   0.7  -0.0   0.0   0.0   0.0   0.0                               
       Shar_SCST | -0.0  -0.8  -0.0   0.0   0.0   0.0   0.0   0.0                         
    d_private_~l | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                   
       no_school |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

.  
. * Table S7.     Direct, indirect, and total effects from SEM
. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf)

. 
end of do-file

. tab game_total_fem

Total no of |
     female |
 players in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        5.36        5.36
          1 |          8       14.29       19.64
          2 |          7       12.50       32.14
          3 |         10       17.86       50.00
          4 |          5        8.93       58.93
          5 |         12       21.43       80.36
          6 |          5        8.93       89.29
          7 |          2        3.57       92.86
          8 |          2        3.57       96.43
          9 |          1        1.79       98.21
         14 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo lpm_female_leader1:reg game_leader_fem_vill $village, vce(robust)

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       4.43
                                                Prob > F          =     0.0012
                                                R-squared         =     0.0648
                                                Root MSE          =      .6109

----------------------------------------------------------------------------------
                 |               Robust
game_leader_fe~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0004109    .000968     0.42   0.673    -.0015344    .0023562
        FES_site |   .0151964   .1915998     0.08   0.937    -.3698378    .4002305
        Shar_Lit |   .0022131    .010334     0.21   0.831    -.0185539    .0229801
       Shar_SCST |  -.0004138   .0052758    -0.08   0.938    -.0110159    .0101883
d_private_school |   .3398228   .4652064     0.73   0.469    -.5950443     1.27469
       no_school |  -.3933102   .1487423    -2.64   0.011     -.692219   -.0944014
           _cons |   .2554392   .6674073     0.38   0.704    -1.085766    1.596644
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. eststo lpm_female_leader1:reg leader2_3_BS $village, vce(robust)

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =       2.76
                                                Prob > F          =     0.0215
                                                R-squared         =     0.0987
                                                Root MSE          =      .4285

----------------------------------------------------------------------------------
                 |               Robust
    leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           No_HH |   .0010552   .0007527     1.40   0.167    -.0004573    .0025678
        FES_site |   .0213759   .1572419     0.14   0.892    -.2946135    .3373652
        Shar_Lit |   .0056962    .007803     0.73   0.469    -.0099845     .021377
       Shar_SCST |   .0051736   .0034414     1.50   0.139    -.0017422    .0120893
d_private_school |   -.002563   .2317939    -0.01   0.991    -.4683703    .4632443
       no_school |   -.252558   .1131975    -2.23   0.030    -.4800369   -.0250791
           _cons |  -.6354345   .5393161    -1.18   0.244    -1.719231    .4483618
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab lpm_female_leader1  using "$working_ANALYSIS\results\Tables\revision1_control_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Female leader present (=1
> )) b(%4.2f)label stats(N r2, labels("N" "R-squared" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes
>  addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
unmatched quote
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab lpm_female_leader1  using "$working_ANALYSIS\results\Tables\revision1_control_villages.rtf", se transform(ln*: exp(@) exp(@))mtitles("Female leader present (=1
> )") b(%4.2f)label stats(N r2_a, labels("N" "Adj. R-squared" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) 
>  nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") rep
> lace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_control_villages.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab lpm_female_leader1  using "$working_ANALYSIS\results\Tables\revision1_det_female_leader.rtf", se transform(ln*: exp(@) exp(@))mtitles("Female leader present (=
> 1)") b(%4.2f)label stats(N r2_a, labels("N" "Adj. R-squared" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))
>   nonotes addnotes("Notes: Estimates are from OLS regressions with robust standard errors. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") re
> place 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_det_female_leader.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\revision1_det_female_leader.rtf)

. 
end of do-file

. bys treatment_BS: tab no_school

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         23       82.14       82.14
          1 |          5       17.86      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       92.86       92.86
          1 |          4        7.14      100.00
------------+-----------------------------------
      Total |         56      100.00


. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. *STRUCTURAL EQUATION MODEL
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. 
. *define SEM and store estimates using above programs
. sem (leader2_3_BS  $village  -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_BS  -> survey_maint_2017_FS 
> , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village -> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) nocapslatent

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST d_private_school no_school survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -1051.875  
Iteration 1:   log pseudolikelihood =  -1051.875  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -1051.875

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.798431   .5204532     3.46   0.001     .7783615    2.818501
                         No_HH |   .0005382   .0023395     0.23   0.818    -.0040471    .0051236
                      FES_site |   .0540402   .4679582     0.12   0.908     -.863141    .9712215
                      Shar_Lit |   .0227931   .0270407     0.84   0.399    -.0302057    .0757919
                     Shar_SCST |   .0033347   .0166844     0.20   0.842     -.029366    .0360355
              d_private_school |   .3111241   .9319163     0.33   0.738    -1.515398    2.137646
                     no_school |  -.1729012   .5448301    -0.32   0.751    -1.240748    .8949461
                         _cons |   .4653999   2.038557     0.23   0.819    -3.530099    4.460899
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0617551    .029433     2.10   0.036     .0040675    .1194428
                  leader2_3_BS |  -.1441472   .1472514    -0.98   0.328    -.4327547    .1444602
           survey_maint_12m_BS |   .1115222   .1172699     0.95   0.342    -.1183226     .341367
          survey_maint_rule_BS |  -.1160932    .171886    -0.68   0.499    -.4529836    .2207971
                         _cons |   .5533521   .1206419     4.59   0.000     .3168983    .7898059
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .1063898   .0301574     3.53   0.000     .0472825    .1654971
                  leader2_3_BS |  -.0463403   .1553401    -0.30   0.765    -.3508013    .2581208
                         No_HH |  -.0008394   .0007921    -1.06   0.289    -.0023919    .0007131
                      FES_site |   .1565898   .1247089     1.26   0.209    -.0878351    .4010147
                      Shar_Lit |  -.0075378   .0061742    -1.22   0.222    -.0196389    .0045634
                     Shar_SCST |  -.0027085   .0039692    -0.68   0.495     -.010488     .005071
              d_private_school |  -.0864195   .1716204    -0.50   0.615    -.4227893    .2499504
                     no_school |  -.0895853    .220053    -0.41   0.684    -.5208812    .3417106
          survey_maint_rule_BS |  -.0398628   .1714003    -0.23   0.816    -.3758012    .2960756
                         _cons |   .7175258   .6014258     1.19   0.233    -.4612471    1.896299
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   2.337773   .5908915                      1.424472    3.836636
    var(e.survey_maint_2017_FS)|   .1909716   .0252255                      .1474121    .2474026
    var(e.survey_maint_rule_FS)|   .1739305   .0272076                      .1280042    .2363347
------------------------------------------------------------------------------------------------

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.048   Standardized root mean squared residual
                  CD |      0.342   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  surv  surv 
    -------------+------------------------------------------------------------------------
             raw | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  surv  surv 
    -------------+------------------------------------------------------------------------
    share_f~3_BS | -0.0                                                                   
    survey_~7_FS | -0.0  -0.0                                                             
    survey~le_FS | -0.0   0.0  -0.0                                                       
    leader2_3_BS | -0.0  -0.0  -0.0   0.0                                                 
           No_HH | -0.0  -0.1  -0.0   0.0   0.0                                           
        FES_site |  0.0   0.0   0.0   0.0   0.0   0.0                                     
        Shar_Lit | -0.0   0.7  -0.0   0.0   0.0   0.0   0.0                               
       Shar_SCST | -0.0  -0.8  -0.0   0.0   0.0   0.0   0.0   0.0                         
    d_private_~l | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                   
       no_school |  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS | -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab . using "$working_ANALYSIS\results\tables\tableS6_village_characteristics.rtf", cells("min(fmt(0)) max(fmt(0)) count(fmt(0)) mean(fmt(%9.2fc)) sd(fmt(%9.2fc)) 
> p50(fmt(0)) ")  not nostar unstack nomtitle nonumber nonote label replace
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\tableS6_village_characteristics.rtf)

.  
. * Table S7.     Direct, indirect, and total effects from SEM
. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. sem (leader2_3_BS  $village sequence -> share_female_percent3_BS , ) (leader2_3_BS share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_BS sequence -> surve
> y_maint_2017_FS , ) (leader2_3_BS share_female_percent3_BS survey_maint_rule_BS $village sequence -> survey_maint_rule_FS, ) if treatment_BS==1, vce(robust) nocapslat
> ent

Endogenous variables

Observed:  share_female_percent3_BS survey_maint_2017_FS survey_maint_rule_FS

Exogenous variables

Observed:  leader2_3_BS No_HH FES_site Shar_Lit Shar_SCST d_private_school no_school sequence survey_maint_12m_BS survey_maint_rule_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1271.0528  
Iteration 1:   log pseudolikelihood = -1271.0528  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1271.0528

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  share_female_percent3_BS     |
                  leader2_3_BS |   1.528761    .455155     3.36   0.001     .6366732    2.420848
                         No_HH |  -.0005445   .0023031    -0.24   0.813    -.0050586    .0039695
                      FES_site |  -.3807525   .4674261    -0.81   0.415    -1.296891    .5353858
                      Shar_Lit |   .0388939   .0272083     1.43   0.153    -.0144334    .0922212
                     Shar_SCST |   .0078085   .0160061     0.49   0.626    -.0235629    .0391799
              d_private_school |   .6668416   .7864267     0.85   0.396    -.8745265     2.20821
                     no_school |   .4749871   .4861327     0.98   0.329    -.4778155     1.42779
                      sequence |   .0434281    .013864     3.13   0.002     .0162553     .070601
                         _cons |  -1.484096   2.401027    -0.62   0.537    -6.190024    3.221831
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
      share_female_percent3_BS |   .0478988   .0303331     1.58   0.114     -.011553    .1073506
                  leader2_3_BS |  -.1421147   .1502846    -0.95   0.344    -.4366671    .1524378
                      sequence |   .0035323   .0040128     0.88   0.379    -.0043328    .0113973
           survey_maint_12m_BS |   .0906701   .1223002     0.74   0.458    -.1490339     .330374
          survey_maint_rule_BS |  -.0639504   .1810641    -0.35   0.724    -.4188294    .2909287
                         _cons |   .4892989   .1475708     3.32   0.001     .2000656    .7785323
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
      share_female_percent3_BS |   .1267639   .0317418     3.99   0.000     .0645511    .1889766
                  leader2_3_BS |  -.0497934   .1507753    -0.33   0.741    -.3453075    .2457207
                         No_HH |  -.0007886   .0007869    -1.00   0.316    -.0023309    .0007537
                      FES_site |   .2003433   .1180021     1.70   0.090    -.0309365    .4316231
                      Shar_Lit |  -.0096427   .0062828    -1.53   0.125    -.0219569    .0026714
                     Shar_SCST |   -.003261   .0037588    -0.87   0.386     -.010628    .0041061
              d_private_school |  -.1454568    .221498    -0.66   0.511    -.5795849    .2886714
                     no_school |  -.1527521   .2360466    -0.65   0.518     -.615395    .3098908
                      sequence |  -.0047399   .0048727    -0.97   0.331    -.0142902    .0048103
          survey_maint_rule_BS |  -.1152858   .2005668    -0.57   0.565    -.5083895    .2778179
                         _cons |   .9362161   .6031489     1.55   0.121    -.2459341    2.118366
-------------------------------+----------------------------------------------------------------
var(e.share_female_percent3_BS)|   1.951378   .4433666                      1.250093    3.046073
    var(e.survey_maint_2017_FS)|   .1885137   .0251742                      .1451019    .2449134
    var(e.survey_maint_rule_FS)|   .1707348   .0259589                       .126737    .2300069
------------------------------------------------------------------------------------------------

. eststo SEM

. estat gof, stats(all)

----------------------------------------------------------------------------
Fit statistic        |      Value   Description
---------------------+------------------------------------------------------
Size of residuals    |
                SRMR |      0.052   Standardized root mean squared residual
                  CD |      0.470   Coefficient of determination
----------------------------------------------------------------------------
Note: model was fit with vce(robust); only stats(residuals) valid.

. estat residuals, format(%4.1f)

Residuals of observed variables

  Mean residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  sequ  surv  surv 
    -------------+------------------------------------------------------------------------------
             raw |  0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------------

  Covariance residuals

                 | shar  surv  surv  lead  No_H  FES_  Shar  Shar  d_pr  no_s  sequ  surv  surv 
    -------------+------------------------------------------------------------------------------
    share_f~3_BS |  0.0                                                                         
    survey_~7_FS | -0.0  -0.0                                                                   
    survey~le_FS | -0.0   0.0  -0.0                                                             
    leader2_3_BS |  0.0  -0.0  -0.0   0.0                                                       
           No_HH |  0.0  -0.2  -0.0   0.0   0.0                                                 
        FES_site | -0.0   0.0   0.0   0.0   0.0   0.0                                           
        Shar_Lit |  0.0   0.8  -0.0   0.0   0.0   0.0   0.0                                     
       Shar_SCST |  0.0  -0.7  -0.0   0.0   0.0   0.0   0.0   0.0                               
    d_private_~l |  0.0   0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0                         
       no_school | -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0                   
        sequence |  0.0  -0.0  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0             
    survey~2m_BS | -0.1  -0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0       
    survey~le_BS |  0.1   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0 
    --------------------------------------------------------------------------------------------

. est store main

. te_direct

. est store direct

. est restore main
(results main are active now)

. te_indirect

. est store indirect

. est restore main
(results main are active now)

. te_total

. est store total

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf is read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD31e8_000000.tmp"

. esttab direct indirect total using "$working_ANALYSIS\results\tables\TableS7_SEM_effects.rtf", mtitles(direct indirect total) se transform(ln*: exp(@) exp(@))  b(%4.2
> f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estima
> tes are from SEM model using linear probability regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\TableS7_SEM_effects.rtf)

. 
. 
. 
end of do-file

. exit, clear
