----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2024.07.25-10.01.56.log.txt
  log type:  text
 opened on:  25 Jul 2024, 10:01:56

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 25 Jul 2024 10:01:56

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *REVISIONS
. *Globals
. gen VP10=VP/10
(132 missing values generated)

. gen HH10=No_HH/10
(105 missing values generated)

. 
. egen z_VP2 = std(norm_progressive2)
(132 missing values generated)

. egen z_VP = std(VP)
(132 missing values generated)

. egen z_HH = std(No_HH)
(105 missing values generated)

. egen z_SHG_before2017 = std(n_SHG_before2017)
(129 missing values generated)

. global village z_VP z_SHG_before2017 z_HH FES_site 

. global village2 VP n_SHG_before2017 No_HH FES_site 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. mlogit leader_present_BS $village sequence, vce(robust)

Iteration 0:   log pseudolikelihood = -70.202666  
Iteration 1:   log pseudolikelihood = -54.161871  
Iteration 2:   log pseudolikelihood = -49.942549  
Iteration 3:   log pseudolikelihood = -49.241518  
Iteration 4:   log pseudolikelihood = -49.226159  
Iteration 5:   log pseudolikelihood =  -49.22612  
Iteration 6:   log pseudolikelihood =  -49.22612  

Multinomial logistic regression                 Number of obs     =         56
                                                Wald chi2(15)     =      41.15
                                                Prob > chi2       =     0.0003
Log pseudolikelihood =  -49.22612               Pseudo R2         =     0.2988

----------------------------------------------------------------------------------
                 |               Robust
leader_present~S |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
None             |
            z_VP |   .2296098    .615292     0.37   0.709    -.9763405     1.43556
z_SHG_before2017 |  -3.736348   1.301049    -2.87   0.004    -6.286358   -1.186338
            z_HH |  -.1658354   .7416256    -0.22   0.823    -1.619395    1.287724
        FES_site |  -3.432065   1.479231    -2.32   0.020    -6.331305   -.5328245
        sequence |    .197278   .0518618     3.80   0.000     .0956308    .2989253
           _cons |  -7.303559   2.244383    -3.25   0.001    -11.70247    -2.90465
-----------------+----------------------------------------------------------------
Only_Male        |  (base outcome)
-----------------+----------------------------------------------------------------
Both             |
            z_VP |   .7880027   .4852634     1.62   0.104     -.163096    1.739101
z_SHG_before2017 |   1.556576   .8025295     1.94   0.052    -.0163528    3.129505
            z_HH |  -2.045242   .8157175    -2.51   0.012    -3.644019   -.4464656
        FES_site |   1.221231   1.105679     1.10   0.269    -.9458598    3.388321
        sequence |   .0153633   .0387073     0.40   0.691    -.0605016    .0912283
           _cons |  -3.532116   1.345666    -2.62   0.009    -6.169572   -.8946601
-----------------+----------------------------------------------------------------
Only_Female      |
            z_VP |  -.0463444   .4162294    -0.11   0.911     -.862139    .7694503
z_SHG_before2017 |  -.5619519   .5921352    -0.95   0.343    -1.722516    .5986118
            z_HH |   1.016056   .6235594     1.63   0.103    -.2060979     2.23821
        FES_site |  -1.391544   1.043682    -1.33   0.182    -3.437123    .6540348
        sequence |    .046812   .0268365     1.74   0.081    -.0057864    .0994105
           _cons |  -1.220976   .9066618    -1.35   0.178    -2.998001    .5560481
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

dy/dx w.r.t. : z_VP z_SHG_before2017 z_HH FES_site sequence
1._predict   : Pr(leader_present_BS==None), predict(pr outcome(0))
2._predict   : Pr(leader_present_BS==Only_Male), predict(pr outcome(1))
3._predict   : Pr(leader_present_BS==Both), predict(pr outcome(2))
4._predict   : Pr(leader_present_BS==Only_Female), predict(pr outcome(3))

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
z_VP             |
        _predict |
              1  |   .0091032   .0389776     0.23   0.815    -.0672916    .0854979
              2  |  -.0636835   .0609678    -1.04   0.296    -.1831782    .0558112
              3  |   .0806422   .0450633     1.79   0.074    -.0076803    .1689647
              4  |  -.0260619   .0516189    -0.50   0.614    -.1272331    .0751094
-----------------+----------------------------------------------------------------
z_SHG_before2017 |
        _predict |
              1  |  -.2474127   .0516605    -4.79   0.000    -.3486654     -.14616
              2  |   .0412477   .0882824     0.47   0.640    -.1317826     .214278
              3  |   .2067743   .0840117     2.46   0.014     .0421144    .3714342
              4  |  -.0006093   .0502097    -0.01   0.990    -.0990184    .0977998
-----------------+----------------------------------------------------------------
z_HH             |
        _predict |
              1  |   -.019694    .045476    -0.43   0.665    -.1088254    .0694374
              2  |    .069889   .1049696     0.67   0.506    -.1358477    .2756257
              3  |  -.2285944   .0985736    -2.32   0.020    -.4217952   -.0353936
              4  |   .1783994   .0664831     2.68   0.007      .048095    .3087039
-----------------+----------------------------------------------------------------
FES_site         |
        _predict |
              1  |   -.201221    .078952    -2.55   0.011    -.3559641   -.0464779
              2  |    .134911   .1386789     0.97   0.331    -.1368946    .4067166
              3  |   .1831152   .1105981     1.66   0.098    -.0336531    .3998836
              4  |  -.1168052   .1111644    -1.05   0.293    -.3346835     .101073
-----------------+----------------------------------------------------------------
sequence         |
        _predict |
              1  |   .0116727   .0018241     6.40   0.000     .0080975    .0152479
              2  |  -.0113354   .0037369    -3.03   0.002    -.0186596   -.0040112
              3  |  -.0010559   .0029735    -0.36   0.722    -.0068838    .0047719
              4  |   .0007186    .002727     0.26   0.792    -.0046262    .0060634
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *SEM including composition of leaders
. sem ($village sequence-> leader_comp1_BS ) ($village sequence-> leader_comp2_BS ) ($village sequence-> leader_comp3_BS ) ($village sequence-> leader_comp4_BS ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_lea
> ders $village sequence -> share_female_percent3_BS , )  (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS survey_maint_rule_BS $village survey_dam_for_irrigation_FS sequence -> sur
> vey_maint_rule_FS, ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS  total_leaders share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_FS $village survey_dam_for_irrigation_FS sequence -> survey_maint_2017
> _FS , ), vce(robust) nocapslatent
(132 observations with missing values excluded)

Endogenous variables

Observed:  leader_comp1_BS leader_comp2_BS leader_comp3_BS leader_comp4_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  z_VP z_SHG_before2017 z_HH FES_site sequence total_leaders survey_maint_rule_BS survey_dam_for_irrigation_FS survey_maint_12m_BS

Fitting target model:

Iteration 0:   log pseudolikelihood =  -874.3351  
Iteration 1:   log pseudolikelihood =  -874.3351  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood =  -874.3351

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
                         _cons |  -.0198109    .102636    -0.19   0.847    -.2209738     .181352
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
                         _cons |   .6771111   .1608046     4.21   0.000     .3619399    .9922824
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
                         _cons |   .0668201   .0985169     0.68   0.498    -.1262694    .2599096
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
                         _cons |   .2758797   .1388335     1.99   0.047      .003771    .5479884
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |   .5331561   .3136015     1.70   0.089    -.0814915    1.147804
              z_SHG_before2017 |  -.5044327   .1994346    -2.53   0.011    -.8953173   -.1135482
                          z_HH |    .203265   .2777418     0.73   0.464     -.341099     .747629
                      FES_site |  -.3958435   .4406409    -0.90   0.369    -1.259484    .4677968
                      sequence |   .0447183   .0171311     2.61   0.009     .0111419    .0782947
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
                         _cons |   1.037405   .7468919     1.39   0.165    -.4264766    2.501286
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0068891   .1742541     0.04   0.968    -.3346426    .3484209
               leader_comp3_BS |  -.1292705    .293916    -0.44   0.660    -.7053352    .4467943
               leader_comp4_BS |  -.1331494   .1653909    -0.81   0.421    -.4573096    .1910107
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |  -.0516892   .0515743    -1.00   0.316    -.1527731    .0493946
              z_SHG_before2017 |   .2272703   .0690363     3.29   0.001     .0919615     .362579
                          z_HH |  -.1809819   .0789774    -2.29   0.022    -.3357748    -.026189
                      FES_site |   .2868158   .1103715     2.60   0.009     .0704917    .5031398
                      sequence |  -.0050865   .0057154    -0.89   0.373    -.0162886    .0061155
                 total_leaders |   .0497399   .0556108     0.89   0.371    -.0592552     .158735
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
                         _cons |  -.0189546   .2406838    -0.08   0.937    -.4906863    .4527771
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0489187   .1736482     0.28   0.778    -.2914255     .389263
               leader_comp3_BS |   .4644573   .2248425     2.07   0.039     .0237741    .9051405
               leader_comp4_BS |   -.125413   .1656059    -0.76   0.449    -.4499946    .1991687
      share_female_percent3_BS |  -.0188341   .0333651    -0.56   0.572    -.0842285    .0465603
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2078824   .0553341     3.76   0.000     .0994295    .3163353
              z_SHG_before2017 |  -.0847831   .0649061    -1.31   0.191    -.2119967    .0424304
                          z_HH |    .181209   .0736774     2.46   0.014     .0368041     .325614
                      FES_site |   .0283921   .1359419     0.21   0.835     -.238049    .2948333
                      sequence |   .0110343   .0039686     2.78   0.005     .0032559    .0188126
                 total_leaders |  -.0861377   .0496955    -1.73   0.083    -.1835391    .0112636
  survey_dam_for_irrigation_FS |   .3420162   .1119264     3.06   0.002     .1226445    .5613879
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
                         _cons |   .2796448    .199383     1.40   0.161    -.1111387    .6704282
-------------------------------+----------------------------------------------------------------
         var(e.leader_comp1_BS)|   .0894423   .0168339                      .0618498    .1293443
         var(e.leader_comp2_BS)|     .21125   .0210414                      .1737855    .2567911
         var(e.leader_comp3_BS)|   .1106685   .0278016                      .0676378    .1810752
         var(e.leader_comp4_BS)|   .1490047   .0289977                      .1017532    .2181983
var(e.share_female_percent3_BS)|   1.663778   .3486625                      1.103359    2.508844
    var(e.survey_maint_rule_FS)|   .1412993    .020883                      .1057642    .1887737
    var(e.survey_maint_2017_FS)|   .1168902   .0183991                      .0858608    .1591334
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. estat teffects


Direct effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |   .5331561   .3136015     1.70   0.089    -.0814915    1.147804
              z_SHG_before2017 |  -.5044327   .1994346    -2.53   0.011    -.8953173   -.1135482
                          z_HH |    .203265   .2777418     0.73   0.464     -.341099     .747629
                      FES_site |  -.3958435   .4406409    -0.90   0.369    -1.259484    .4677968
                      sequence |   .0447183   .0171311     2.61   0.009     .0111419    .0782947
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0068891   .1742541     0.04   0.968    -.3346426    .3484209
               leader_comp3_BS |  -.1292705    .293916    -0.44   0.660    -.7053352    .4467943
               leader_comp4_BS |  -.1331494   .1653909    -0.81   0.421    -.4573096    .1910107
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |  -.0516892   .0515743    -1.00   0.316    -.1527731    .0493946
              z_SHG_before2017 |   .2272703   .0690363     3.29   0.001     .0919615     .362579
                          z_HH |  -.1809819   .0789774    -2.29   0.022    -.3357748    -.026189
                      FES_site |   .2868158   .1103715     2.60   0.009     .0704917    .5031398
                      sequence |  -.0050865   .0057154    -0.89   0.373    -.0162886    .0061155
                 total_leaders |   .0497399   .0556108     0.89   0.371    -.0592552     .158735
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0489187   .1736482     0.28   0.778    -.2914255     .389263
               leader_comp3_BS |   .4644573   .2248425     2.07   0.039     .0237741    .9051405
               leader_comp4_BS |   -.125413   .1656059    -0.76   0.449    -.4499946    .1991687
      share_female_percent3_BS |  -.0188341   .0333651    -0.56   0.572    -.0842285    .0465603
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2078824   .0553341     3.76   0.000     .0994295    .3163353
              z_SHG_before2017 |  -.0847831   .0649061    -1.31   0.191    -.2119967    .0424304
                          z_HH |    .181209   .0736774     2.46   0.014     .0368041     .325614
                      FES_site |   .0283921   .1359419     0.21   0.835     -.238049    .2948333
                      sequence |   .0110343   .0039686     2.78   0.005     .0032559    .0188126
                 total_leaders |  -.0861377   .0496955    -1.73   0.083    -.1835391    .0112636
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |   .3420162   .1119264     3.06   0.002     .1226445    .5613879
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |          0  (no path)
               leader_comp3_BS |          0  (no path)
               leader_comp4_BS |          0  (no path)
                          z_VP |  -.0083661   .1120985    -0.07   0.941    -.2280752     .211343
              z_SHG_before2017 |   .1627873   .2041429     0.80   0.425    -.2373256    .5629001
                          z_HH |   .1392668   .1843276     0.76   0.450    -.2220085    .5005422
                      FES_site |   .0292977   .2936398     0.10   0.921    -.5462257    .6048211
                      sequence |  -.0078732   .0094111    -0.84   0.403    -.0263187    .0105723
                 total_leaders |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1278738   .1054215     1.21   0.225    -.0787485    .3344961
               leader_comp3_BS |     .14858    .133904     1.11   0.267    -.1138669     .411027
               leader_comp4_BS |   .3161769   .1318952     2.40   0.017      .057667    .5746869
      share_female_percent3_BS |          0  (no path)
                          z_VP |   .0709724   .0568004     1.25   0.211    -.0403544    .1822993
              z_SHG_before2017 |  -.0590627   .0537368    -1.10   0.272    -.1643848    .0462594
                          z_HH |   .0433536    .048884     0.89   0.375    -.0524572    .1391645
                      FES_site |  -.0505801   .0861752    -0.59   0.557    -.2194803    .1183202
                      sequence |   .0051461   .0036302     1.42   0.156     -.001969    .0122612
                 total_leaders |  -.0587757   .0258295    -2.28   0.023    -.1094006   -.0081508
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |    .033918   .0701145     0.48   0.629    -.1035039    .1713399
               leader_comp3_BS |  -.0120145   .1121098    -0.11   0.915    -.2317456    .2077166
               leader_comp4_BS |   .0276043   .0862253     0.32   0.749    -.1413941    .1966028
      share_female_percent3_BS |   .0544625   .0208361     2.61   0.009     .0136244    .0953006
          survey_maint_rule_FS |          0  (no path)
                          z_VP |   .0252418   .0340742     0.74   0.459    -.0415425     .092026
              z_SHG_before2017 |   .1108874   .0608823     1.82   0.069    -.0084397    .2302145
                          z_HH |  -.1136586   .0499951    -2.27   0.023    -.2116472     -.01567
                      FES_site |   .1783788   .0902383     1.98   0.048      .001515    .3552426
                      sequence |   -.001603   .0036498    -0.44   0.661    -.0087564    .0055504
                 total_leaders |   .0042293   .0248405     0.17   0.865    -.0444573    .0529159
          survey_maint_rule_BS |  -.0119875   .0704623    -0.17   0.865     -.150091    .1261161
  survey_dam_for_irrigation_FS |  -.0895852   .0475755    -1.88   0.060    -.1828314     .003661
           survey_maint_12m_BS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0081502    .041737    -0.20   0.845    -.0899533    .0736529
              z_SHG_before2017 |  -.1738236   .0544967    -3.19   0.001    -.2806351    -.067012
                          z_HH |   .0110443   .0708544     0.16   0.876    -.1278277    .1499163
                      FES_site |  -.2022329   .1085141    -1.86   0.062    -.4149165    .0104508
                      sequence |   .0108781   .0032268     3.37   0.001     .0045537    .0172024
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |  -.0318862   .0699175    -0.46   0.648    -.1689221    .1051497
              z_SHG_before2017 |   .0960156   .0782082     1.23   0.220    -.0572696    .2493009
                          z_HH |  -.0542906   .0836157    -0.65   0.516    -.2181744    .1095931
                      FES_site |   .2082525   .1540109     1.35   0.176    -.0936033    .5101084
                      sequence |  -.0118361   .0039978    -2.96   0.003    -.0196717   -.0040006
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0584585   .0464522     1.26   0.208    -.0325861     .149503
              z_SHG_before2017 |   .0788336   .0462738     1.70   0.088    -.0118614    .1695286
                          z_HH |  -.0806462    .048801    -1.65   0.098    -.1762944     .015002
                      FES_site |   .1221224   .0775223     1.58   0.115    -.0298185    .2740634
                      sequence |  -.0003936   .0031457    -0.13   0.900    -.0065591    .0057719
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0184221   .0651258    -0.28   0.777    -.1460664    .1092222
              z_SHG_before2017 |  -.0010257   .0841269    -0.01   0.990    -.1659113      .16386
                          z_HH |   .1238925   .0958549     1.29   0.196    -.0639796    .3117646
                      FES_site |  -.1281421   .1525639    -0.84   0.401    -.4271619    .1708777
                      sequence |   .0013517   .0035252     0.38   0.701    -.0055575    .0082609
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |    .879558   .7211154     1.22   0.223    -.5338022    2.292918
               leader_comp3_BS |   1.021982   .9458671     1.08   0.280    -.8318832    2.875848
               leader_comp4_BS |   2.174768   .7833714     2.78   0.006     .6393888    3.710148
                          z_VP |     .52479   .3722614     1.41   0.159    -.2048289    1.254409
              z_SHG_before2017 |  -.3416455   .2548285    -1.34   0.180    -.8411002    .1578092
                          z_HH |   .3425318   .3523069     0.97   0.331     -.347977    1.033041
                      FES_site |  -.3665458   .4615255    -0.79   0.427    -1.271119    .5380275
                      sequence |   .0368451   .0205701     1.79   0.073    -.0034715    .0771617
                 total_leaders |  -.4042786   .1666779    -2.43   0.015    -.7309612   -.0775959
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |    .134763   .2064408     0.65   0.514    -.2698536    .5393796
               leader_comp3_BS |   .0193096   .3280192     0.06   0.953    -.6235962    .6622154
               leader_comp4_BS |   .1830275   .2011161     0.91   0.363    -.2111527    .5772077
      share_female_percent3_BS |   .1453842    .031108     4.67   0.000     .0844136    .2063548
                          z_VP |   .0192832   .0745639     0.26   0.796    -.1268593    .1654257
              z_SHG_before2017 |   .1682076   .0662715     2.54   0.011     .0383178    .2980974
                          z_HH |  -.1376283   .0816361    -1.69   0.092    -.2976321    .0223756
                      FES_site |   .2362357   .1260299     1.87   0.061    -.0107783    .4832497
                      sequence |   .0000595   .0059553     0.01   0.992    -.0116127    .0117317
                 total_leaders |  -.0090358   .0633028    -0.14   0.886    -.1331071    .1150355
          survey_maint_rule_BS |  -.0319998    .187001    -0.17   0.864     -.398515    .3345154
  survey_dam_for_irrigation_FS |   -.239142   .1180309    -2.03   0.043    -.4704784   -.0078057
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0828367   .1898869     0.44   0.663    -.2893347    .4550081
               leader_comp3_BS |   .4524428   .2405034     1.88   0.060    -.0189353    .9238209
               leader_comp4_BS |  -.0978086   .1665369    -0.59   0.557    -.4242149    .2285976
      share_female_percent3_BS |   .0356284   .0293257     1.21   0.224    -.0218488    .0931057
          survey_maint_rule_FS |   .3746109   .1100305     3.40   0.001     .1589551    .5902668
                          z_VP |   .2331242   .0567642     4.11   0.000     .1218683      .34438
              z_SHG_before2017 |   .0261043   .0802054     0.33   0.745    -.1310954     .183304
                          z_HH |   .0675504   .0810526     0.83   0.405    -.0913097    .2264106
                      FES_site |    .206771   .1467297     1.41   0.159    -.0808141     .494356
                      sequence |   .0094313   .0045586     2.07   0.039     .0004966    .0183659
                 total_leaders |  -.0819084   .0553561    -1.48   0.139    -.1904044    .0265875
          survey_maint_rule_BS |  -.0119875   .0704623    -0.17   0.865     -.150091    .1261161
  survey_dam_for_irrigation_FS |    .252431   .1224949     2.06   0.039     .0123454    .4925165
           survey_maint_12m_BS |  -.0692917   .1092955    -0.63   0.526     -.283507    .1449236
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. 
. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_wide.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/village_SHG.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           104
        from master                         0  (_merge==1)
        from using                        104  (_merge==2)

    matched                                84  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. save "$working_ANALYSIS/processed/games_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_SHG.dta saved

. 
. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pca Shar_Lit Shar_SCST number_schools distance_mandla,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          4
    Rotation: (unrotated = principal)            Rho              =     0.3384

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.35341      .112193             0.3384       0.3384
           Comp2 |      1.24122      .452421             0.3103       0.6487
           Comp3 |      .788797      .172223             0.1972       0.8459
           Comp4 |      .616574            .             0.1541       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.0142 |       .9997 
       Shar_SCST |  -0.6410 |        .444 
    number_sch~s |   0.6398 |       .4461 
    distance_m~a |   0.4239 |       .7568 
    --------------------------------------

. 
end of do-file

. tab treatment_BS

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2736

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.64182      .353905             0.2736       0.2736
           Comp2 |      1.28791      .259022             0.2147       0.4883
           Comp3 |      1.02889      .243898             0.1715       0.6598
           Comp4 |       .78499     .0540051             0.1308       0.7906
           Comp5 |      .730985      .205575             0.1218       0.9124
           Comp6 |       .52541            .             0.0876       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.1347 |       .9702 
       Shar_SCST |   0.4010 |       .7359 
    n_school_gov |  -0.5093 |       .5741 
    n_school_p~v |   0.2961 |       .8561 
    distance_m~a |  -0.4228 |       .7065 
    distance_b~a |   0.5433 |       .5154 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. predict progressiveness
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.1347 
       Shar_SCST |   0.4010 
    n_school_gov |  -0.5093 
    n_school_p~v |   0.2961 
    distance_m~a |  -0.4228 
    distance_b~a |   0.5433 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.110029 |          1        1.22        1.22
  -2.947031 |          1        1.22        2.44
  -2.291345 |          1        1.22        3.66
  -1.953953 |          1        1.22        4.88
  -1.874257 |          1        1.22        6.10
  -1.859234 |          1        1.22        7.32
  -1.801482 |          1        1.22        8.54
  -1.736638 |          1        1.22        9.76
   -1.69178 |          1        1.22       10.98
  -1.677832 |          1        1.22       12.20
  -1.481222 |          1        1.22       13.41
  -1.383161 |          1        1.22       14.63
  -1.312482 |          1        1.22       15.85
  -1.281764 |          1        1.22       17.07
  -1.164479 |          1        1.22       18.29
  -1.138618 |          1        1.22       19.51
  -1.126202 |          1        1.22       20.73
  -1.005905 |          1        1.22       21.95
  -.9600017 |          1        1.22       23.17
  -.9171062 |          1        1.22       24.39
  -.8908897 |          1        1.22       25.61
  -.8440067 |          1        1.22       26.83
  -.8021951 |          1        1.22       28.05
  -.7817805 |          1        1.22       29.27
  -.7587251 |          1        1.22       30.49
  -.7469965 |          1        1.22       31.71
  -.6265532 |          1        1.22       32.93
   -.614343 |          1        1.22       34.15
  -.5581502 |          1        1.22       35.37
  -.5510303 |          1        1.22       36.59
   -.544726 |          1        1.22       37.80
   -.508401 |          1        1.22       39.02
  -.4856398 |          1        1.22       40.24
  -.4839972 |          1        1.22       41.46
  -.4490393 |          1        1.22       42.68
  -.4298827 |          1        1.22       43.90
  -.4169158 |          1        1.22       45.12
  -.3579699 |          1        1.22       46.34
  -.3455377 |          1        1.22       47.56
  -.1955356 |          1        1.22       48.78
  -.1681046 |          1        1.22       50.00
  -.1277455 |          1        1.22       51.22
   .0292536 |          1        1.22       52.44
   .0605696 |          1        1.22       53.66
   .0740192 |          1        1.22       54.88
   .2265244 |          1        1.22       56.10
   .2687823 |          1        1.22       57.32
   .2928971 |          1        1.22       58.54
   .4243773 |          1        1.22       59.76
   .4642055 |          1        1.22       60.98
   .5562569 |          1        1.22       62.20
   .6612636 |          1        1.22       63.41
   .6862985 |          1        1.22       64.63
   .7853214 |          1        1.22       65.85
   .8167849 |          1        1.22       67.07
   .8536546 |          1        1.22       68.29
   .8617883 |          1        1.22       69.51
   .8661982 |          1        1.22       70.73
   .9245755 |          1        1.22       71.95
   .9799262 |          1        1.22       73.17
   1.048715 |          1        1.22       74.39
   1.056353 |          1        1.22       75.61
    1.10605 |          1        1.22       76.83
   1.156105 |          1        1.22       78.05
   1.196361 |          1        1.22       79.27
   1.214906 |          1        1.22       80.49
   1.236076 |          1        1.22       81.71
   1.292805 |          1        1.22       82.93
   1.345976 |          1        1.22       84.15
   1.348559 |          1        1.22       85.37
   1.500535 |          1        1.22       86.59
   1.515309 |          1        1.22       87.80
   1.648265 |          1        1.22       89.02
   1.660259 |          1        1.22       90.24
   1.686436 |          1        1.22       91.46
   1.807237 |          1        1.22       92.68
   1.810501 |          1        1.22       93.90
   1.913304 |          1        1.22       95.12
   2.022507 |          1        1.22       96.34
   2.190027 |          1        1.22       97.56
   2.204477 |          1        1.22       98.78
   2.609228 |          1        1.22      100.00
------------+-----------------------------------
      Total |         82      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(106 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(147 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(147 real changes made)

. gen VP=100*norm_progressive
(106 missing values generated)

. lab var VP "VP index"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. 
. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_wide.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/village_SHG.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           104
        from master                         0  (_merge==1)
        from using                        104  (_merge==2)

    matched                                84  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. save "$working_ANALYSIS/processed/games_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_SHG.dta saved

. 
. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2736

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.64182      .353905             0.2736       0.2736
           Comp2 |      1.28791      .259022             0.2147       0.4883
           Comp3 |      1.02889      .243898             0.1715       0.6598
           Comp4 |       .78499     .0540051             0.1308       0.7906
           Comp5 |      .730985      .205575             0.1218       0.9124
           Comp6 |       .52541            .             0.0876       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.1347 |       .9702 
       Shar_SCST |   0.4010 |       .7359 
    n_school_gov |  -0.5093 |       .5741 
    n_school_p~v |   0.2961 |       .8561 
    distance_m~a |  -0.4228 |       .7065 
    distance_b~a |   0.5433 |       .5154 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. predict progressiveness
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.1347 
       Shar_SCST |   0.4010 
    n_school_gov |  -0.5093 
    n_school_p~v |   0.2961 
    distance_m~a |  -0.4228 
    distance_b~a |   0.5433 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.110029 |          1        1.22        1.22
  -2.947031 |          1        1.22        2.44
  -2.291345 |          1        1.22        3.66
  -1.953953 |          1        1.22        4.88
  -1.874257 |          1        1.22        6.10
  -1.859234 |          1        1.22        7.32
  -1.801482 |          1        1.22        8.54
  -1.736638 |          1        1.22        9.76
   -1.69178 |          1        1.22       10.98
  -1.677832 |          1        1.22       12.20
  -1.481222 |          1        1.22       13.41
  -1.383161 |          1        1.22       14.63
  -1.312482 |          1        1.22       15.85
  -1.281764 |          1        1.22       17.07
  -1.164479 |          1        1.22       18.29
  -1.138618 |          1        1.22       19.51
  -1.126202 |          1        1.22       20.73
  -1.005905 |          1        1.22       21.95
  -.9600017 |          1        1.22       23.17
  -.9171062 |          1        1.22       24.39
  -.8908897 |          1        1.22       25.61
  -.8440067 |          1        1.22       26.83
  -.8021951 |          1        1.22       28.05
  -.7817805 |          1        1.22       29.27
  -.7587251 |          1        1.22       30.49
  -.7469965 |          1        1.22       31.71
  -.6265532 |          1        1.22       32.93
   -.614343 |          1        1.22       34.15
  -.5581502 |          1        1.22       35.37
  -.5510303 |          1        1.22       36.59
   -.544726 |          1        1.22       37.80
   -.508401 |          1        1.22       39.02
  -.4856398 |          1        1.22       40.24
  -.4839972 |          1        1.22       41.46
  -.4490393 |          1        1.22       42.68
  -.4298827 |          1        1.22       43.90
  -.4169158 |          1        1.22       45.12
  -.3579699 |          1        1.22       46.34
  -.3455377 |          1        1.22       47.56
  -.1955356 |          1        1.22       48.78
  -.1681046 |          1        1.22       50.00
  -.1277455 |          1        1.22       51.22
   .0292536 |          1        1.22       52.44
   .0605696 |          1        1.22       53.66
   .0740192 |          1        1.22       54.88
   .2265244 |          1        1.22       56.10
   .2687823 |          1        1.22       57.32
   .2928971 |          1        1.22       58.54
   .4243773 |          1        1.22       59.76
   .4642055 |          1        1.22       60.98
   .5562569 |          1        1.22       62.20
   .6612636 |          1        1.22       63.41
   .6862985 |          1        1.22       64.63
   .7853214 |          1        1.22       65.85
   .8167849 |          1        1.22       67.07
   .8536546 |          1        1.22       68.29
   .8617883 |          1        1.22       69.51
   .8661982 |          1        1.22       70.73
   .9245755 |          1        1.22       71.95
   .9799262 |          1        1.22       73.17
   1.048715 |          1        1.22       74.39
   1.056353 |          1        1.22       75.61
    1.10605 |          1        1.22       76.83
   1.156105 |          1        1.22       78.05
   1.196361 |          1        1.22       79.27
   1.214906 |          1        1.22       80.49
   1.236076 |          1        1.22       81.71
   1.292805 |          1        1.22       82.93
   1.345976 |          1        1.22       84.15
   1.348559 |          1        1.22       85.37
   1.500535 |          1        1.22       86.59
   1.515309 |          1        1.22       87.80
   1.648265 |          1        1.22       89.02
   1.660259 |          1        1.22       90.24
   1.686436 |          1        1.22       91.46
   1.807237 |          1        1.22       92.68
   1.810501 |          1        1.22       93.90
   1.913304 |          1        1.22       95.12
   2.022507 |          1        1.22       96.34
   2.190027 |          1        1.22       97.56
   2.204477 |          1        1.22       98.78
   2.609228 |          1        1.22      100.00
------------+-----------------------------------
      Total |         82      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(106 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(147 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(147 real changes made)

. gen VP=100*norm_progressive
(106 missing values generated)

. lab var VP "VP index"

. 
end of do-file

. bys treatment_BS: sum VP n_SHG_before2017

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |         26    56.47327    27.52892          0        100
n_SHG_b~2017 |          0

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |         56    53.40549    19.79135   20.21375   92.92301
n_SHG_b~2017 |          0

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |          0
n_SHG_b~2017 |          0


. tab n_SHG_before2017

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        8.89        8.89
          1 |          6        6.67       15.56
         10 |          7        7.78       23.33
         11 |          5        5.56       28.89
         12 |          1        1.11       30.00
         13 |          1        1.11       31.11
         14 |          2        2.22       33.33
         15 |          1        1.11       34.44
         16 |          1        1.11       35.56
         17 |          2        2.22       37.78
         18 |          1        1.11       38.89
          2 |          4        4.44       43.33
         20 |          3        3.33       46.67
         22 |          2        2.22       48.89
          3 |         13       14.44       63.33
          4 |          9       10.00       73.33
         40 |          1        1.11       74.44
          5 |          7        7.78       82.22
          6 |          5        5.56       87.78
          7 |          4        4.44       92.22
          8 |          3        3.33       95.56
          9 |          3        3.33       98.89
         NA |          1        1.11      100.00
------------+-----------------------------------
      Total |         90      100.00

. bys treatment_BS: sum VP  n_SHG_before2017

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |         26    56.47327    27.52892          0        100
n_SHG_b~2017 |          0

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |         56    53.40549    19.79135   20.21375   92.92301
n_SHG_b~2017 |          0

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          VP |          0
n_SHG_b~2017 |          0


. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. 
end of do-file

. tab n_SHG_before2017

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        8.89        8.89
          1 |          6        6.67       15.56
         10 |          7        7.78       23.33
         11 |          5        5.56       28.89
         12 |          1        1.11       30.00
         13 |          1        1.11       31.11
         14 |          2        2.22       33.33
         15 |          1        1.11       34.44
         16 |          1        1.11       35.56
         17 |          2        2.22       37.78
         18 |          1        1.11       38.89
          2 |          4        4.44       43.33
         20 |          3        3.33       46.67
         22 |          2        2.22       48.89
          3 |         13       14.44       63.33
          4 |          9       10.00       73.33
         40 |          1        1.11       74.44
          5 |          7        7.78       82.22
          6 |          5        5.56       87.78
          7 |          4        4.44       92.22
          8 |          3        3.33       95.56
          9 |          3        3.33       98.89
         NA |          1        1.11      100.00
------------+-----------------------------------
      Total |         90      100.00

. sum n_SHG_before2017

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
n_SHG_b~2017 |          0

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_wide.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/village_SHG.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           104
        from master                         0  (_merge==1)
        from using                        104  (_merge==2)

    matched                                84  (_merge==3)
    -----------------------------------------

. 
end of do-file

. tab n_SHG_before2017

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        8.89        8.89
          1 |          6        6.67       15.56
         10 |          7        7.78       23.33
         11 |          5        5.56       28.89
         12 |          1        1.11       30.00
         13 |          1        1.11       31.11
         14 |          2        2.22       33.33
         15 |          1        1.11       34.44
         16 |          1        1.11       35.56
         17 |          2        2.22       37.78
         18 |          1        1.11       38.89
          2 |          4        4.44       43.33
         20 |          3        3.33       46.67
         22 |          2        2.22       48.89
          3 |         13       14.44       63.33
          4 |          9       10.00       73.33
         40 |          1        1.11       74.44
          5 |          7        7.78       82.22
          6 |          5        5.56       87.78
          7 |          4        4.44       92.22
          8 |          3        3.33       95.56
          9 |          3        3.33       98.89
         NA |          1        1.11      100.00
------------+-----------------------------------
      Total |         90      100.00

. bys treatment_BS: tab n_SHG_before2017

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Control

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        3.70        3.70
          1 |          3       11.11       14.81
         10 |          2        7.41       22.22
         11 |          2        7.41       29.63
         14 |          1        3.70       33.33
         20 |          1        3.70       37.04
          3 |          2        7.41       44.44
          4 |          7       25.93       70.37
         40 |          1        3.70       74.07
          5 |          2        7.41       81.48
          6 |          3       11.11       92.59
          7 |          1        3.70       96.30
          9 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = Games

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       10.71       10.71
          1 |          3        5.36       16.07
         10 |          5        8.93       25.00
         11 |          3        5.36       30.36
         12 |          1        1.79       32.14
         13 |          1        1.79       33.93
         14 |          1        1.79       35.71
         15 |          1        1.79       37.50
         17 |          2        3.57       41.07
         18 |          1        1.79       42.86
          2 |          4        7.14       50.00
         20 |          1        1.79       51.79
         22 |          1        1.79       53.57
          3 |         11       19.64       73.21
          5 |          5        8.93       82.14
          6 |          2        3.57       85.71
          7 |          3        5.36       91.07
          8 |          3        5.36       96.43
          9 |          2        3.57      100.00
------------+-----------------------------------
      Total |         56      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> treatment_BS = .

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       14.29       14.29
         16 |          1       14.29       28.57
         20 |          1       14.29       42.86
         22 |          1       14.29       57.14
          4 |          2       28.57       85.71
         NA |          1       14.29      100.00
------------+-----------------------------------
      Total |          7      100.00


. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. drop _merge

. *all information ON SHG for 56 treatment communities and 27 control sites matched
. 
. save "$working_ANALYSIS/processed/games_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_SHG.dta saved

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. 
end of do-file

. ttab n_SHG_before2017
command ttab is unrecognized
r(199);

. tab n_SHG_before2017

n_SHG_befor |
      e2017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        8.89        8.89
          1 |          6        6.67       15.56
         10 |          7        7.78       23.33
         11 |          5        5.56       28.89
         12 |          1        1.11       30.00
         13 |          1        1.11       31.11
         14 |          2        2.22       33.33
         15 |          1        1.11       34.44
         16 |          1        1.11       35.56
         17 |          2        2.22       37.78
         18 |          1        1.11       38.89
          2 |          4        4.44       43.33
         20 |          3        3.33       46.67
         22 |          2        2.22       48.89
          3 |         13       14.44       63.33
          4 |          9       10.00       73.33
         40 |          1        1.11       74.44
          5 |          7        7.78       82.22
          6 |          5        5.56       87.78
          7 |          4        4.44       92.22
          8 |          3        3.33       95.56
          9 |          3        3.33       98.89
         NA |          1        1.11      100.00
------------+-----------------------------------
      Total |         90      100.00

. tab distance_mandla

distance_ma |
       ndla |      Freq.     Percent        Cum.
------------+-----------------------------------
         15 |          1        1.11        1.11
         17 |          1        1.11        2.22
         18 |          1        1.11        3.33
         19 |          1        1.11        4.44
         20 |          2        2.22        6.67
         21 |          2        2.22        8.89
         25 |          1        1.11       10.00
         26 |          2        2.22       12.22
         27 |          2        2.22       14.44
         28 |          2        2.22       16.67
         29 |          2        2.22       18.89
         30 |          2        2.22       21.11
         31 |          2        2.22       23.33
         32 |          3        3.33       26.67
         33 |          1        1.11       27.78
         35 |          3        3.33       31.11
         36 |          3        3.33       34.44
         37 |          5        5.56       40.00
         39 |          2        2.22       42.22
         40 |          3        3.33       45.56
         41 |          1        1.11       46.67
         42 |          3        3.33       50.00
         43 |          2        2.22       52.22
         44 |          2        2.22       54.44
         45 |          2        2.22       56.67
         46 |          4        4.44       61.11
         47 |          3        3.33       64.44
         48 |          3        3.33       67.78
         50 |          8        8.89       76.67
         52 |          3        3.33       80.00
         53 |          2        2.22       82.22
         54 |          2        2.22       84.44
         56 |          3        3.33       87.78
         57 |          1        1.11       88.89
         59 |          1        1.11       90.00
         60 |          1        1.11       91.11
         61 |          1        1.11       92.22
         62 |          2        2.22       94.44
         63 |          1        1.11       95.56
         64 |          1        1.11       96.67
         65 |          1        1.11       97.78
         66 |          1        1.11       98.89
         72 |          1        1.11      100.00
------------+-----------------------------------
      Total |         90      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2736

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.64182      .353905             0.2736       0.2736
           Comp2 |      1.28791      .259022             0.2147       0.4883
           Comp3 |      1.02889      .243898             0.1715       0.6598
           Comp4 |       .78499     .0540051             0.1308       0.7906
           Comp5 |      .730985      .205575             0.1218       0.9124
           Comp6 |       .52541            .             0.0876       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.1347 |       .9702 
       Shar_SCST |   0.4010 |       .7359 
    n_school_gov |  -0.5093 |       .5741 
    n_school_p~v |   0.2961 |       .8561 
    distance_m~a |  -0.4228 |       .7065 
    distance_b~a |   0.5433 |       .5154 
    --------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. predict progressiveness
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.1347 
       Shar_SCST |   0.4010 
    n_school_gov |  -0.5093 
    n_school_p~v |   0.2961 
    distance_m~a |  -0.4228 
    distance_b~a |   0.5433 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.110029 |          1        1.22        1.22
  -2.947031 |          1        1.22        2.44
  -2.291345 |          1        1.22        3.66
  -1.953953 |          1        1.22        4.88
  -1.874257 |          1        1.22        6.10
  -1.859234 |          1        1.22        7.32
  -1.801482 |          1        1.22        8.54
  -1.736638 |          1        1.22        9.76
   -1.69178 |          1        1.22       10.98
  -1.677832 |          1        1.22       12.20
  -1.481222 |          1        1.22       13.41
  -1.383161 |          1        1.22       14.63
  -1.312482 |          1        1.22       15.85
  -1.281764 |          1        1.22       17.07
  -1.164479 |          1        1.22       18.29
  -1.138618 |          1        1.22       19.51
  -1.126202 |          1        1.22       20.73
  -1.005905 |          1        1.22       21.95
  -.9600017 |          1        1.22       23.17
  -.9171062 |          1        1.22       24.39
  -.8908897 |          1        1.22       25.61
  -.8440067 |          1        1.22       26.83
  -.8021951 |          1        1.22       28.05
  -.7817805 |          1        1.22       29.27
  -.7587251 |          1        1.22       30.49
  -.7469965 |          1        1.22       31.71
  -.6265532 |          1        1.22       32.93
   -.614343 |          1        1.22       34.15
  -.5581502 |          1        1.22       35.37
  -.5510303 |          1        1.22       36.59
   -.544726 |          1        1.22       37.80
   -.508401 |          1        1.22       39.02
  -.4856398 |          1        1.22       40.24
  -.4839972 |          1        1.22       41.46
  -.4490393 |          1        1.22       42.68
  -.4298827 |          1        1.22       43.90
  -.4169158 |          1        1.22       45.12
  -.3579699 |          1        1.22       46.34
  -.3455377 |          1        1.22       47.56
  -.1955356 |          1        1.22       48.78
  -.1681046 |          1        1.22       50.00
  -.1277455 |          1        1.22       51.22
   .0292536 |          1        1.22       52.44
   .0605696 |          1        1.22       53.66
   .0740192 |          1        1.22       54.88
   .2265244 |          1        1.22       56.10
   .2687823 |          1        1.22       57.32
   .2928971 |          1        1.22       58.54
   .4243773 |          1        1.22       59.76
   .4642055 |          1        1.22       60.98
   .5562569 |          1        1.22       62.20
   .6612636 |          1        1.22       63.41
   .6862985 |          1        1.22       64.63
   .7853214 |          1        1.22       65.85
   .8167849 |          1        1.22       67.07
   .8536546 |          1        1.22       68.29
   .8617883 |          1        1.22       69.51
   .8661982 |          1        1.22       70.73
   .9245755 |          1        1.22       71.95
   .9799262 |          1        1.22       73.17
   1.048715 |          1        1.22       74.39
   1.056353 |          1        1.22       75.61
    1.10605 |          1        1.22       76.83
   1.156105 |          1        1.22       78.05
   1.196361 |          1        1.22       79.27
   1.214906 |          1        1.22       80.49
   1.236076 |          1        1.22       81.71
   1.292805 |          1        1.22       82.93
   1.345976 |          1        1.22       84.15
   1.348559 |          1        1.22       85.37
   1.500535 |          1        1.22       86.59
   1.515309 |          1        1.22       87.80
   1.648265 |          1        1.22       89.02
   1.660259 |          1        1.22       90.24
   1.686436 |          1        1.22       91.46
   1.807237 |          1        1.22       92.68
   1.810501 |          1        1.22       93.90
   1.913304 |          1        1.22       95.12
   2.022507 |          1        1.22       96.34
   2.190027 |          1        1.22       97.56
   2.204477 |          1        1.22       98.78
   2.609228 |          1        1.22      100.00
------------+-----------------------------------
      Total |         82      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(106 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(147 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(147 real changes made)

. gen VP=100*norm_progressive
(106 missing values generated)

. lab var VP "VP index"

. 
end of do-file

. ttest n_SHG_before2017, by(treatment_BS)
no observations
r(2000);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. destring SHG_before2017 SHG_after2017 n_SHG_before2017 n_SHG_after2017
must specify either generate or replace option
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. destring SHG_before2017 SHG_after2017 n_SHG_before2017 n_SHG_after2017, replace
SHG_before2017: contains nonnumeric characters; no replace
SHG_after2017: contains nonnumeric characters; no replace
n_SHG_before2017: contains nonnumeric characters; no replace
n_SHG_after2017: contains nonnumeric characters; no replace

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. destring SHG_before2017 SHG_after2017 n_SHG_before2017 n_SHG_after2017, replace
SHG_before2017: contains nonnumeric characters; no replace
SHG_after2017: contains nonnumeric characters; no replace
n_SHG_before2017: contains nonnumeric characters; no replace
n_SHG_after2017: contains nonnumeric characters; no replace

. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. destring SHG_before2017 SHG_after2017 n_SHG_before2017 n_SHG_after2017, replace
SHG_before2017: all characters numeric; replaced as byte
(98 missing values generated)
SHG_after2017: all characters numeric; replaced as byte
(98 missing values generated)
n_SHG_before2017: all characters numeric; replaced as byte
(99 missing values generated)
n_SHG_after2017: all characters numeric; replaced as byte
(99 missing values generated)

. 
end of do-file

. sum n_SHG_before2017

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
n_SHG_b~2017 |         89    7.168539    6.619935          0         40

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_wide.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/village_SHG.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           104
        from master                         0  (_merge==1)
        from using                        104  (_merge==2)

    matched                                84  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities and 27 control sites matched
. 
. save "$working_ANALYSIS/processed/games_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_SHG.dta saved

. 
. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2736

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.64182      .353905             0.2736       0.2736
           Comp2 |      1.28791      .259022             0.2147       0.4883
           Comp3 |      1.02889      .243898             0.1715       0.6598
           Comp4 |       .78499     .0540051             0.1308       0.7906
           Comp5 |      .730985      .205575             0.1218       0.9124
           Comp6 |       .52541            .             0.0876       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.1347 |       .9702 
       Shar_SCST |   0.4010 |       .7359 
    n_school_gov |  -0.5093 |       .5741 
    n_school_p~v |   0.2961 |       .8561 
    distance_m~a |  -0.4228 |       .7065 
    distance_b~a |   0.5433 |       .5154 
    --------------------------------------

. 
end of do-file

. ttest n_SHG_before2017, by(treatment_BS)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |      27    7.296296    1.519873    7.897491    4.172153    10.42044
   Games |      56    6.696429    .7402701    5.539674    5.212894    8.179963
---------+--------------------------------------------------------------------
combined |      83    6.891566     .698012    6.359192    5.502998    8.280134
---------+--------------------------------------------------------------------
    diff |            .5998677    1.497614               -2.379914    3.579649
------------------------------------------------------------------------------
    diff = mean(Control) - mean(Games)                            t =   0.4005
Ho: diff = 0                                     degrees of freedom =       81

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6551         Pr(|T| > |t|) = 0.6898          Pr(T > t) = 0.3449

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/SHG_data.xlsx", sheet ("Sample") firstrow
(6 vars, 188 obs)

. destring SHG_before2017 SHG_after2017 n_SHG_before2017 n_SHG_after2017, replace
SHG_before2017: all characters numeric; replaced as byte
(98 missing values generated)
SHG_after2017: all characters numeric; replaced as byte
(98 missing values generated)
n_SHG_before2017: all characters numeric; replaced as byte
(99 missing values generated)
n_SHG_after2017: all characters numeric; replaced as byte
(99 missing values generated)

. save "$working_ANALYSIS/data/village_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/village_SHG.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_wide.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/village_SHG.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           104
        from master                         0  (_merge==1)
        from using                        104  (_merge==2)

    matched                                84  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities and 27 control sites matched
. 
. save "$working_ANALYSIS/processed/games_SHG.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_SHG.dta saved

. 
. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya,factor(1)

Principal components/correlation                 Number of obs    =         82
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2736

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.64182      .353905             0.2736       0.2736
           Comp2 |      1.28791      .259022             0.2147       0.4883
           Comp3 |      1.02889      .243898             0.1715       0.6598
           Comp4 |       .78499     .0540051             0.1308       0.7906
           Comp5 |      .730985      .205575             0.1218       0.9124
           Comp6 |       .52541            .             0.0876       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.1347 |       .9702 
       Shar_SCST |   0.4010 |       .7359 
    n_school_gov |  -0.5093 |       .5741 
    n_school_p~v |   0.2961 |       .8561 
    distance_m~a |  -0.4228 |       .7065 
    distance_b~a |   0.5433 |       .5154 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. predict progressiveness
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.1347 
       Shar_SCST |   0.4010 
    n_school_gov |  -0.5093 
    n_school_p~v |   0.2961 
    distance_m~a |  -0.4228 
    distance_b~a |   0.5433 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.110029 |          1        1.22        1.22
  -2.947031 |          1        1.22        2.44
  -2.291345 |          1        1.22        3.66
  -1.953953 |          1        1.22        4.88
  -1.874257 |          1        1.22        6.10
  -1.859234 |          1        1.22        7.32
  -1.801482 |          1        1.22        8.54
  -1.736638 |          1        1.22        9.76
   -1.69178 |          1        1.22       10.98
  -1.677832 |          1        1.22       12.20
  -1.481222 |          1        1.22       13.41
  -1.383161 |          1        1.22       14.63
  -1.312482 |          1        1.22       15.85
  -1.281764 |          1        1.22       17.07
  -1.164479 |          1        1.22       18.29
  -1.138618 |          1        1.22       19.51
  -1.126202 |          1        1.22       20.73
  -1.005905 |          1        1.22       21.95
  -.9600017 |          1        1.22       23.17
  -.9171062 |          1        1.22       24.39
  -.8908897 |          1        1.22       25.61
  -.8440067 |          1        1.22       26.83
  -.8021951 |          1        1.22       28.05
  -.7817805 |          1        1.22       29.27
  -.7587251 |          1        1.22       30.49
  -.7469965 |          1        1.22       31.71
  -.6265532 |          1        1.22       32.93
   -.614343 |          1        1.22       34.15
  -.5581502 |          1        1.22       35.37
  -.5510303 |          1        1.22       36.59
   -.544726 |          1        1.22       37.80
   -.508401 |          1        1.22       39.02
  -.4856398 |          1        1.22       40.24
  -.4839972 |          1        1.22       41.46
  -.4490393 |          1        1.22       42.68
  -.4298827 |          1        1.22       43.90
  -.4169158 |          1        1.22       45.12
  -.3579699 |          1        1.22       46.34
  -.3455377 |          1        1.22       47.56
  -.1955356 |          1        1.22       48.78
  -.1681046 |          1        1.22       50.00
  -.1277455 |          1        1.22       51.22
   .0292536 |          1        1.22       52.44
   .0605696 |          1        1.22       53.66
   .0740192 |          1        1.22       54.88
   .2265244 |          1        1.22       56.10
   .2687823 |          1        1.22       57.32
   .2928971 |          1        1.22       58.54
   .4243773 |          1        1.22       59.76
   .4642055 |          1        1.22       60.98
   .5562569 |          1        1.22       62.20
   .6612636 |          1        1.22       63.41
   .6862985 |          1        1.22       64.63
   .7853214 |          1        1.22       65.85
   .8167849 |          1        1.22       67.07
   .8536546 |          1        1.22       68.29
   .8617883 |          1        1.22       69.51
   .8661982 |          1        1.22       70.73
   .9245755 |          1        1.22       71.95
   .9799262 |          1        1.22       73.17
   1.048715 |          1        1.22       74.39
   1.056353 |          1        1.22       75.61
    1.10605 |          1        1.22       76.83
   1.156105 |          1        1.22       78.05
   1.196361 |          1        1.22       79.27
   1.214906 |          1        1.22       80.49
   1.236076 |          1        1.22       81.71
   1.292805 |          1        1.22       82.93
   1.345976 |          1        1.22       84.15
   1.348559 |          1        1.22       85.37
   1.500535 |          1        1.22       86.59
   1.515309 |          1        1.22       87.80
   1.648265 |          1        1.22       89.02
   1.660259 |          1        1.22       90.24
   1.686436 |          1        1.22       91.46
   1.807237 |          1        1.22       92.68
   1.810501 |          1        1.22       93.90
   1.913304 |          1        1.22       95.12
   2.022507 |          1        1.22       96.34
   2.190027 |          1        1.22       97.56
   2.204477 |          1        1.22       98.78
   2.609228 |          1        1.22      100.00
------------+-----------------------------------
      Total |         82      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(106 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(147 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(147 real changes made)

. gen VP=100*norm_progressive
(106 missing values generated)

. lab var VP "VP index"

. 
. 
. 
. *----------------------------
. * SAVE FINAL DATASET
. *----------------------------
. save "$working_ANALYSIS/processed/games_clean_final.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_clean_final.dta saved

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
. *REVISIONS
. *Globals
. gen VP10=VP/10
(106 missing values generated)

. gen HH10=No_HH/10
(105 missing values generated)

. 
. egen z_VP2 = std(norm_progressive2)
norm_progressive2 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. mlogit leader_present_BS $village sequence, vce(robust)
variable z_VP not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
. *REVISIONS
. *Globals
. gen VP10=VP/10
(106 missing values generated)

. gen HH10=No_HH/10
(105 missing values generated)

. 
. egen z_VP2 = std(norm_progressive2)
norm_progressive2 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
. *REVISIONS
. *Globals
. egen z_VP = std(VP)
(106 missing values generated)

. egen z_HH = std(No_HH)
(105 missing values generated)

. egen z_SHG_before2017 = std(n_SHG_before2017)
(99 missing values generated)

. global village z_VP z_SHG_before2017 z_HH FES_site 

. global village2 VP n_SHG_before2017 No_HH FES_site 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. mlogit leader_present_BS $village sequence, vce(robust)

Iteration 0:   log pseudolikelihood = -70.202666  
Iteration 1:   log pseudolikelihood = -54.856046  
Iteration 2:   log pseudolikelihood = -50.955776  
Iteration 3:   log pseudolikelihood = -50.259012  
Iteration 4:   log pseudolikelihood = -50.239099  
Iteration 5:   log pseudolikelihood = -50.239028  
Iteration 6:   log pseudolikelihood = -50.239028  

Multinomial logistic regression                 Number of obs     =         56
                                                Wald chi2(15)     =      44.58
                                                Prob > chi2       =     0.0001
Log pseudolikelihood = -50.239028               Pseudo R2         =     0.2844

----------------------------------------------------------------------------------
                 |               Robust
leader_present~S |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
None             |
            z_VP |  -.0878958   .9545953    -0.09   0.927    -1.958868    1.783077
z_SHG_before2017 |  -4.151901   1.509156    -2.75   0.006    -7.109792   -1.194009
            z_HH |  -.2322252   .8574365    -0.27   0.787     -1.91277    1.448319
        FES_site |  -3.346596   1.566734    -2.14   0.033    -6.417338   -.2758541
        sequence |    .193988   .0531688     3.65   0.000     .0897792    .2981969
           _cons |  -7.426021   2.317638    -3.20   0.001    -11.96851   -2.883533
-----------------+----------------------------------------------------------------
Only_Male        |  (base outcome)
-----------------+----------------------------------------------------------------
Both             |
            z_VP |   .2784181   .8022807     0.35   0.729    -1.294023    1.850859
z_SHG_before2017 |    1.28159   .6953806     1.84   0.065    -.0813311    2.644511
            z_HH |  -1.518609   .8393293    -1.81   0.070    -3.163664    .1264461
        FES_site |   1.157318   1.209984     0.96   0.339    -1.214207    3.528844
        sequence |   .0026677   .0437007     0.06   0.951    -.0829842    .0883195
           _cons |   -2.78224   1.545981    -1.80   0.072    -5.812306    .2478265
-----------------+----------------------------------------------------------------
Only_Female      |
            z_VP |  -.0295139   .4767945    -0.06   0.951    -.9640138    .9049861
z_SHG_before2017 |  -.6248833    .675708    -0.92   0.355    -1.949247    .6994801
            z_HH |   1.002274   .6535983     1.53   0.125     -.278755    2.283303
        FES_site |  -1.383219   1.046039    -1.32   0.186    -3.433419      .66698
        sequence |   .0461701   .0253832     1.82   0.069    -.0035801    .0959204
           _cons |  -1.212298   .8581603    -1.41   0.158    -2.894262    .4696648
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

dy/dx w.r.t. : z_VP z_SHG_before2017 z_HH FES_site sequence
1._predict   : Pr(leader_present_BS==None), predict(pr outcome(0))
2._predict   : Pr(leader_present_BS==Only_Male), predict(pr outcome(1))
3._predict   : Pr(leader_present_BS==Both), predict(pr outcome(2))
4._predict   : Pr(leader_present_BS==Only_Female), predict(pr outcome(3))

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
z_VP             |
        _predict |
              1  |  -.0074999    .063679    -0.12   0.906    -.1323085    .1173087
              2  |  -.0173666   .0930735    -0.19   0.852    -.1997873    .1650541
              3  |     .03161    .084967     0.37   0.710    -.1349222    .1981422
              4  |  -.0067435   .0661267    -0.10   0.919    -.1363496    .1228625
-----------------+----------------------------------------------------------------
z_SHG_before2017 |
        _predict |
              1  |  -.2704218   .0599512    -4.51   0.000    -.3879241   -.1529195
              2  |   .0765624   .0957437     0.80   0.424    -.1110918    .2642165
              3  |   .1877572   .0850364     2.21   0.027     .0210889    .3544256
              4  |   .0061023   .0585091     0.10   0.917    -.1085734    .1207779
-----------------+----------------------------------------------------------------
z_HH             |
        _predict |
              1  |  -.0299674   .0502104    -0.60   0.551     -.128378    .0684432
              2  |   .0388612   .1165495     0.33   0.739    -.1895717    .2672941
              3  |  -.1815888   .1067731    -1.70   0.089    -.3908603    .0276827
              4  |    .172695   .0731693     2.36   0.018     .0292857    .3161043
-----------------+----------------------------------------------------------------
FES_site         |
        _predict |
              1  |  -.1945227   .0816646    -2.38   0.017    -.3545823    -.034463
              2  |   .1321618   .1569196     0.84   0.400    -.1753949    .4397186
              3  |   .1810548   .1285215     1.41   0.159    -.0708427    .4329523
              4  |   -.118694   .1099785    -1.08   0.280    -.3342478    .0968598
-----------------+----------------------------------------------------------------
sequence         |
        _predict |
              1  |   .0116061   .0019348     6.00   0.000      .007814    .0153981
              2  |  -.0102298   .0041334    -2.47   0.013     -.018331   -.0021285
              3  |  -.0022811   .0038172    -0.60   0.550    -.0097627    .0052006
              4  |   .0009047   .0026353     0.34   0.731    -.0042604    .0060699
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. sem ($village sequence-> leader_comp1_BS ) ($village sequence-> leader_comp2_BS ) ($village sequence-> leader_comp3_BS ) ($village sequence-> leader_comp4_BS ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_lea
> ders $village sequence -> share_female_percent3_BS , )  (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS survey_maint_rule_BS $village survey_dam_for_irrigation_FS sequence -> sur
> vey_maint_rule_FS, ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS  total_leaders share_female_percent3_BS survey_maint_12m_BS survey_maint_rule_FS $village survey_dam_for_irrigation_FS sequence -> survey_maint_2017
> _FS , ), vce(robust) nocapslatent
(132 observations with missing values excluded)

Endogenous variables

Observed:  leader_comp1_BS leader_comp2_BS leader_comp3_BS leader_comp4_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  z_VP z_SHG_before2017 z_HH FES_site sequence total_leaders survey_maint_rule_BS survey_dam_for_irrigation_FS survey_maint_12m_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -857.74041  
Iteration 1:   log pseudolikelihood = -857.74041  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -857.74041

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0171208   .0555968    -0.31   0.758    -.1260886    .0918469
              z_SHG_before2017 |  -.1947161     .05983    -3.25   0.001    -.3119807   -.0774515
                          z_HH |    .004579   .0747763     0.06   0.951    -.1419799    .1511378
                      FES_site |  -.2020073   .1083558    -1.86   0.062    -.4143807    .0103661
                      sequence |   .0106919   .0033368     3.20   0.001     .0041519     .017232
                         _cons |  -.0188782   .1048973    -0.18   0.857    -.2244732    .1867168
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |   .0004319   .0852913     0.01   0.996     -.166736    .1675999
              z_SHG_before2017 |   .1110461   .0864587     1.28   0.199    -.0584098    .2805021
                          z_HH |  -.0507406    .086845    -0.58   0.559    -.2209537    .1194725
                      FES_site |   .2068082   .1547023     1.34   0.181    -.0964026    .5100191
                      sequence |  -.0110103   .0042037    -2.62   0.009    -.0192493   -.0027712
                         _cons |   .6566729   .1605146     4.09   0.000       .34207    .9712757
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0194465   .0576371     0.34   0.736    -.0935201    .1324131
              z_SHG_before2017 |    .083067   .0531164     1.56   0.118    -.0210392    .1871731
                          z_HH |  -.0784953   .0569199    -1.38   0.168    -.1900562    .0330656
                      FES_site |   .1240718   .0795983     1.56   0.119    -.0319381    .2800817
                      sequence |  -.0014412   .0035179    -0.41   0.682    -.0083361    .0054537
                         _cons |    .097434   .1101422     0.88   0.376    -.1184406    .3133087
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0027576   .0841846    -0.03   0.974    -.1677563    .1622412
              z_SHG_before2017 |    .000603   .0941709     0.01   0.995    -.1839685    .1851746
                          z_HH |   .1246569   .1006854     1.24   0.216    -.0726829    .3219966
                      FES_site |  -.1288727    .151587    -0.85   0.395    -.4259778    .1682323
                      sequence |   .0017595   .0035178     0.50   0.617    -.0051352    .0086543
                         _cons |   .2647713   .1413716     1.87   0.061    -.0123119    .5418546
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .7698709   .7263638     1.06   0.289     -.653776    2.193518
               leader_comp3_BS |   .8733745   .8960951     0.97   0.330    -.8829396    2.629688
               leader_comp4_BS |     2.0827   .7918419     2.63   0.009     .5307189    3.634682
                          z_VP |   .6171709   .3816071     1.62   0.106    -.1307652    1.365107
              z_SHG_before2017 |  -.6339512   .2072298    -3.06   0.002    -1.040114   -.2277883
                          z_HH |   .4069978   .3782036     1.08   0.282    -.3342676    1.148263
                      FES_site |  -.4351454   .4391281    -0.99   0.322    -1.295821    .4255299
                      sequence |   .0483206   .0186804     2.59   0.010     .0117077    .0849334
                 total_leaders |  -.3175432   .1477518    -2.15   0.032    -.6071314   -.0279551
                         _cons |   .9493503   .7911388     1.20   0.230    -.6012532    2.499954
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |     .01731   .1745619     0.10   0.921    -.3248251    .3594451
               leader_comp3_BS |  -.1183474    .293496    -0.40   0.687    -.6935889    .4568941
               leader_comp4_BS |  -.1269938   .1592568    -0.80   0.425    -.4391314    .1851439
      share_female_percent3_BS |   .1473837   .0297695     4.95   0.000     .0890366    .2057308
                          z_VP |  -.0793246    .064535    -1.23   0.219     -.205811    .0471617
              z_SHG_before2017 |   .2631941   .0786696     3.35   0.001     .1090045    .4173837
                          z_HH |  -.2097517   .0807379    -2.60   0.009    -.3679951   -.0515083
                      FES_site |   .2917317   .1110244     2.63   0.009      .074128    .5093355
                      sequence |   -.005927   .0057442    -1.03   0.302    -.0171855    .0053316
                 total_leaders |   .0431763    .054475     0.79   0.428    -.0635927    .1499453
          survey_maint_rule_BS |  -.0359469   .1864051    -0.19   0.847    -.4012941    .3294004
  survey_dam_for_irrigation_FS |  -.2408151   .1172907    -2.05   0.040    -.4707007   -.0109295
                         _cons |  -.0010086   .2422256    -0.00   0.997    -.4757622    .4737449
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0009481   .1686917     0.01   0.996    -.3296815    .3315777
               leader_comp3_BS |   .4128889    .229215     1.80   0.072    -.0363643     .862142
               leader_comp4_BS |  -.1705934   .1634732    -1.04   0.297    -.4909951    .1498082
      share_female_percent3_BS |  -.0158788   .0313622    -0.51   0.613    -.0773475    .0455899
          survey_maint_rule_FS |   .3855046   .1081311     3.57   0.000     .1735714    .5974377
                          z_VP |   .2434595   .0713592     3.41   0.001      .103598    .3833211
              z_SHG_before2017 |  -.1224384   .0742363    -1.65   0.099    -.2679388    .0230621
                          z_HH |   .2640272   .0693381     3.81   0.000     .1281271    .3999273
                      FES_site |    .010623    .139066     0.08   0.939    -.2619415    .2831874
                      sequence |   .0125162    .003996     3.13   0.002     .0046841    .0203483
                 total_leaders |  -.0531182   .0479727    -1.11   0.268     -.147143    .0409067
  survey_dam_for_irrigation_FS |   .3613957   .1124069     3.22   0.001     .1410822    .5817093
           survey_maint_12m_BS |  -.0745535   .1046315    -0.71   0.476    -.2796275    .1305206
                         _cons |   .2356901   .1998891     1.18   0.238    -.1560854    .6274656
-------------------------------+----------------------------------------------------------------
         var(e.leader_comp1_BS)|   .0893554   .0167742                      .0618486    .1290957
         var(e.leader_comp2_BS)|   .2120328   .0214859                      .1738394    .2586174
         var(e.leader_comp3_BS)|   .1131217    .028586                       .068936    .1856291
         var(e.leader_comp4_BS)|   .1492624    .029115                      .1018393    .2187687
var(e.share_female_percent3_BS)|   1.685714   .3872309                      1.074612    2.644334
    var(e.survey_maint_rule_FS)|    .140316   .0209402                      .1047314    .1879911
    var(e.survey_maint_2017_FS)|   .1189451    .018989                      .0869873    .1626435
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. estat teffects


Direct effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0171208   .0555968    -0.31   0.758    -.1260886    .0918469
              z_SHG_before2017 |  -.1947161     .05983    -3.25   0.001    -.3119807   -.0774515
                          z_HH |    .004579   .0747763     0.06   0.951    -.1419799    .1511378
                      FES_site |  -.2020073   .1083558    -1.86   0.062    -.4143807    .0103661
                      sequence |   .0106919   .0033368     3.20   0.001     .0041519     .017232
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |   .0004319   .0852913     0.01   0.996     -.166736    .1675999
              z_SHG_before2017 |   .1110461   .0864587     1.28   0.199    -.0584098    .2805021
                          z_HH |  -.0507406    .086845    -0.58   0.559    -.2209537    .1194725
                      FES_site |   .2068082   .1547023     1.34   0.181    -.0964026    .5100191
                      sequence |  -.0110103   .0042037    -2.62   0.009    -.0192493   -.0027712
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0194465   .0576371     0.34   0.736    -.0935201    .1324131
              z_SHG_before2017 |    .083067   .0531164     1.56   0.118    -.0210392    .1871731
                          z_HH |  -.0784953   .0569199    -1.38   0.168    -.1900562    .0330656
                      FES_site |   .1240718   .0795983     1.56   0.119    -.0319381    .2800817
                      sequence |  -.0014412   .0035179    -0.41   0.682    -.0083361    .0054537
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0027576   .0841846    -0.03   0.974    -.1677563    .1622412
              z_SHG_before2017 |    .000603   .0941709     0.01   0.995    -.1839685    .1851746
                          z_HH |   .1246569   .1006854     1.24   0.216    -.0726829    .3219966
                      FES_site |  -.1288727    .151587    -0.85   0.395    -.4259778    .1682323
                      sequence |   .0017595   .0035178     0.50   0.617    -.0051352    .0086543
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .7698709   .7263638     1.06   0.289     -.653776    2.193518
               leader_comp3_BS |   .8733745   .8960951     0.97   0.330    -.8829396    2.629688
               leader_comp4_BS |     2.0827   .7918419     2.63   0.009     .5307189    3.634682
                          z_VP |   .6171709   .3816071     1.62   0.106    -.1307652    1.365107
              z_SHG_before2017 |  -.6339512   .2072298    -3.06   0.002    -1.040114   -.2277883
                          z_HH |   .4069978   .3782036     1.08   0.282    -.3342676    1.148263
                      FES_site |  -.4351454   .4391281    -0.99   0.322    -1.295821    .4255299
                      sequence |   .0483206   .0186804     2.59   0.010     .0117077    .0849334
                 total_leaders |  -.3175432   .1477518    -2.15   0.032    -.6071314   -.0279551
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |     .01731   .1745619     0.10   0.921    -.3248251    .3594451
               leader_comp3_BS |  -.1183474    .293496    -0.40   0.687    -.6935889    .4568941
               leader_comp4_BS |  -.1269938   .1592568    -0.80   0.425    -.4391314    .1851439
      share_female_percent3_BS |   .1473837   .0297695     4.95   0.000     .0890366    .2057308
                          z_VP |  -.0793246    .064535    -1.23   0.219     -.205811    .0471617
              z_SHG_before2017 |   .2631941   .0786696     3.35   0.001     .1090045    .4173837
                          z_HH |  -.2097517   .0807379    -2.60   0.009    -.3679951   -.0515083
                      FES_site |   .2917317   .1110244     2.63   0.009      .074128    .5093355
                      sequence |   -.005927   .0057442    -1.03   0.302    -.0171855    .0053316
                 total_leaders |   .0431763    .054475     0.79   0.428    -.0635927    .1499453
          survey_maint_rule_BS |  -.0359469   .1864051    -0.19   0.847    -.4012941    .3294004
  survey_dam_for_irrigation_FS |  -.2408151   .1172907    -2.05   0.040    -.4707007   -.0109295
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0009481   .1686917     0.01   0.996    -.3296815    .3315777
               leader_comp3_BS |   .4128889    .229215     1.80   0.072    -.0363643     .862142
               leader_comp4_BS |  -.1705934   .1634732    -1.04   0.297    -.4909951    .1498082
      share_female_percent3_BS |  -.0158788   .0313622    -0.51   0.613    -.0773475    .0455899
          survey_maint_rule_FS |   .3855046   .1081311     3.57   0.000     .1735714    .5974377
                          z_VP |   .2434595   .0713592     3.41   0.001      .103598    .3833211
              z_SHG_before2017 |  -.1224384   .0742363    -1.65   0.099    -.2679388    .0230621
                          z_HH |   .2640272   .0693381     3.81   0.000     .1281271    .3999273
                      FES_site |    .010623    .139066     0.08   0.939    -.2619415    .2831874
                      sequence |   .0125162    .003996     3.13   0.002     .0046841    .0203483
                 total_leaders |  -.0531182   .0479727    -1.11   0.268     -.147143    .0409067
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |   .3613957   .1124069     3.22   0.001     .1410822    .5817093
           survey_maint_12m_BS |  -.0745535   .1046315    -0.71   0.476    -.2796275    .1305206
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |          0  (no path)
              z_SHG_before2017 |          0  (no path)
                          z_HH |          0  (no path)
                      FES_site |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |          0  (no path)
               leader_comp3_BS |          0  (no path)
               leader_comp4_BS |          0  (no path)
                          z_VP |   .0115734   .1420536     0.08   0.935    -.2668466    .2899934
              z_SHG_before2017 |   .1592957   .2234086     0.71   0.476    -.2785771    .5971684
                          z_HH |   .1520035    .191351     0.79   0.427    -.2230376    .5270445
                      FES_site |  -.0008266   .2893766    -0.00   0.998    -.5679943    .5663412
                      sequence |  -.0060706   .0098005    -0.62   0.536    -.0252792    .0131379
                 total_leaders |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1134664   .1060431     1.07   0.285    -.0943743     .321307
               leader_comp3_BS |   .1287211   .1291554     1.00   0.319    -.1244189    .3818611
               leader_comp4_BS |    .306956    .129078     2.38   0.017     .0539677    .5599443
      share_female_percent3_BS |          0  (no path)
                          z_VP |   .0907229   .0644769     1.41   0.159    -.0356496    .2170953
              z_SHG_before2017 |  -.0779416   .0579338    -1.35   0.179    -.1914897    .0356065
                          z_HH |   .0749684   .0662567     1.13   0.258    -.0548924    .2048292
                      FES_site |  -.0589928   .0866945    -0.68   0.496    -.2289108    .1109252
                      sequence |   .0059835    .003903     1.53   0.125    -.0016663    .0136332
                 total_leaders |  -.0468007   .0228777    -2.05   0.041    -.0916401   -.0019613
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0381903   .0723706     0.53   0.598    -.1036534     .180034
               leader_comp3_BS |   -.009869    .117979    -0.08   0.933    -.2411037    .2213657
               leader_comp4_BS |   .0363055   .0814493     0.45   0.656    -.1233322    .1959433
      share_female_percent3_BS |   .0568171   .0202972     2.80   0.005     .0170352    .0965989
          survey_maint_rule_FS |          0  (no path)
                          z_VP |   .0029105   .0441296     0.07   0.947    -.0835819    .0894028
              z_SHG_before2017 |   .1132525   .0703126     1.61   0.107    -.0245578    .2510627
                          z_HH |  -.1145594   .0563081    -2.03   0.042    -.2249213   -.0041975
                      FES_site |   .1700534   .0924108     1.84   0.066    -.0110685    .3511753
                      sequence |  -.0015548   .0037575    -0.41   0.679    -.0089194    .0058099
                 total_leaders |    .003645   .0243751     0.15   0.881    -.0441294    .0514194
          survey_maint_rule_BS |  -.0138577   .0719166    -0.19   0.847    -.1548115    .1270962
  survey_dam_for_irrigation_FS |  -.0928353   .0479939    -1.93   0.053    -.1869016    .0012309
           survey_maint_12m_BS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                          z_VP |  -.0171208   .0555968    -0.31   0.758    -.1260886    .0918469
              z_SHG_before2017 |  -.1947161     .05983    -3.25   0.001    -.3119807   -.0774515
                          z_HH |    .004579   .0747763     0.06   0.951    -.1419799    .1511378
                      FES_site |  -.2020073   .1083558    -1.86   0.062    -.4143807    .0103661
                      sequence |   .0106919   .0033368     3.20   0.001     .0041519     .017232
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                          z_VP |   .0004319   .0852913     0.01   0.996     -.166736    .1675999
              z_SHG_before2017 |   .1110461   .0864587     1.28   0.199    -.0584098    .2805021
                          z_HH |  -.0507406    .086845    -0.58   0.559    -.2209537    .1194725
                      FES_site |   .2068082   .1547023     1.34   0.181    -.0964026    .5100191
                      sequence |  -.0110103   .0042037    -2.62   0.009    -.0192493   -.0027712
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                          z_VP |   .0194465   .0576371     0.34   0.736    -.0935201    .1324131
              z_SHG_before2017 |    .083067   .0531164     1.56   0.118    -.0210392    .1871731
                          z_HH |  -.0784953   .0569199    -1.38   0.168    -.1900562    .0330656
                      FES_site |   .1240718   .0795983     1.56   0.119    -.0319381    .2800817
                      sequence |  -.0014412   .0035179    -0.41   0.682    -.0083361    .0054537
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                          z_VP |  -.0027576   .0841846    -0.03   0.974    -.1677563    .1622412
              z_SHG_before2017 |    .000603   .0941709     0.01   0.995    -.1839685    .1851746
                          z_HH |   .1246569   .1006854     1.24   0.216    -.0726829    .3219966
                      FES_site |  -.1288727    .151587    -0.85   0.395    -.4259778    .1682323
                      sequence |   .0017595   .0035178     0.50   0.617    -.0051352    .0086543
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .7698709   .7263638     1.06   0.289     -.653776    2.193518
               leader_comp3_BS |   .8733745   .8960951     0.97   0.330    -.8829396    2.629688
               leader_comp4_BS |     2.0827   .7918419     2.63   0.009     .5307189    3.634682
                          z_VP |   .6287443   .4317517     1.46   0.145    -.2174734    1.474962
              z_SHG_before2017 |  -.4746556   .2680831    -1.77   0.077    -1.000089    .0507777
                          z_HH |   .5590013   .4511573     1.24   0.215    -.3252508    1.443253
                      FES_site |   -.435972   .4645784    -0.94   0.348    -1.346529     .474585
                      sequence |   .0422499   .0217765     1.94   0.052    -.0004313    .0849311
                 total_leaders |  -.3175432   .1477518    -2.15   0.032    -.6071314   -.0279551
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1307764   .2062833     0.63   0.526    -.2735315    .5350843
               leader_comp3_BS |   .0103737   .3257733     0.03   0.975    -.6281303    .6488777
               leader_comp4_BS |   .1799623   .2012417     0.89   0.371    -.2144641    .5743887
      share_female_percent3_BS |   .1473837   .0297695     4.95   0.000     .0890366    .2057308
                          z_VP |   .0113983     .08747     0.13   0.896    -.1600398    .1828363
              z_SHG_before2017 |   .1852525   .0737407     2.51   0.012     .0407234    .3297816
                          z_HH |  -.1347833   .0931202    -1.45   0.148    -.3172956     .047729
                      FES_site |   .2327389    .128101     1.82   0.069    -.0183344    .4838122
                      sequence |   .0000565   .0061843     0.01   0.993    -.0120644    .0121775
                 total_leaders |  -.0036244   .0602823    -0.06   0.952    -.1217755    .1145268
          survey_maint_rule_BS |  -.0359469   .1864051    -0.19   0.847    -.4012941    .3294004
  survey_dam_for_irrigation_FS |  -.2408151   .1172907    -2.05   0.040    -.4707007   -.0109295
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0391384   .1875997     0.21   0.835    -.3285502    .4068269
               leader_comp3_BS |   .4030199   .2462224     1.64   0.102    -.0795672    .8856069
               leader_comp4_BS |  -.1342879   .1721833    -0.78   0.435     -.471761    .2031852
      share_female_percent3_BS |   .0409383   .0284708     1.44   0.150    -.0148634      .09674
          survey_maint_rule_FS |   .3855046   .1081311     3.57   0.000     .1735714    .5974377
                          z_VP |     .24637   .0837595     2.94   0.003     .0822044    .4105356
              z_SHG_before2017 |  -.0091859   .0932465    -0.10   0.922    -.1919457    .1735739
                          z_HH |   .1494678   .0823884     1.81   0.070    -.0120105    .3109461
                      FES_site |   .1806764   .1489239     1.21   0.225     -.111209    .4725618
                      sequence |   .0109614   .0049402     2.22   0.026     .0012789     .020644
                 total_leaders |  -.0494732   .0539233    -0.92   0.359    -.1551608    .0562145
          survey_maint_rule_BS |  -.0138577   .0719166    -0.19   0.847    -.1548115    .1270962
  survey_dam_for_irrigation_FS |   .2685604   .1239943     2.17   0.030      .025536    .5115848
           survey_maint_12m_BS |  -.0745535   .1046315    -0.71   0.476    -.2796275    .1305206
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==1,factor(1)

Principal components/correlation                 Number of obs    =         56
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2706

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       1.6236      .321093             0.2706       0.2706
           Comp2 |      1.30251      .354573             0.2171       0.4877
           Comp3 |      .947934      .135723             0.1580       0.6457
           Comp4 |      .812211     .0367542             0.1354       0.7810
           Comp5 |      .775457      .237165             0.1292       0.9103
           Comp6 |      .538292            .             0.0897       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.4293 |       .7008 
       Shar_SCST |  -0.1345 |       .9706 
    n_school_gov |  -0.3989 |       .7417 
    n_school_p~v |   0.3848 |       .7596 
    distance_m~a |  -0.3597 |       .7899 
    distance_b~a |   0.6009 |       .4137 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. predict progressiveness if treament_BS==1
treament_BS not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. predict progressiveness if treatment_BS==1
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.4293 
       Shar_SCST |  -0.1345 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.3848 
    distance_m~a |  -0.3597 
    distance_b~a |   0.6009 
    ------------------------

. 
end of do-file

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -1.929242 |          1        1.79        1.79
  -1.787164 |          1        1.79        3.57
   -1.77582 |          1        1.79        5.36
   -1.70614 |          1        1.79        7.14
  -1.496963 |          1        1.79        8.93
  -1.361339 |          1        1.79       10.71
  -1.334418 |          1        1.79       12.50
  -1.089542 |          1        1.79       14.29
  -1.089193 |          1        1.79       16.07
  -1.071595 |          1        1.79       17.86
  -1.054156 |          1        1.79       19.64
  -1.033253 |          1        1.79       21.43
  -1.022799 |          1        1.79       23.21
  -.9568407 |          1        1.79       25.00
  -.9375736 |          1        1.79       26.79
  -.8826711 |          1        1.79       28.57
  -.7363334 |          1        1.79       30.36
  -.6636144 |          1        1.79       32.14
  -.6302326 |          1        1.79       33.93
  -.5243812 |          1        1.79       35.71
  -.4987087 |          1        1.79       37.50
  -.4614216 |          1        1.79       39.29
   -.456519 |          1        1.79       41.07
  -.4543181 |          1        1.79       42.86
  -.3829014 |          1        1.79       44.64
  -.3739886 |          1        1.79       46.43
  -.3448464 |          1        1.79       48.21
  -.3210422 |          1        1.79       50.00
  -.2971204 |          1        1.79       51.79
  -.2783628 |          1        1.79       53.57
  -.2135898 |          1        1.79       55.36
  -.2095408 |          1        1.79       57.14
  -.1798305 |          1        1.79       58.93
   -.093914 |          1        1.79       60.71
  -.0802579 |          1        1.79       62.50
  -.0290428 |          1        1.79       64.29
  -.0237165 |          1        1.79       66.07
   .1890888 |          1        1.79       67.86
   .3088356 |          1        1.79       69.64
   .3656395 |          1        1.79       71.43
   .4840727 |          1        1.79       73.21
   .5975259 |          1        1.79       75.00
   .6209013 |          1        1.79       76.79
   .6776739 |          1        1.79       78.57
   .7435304 |          1        1.79       80.36
   1.141663 |          1        1.79       82.14
   1.370474 |          1        1.79       83.93
   1.562025 |          1        1.79       85.71
   1.822725 |          1        1.79       87.50
   2.304631 |          1        1.79       89.29
   2.320331 |          1        1.79       91.07
    2.42903 |          1        1.79       92.86
   2.449697 |          1        1.79       94.64
    2.50627 |          1        1.79       96.43
   2.515741 |          1        1.79       98.21
   3.372535 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(132 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(160 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(160 real changes made)

. gen VP=100*norm_progressive
(132 missing values generated)

. lab var VP "VP index"

. 
end of do-file

. tab VP

   VP index |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.79        1.79
   2.679835 |          1        1.79        3.57
   2.893798 |          1        1.79        5.36
   4.208065 |          1        1.79        7.14
   8.153489 |          1        1.79        8.93
   10.71158 |          1        1.79       10.71
   11.21935 |          1        1.79       12.50
   15.83809 |          1        1.79       14.29
   15.84468 |          1        1.79       16.07
   16.17661 |          1        1.79       17.86
   16.50553 |          1        1.79       19.64
    16.8998 |          1        1.79       21.43
   17.09698 |          1        1.79       23.21
   18.34105 |          1        1.79       25.00
   18.70446 |          1        1.79       26.79
   19.74001 |          1        1.79       28.57
   22.50017 |          1        1.79       30.36
   23.87177 |          1        1.79       32.14
    24.5014 |          1        1.79       33.93
   26.49793 |          1        1.79       35.71
   26.98215 |          1        1.79       37.50
   27.68545 |          1        1.79       39.29
   27.77792 |          1        1.79       41.07
   27.81943 |          1        1.79       42.86
   29.16647 |          1        1.79       44.64
   29.33458 |          1        1.79       46.43
   29.88425 |          1        1.79       48.21
   30.33323 |          1        1.79       50.00
   30.78443 |          1        1.79       51.79
   31.13823 |          1        1.79       53.57
   32.35995 |          1        1.79       55.36
   32.43633 |          1        1.79       57.14
   32.99671 |          1        1.79       58.93
   34.61723 |          1        1.79       60.71
   34.87481 |          1        1.79       62.50
   35.84081 |          1        1.79       64.29
   35.94127 |          1        1.79       66.07
   39.95512 |          1        1.79       67.86
   42.21373 |          1        1.79       69.64
   43.28514 |          1        1.79       71.43
   45.51899 |          1        1.79       73.21
   47.65889 |          1        1.79       75.00
   48.09979 |          1        1.79       76.79
   49.17061 |          1        1.79       78.57
   50.41277 |          1        1.79       80.36
    57.9222 |          1        1.79       82.14
   62.23794 |          1        1.79       83.93
   65.85088 |          1        1.79       85.71
    70.7681 |          1        1.79       87.50
   79.85763 |          1        1.79       89.29
   80.15375 |          1        1.79       91.07
   82.20399 |          1        1.79       92.86
    82.5938 |          1        1.79       94.64
   83.66087 |          1        1.79       96.43
   83.83949 |          1        1.79       98.21
        100 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==0,factor(1)

Principal components/correlation                 Number of obs    =         26
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.3553

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.13163      .749354             0.3553       0.3553
           Comp2 |      1.38227      .374655             0.2304       0.5857
           Comp3 |      1.00762      .259975             0.1679       0.7536
           Comp4 |      .747644      .310609             0.1246       0.8782
           Comp5 |      .437035      .143235             0.0728       0.9510
           Comp6 |        .2938            .             0.0490       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.0587 |       .9927 
       Shar_SCST |   0.5784 |       .2868 
    n_school_gov |  -0.3989 |       .6608 
    n_school_p~v |   0.1907 |       .9225 
    distance_m~a |  -0.4854 |       .4979 
    distance_b~a |   0.4805 |       .5078 
    --------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==1,factor(1)

Principal components/correlation                 Number of obs    =         56
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2706

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       1.6236      .321093             0.2706       0.2706
           Comp2 |      1.30251      .354573             0.2171       0.4877
           Comp3 |      .947934      .135723             0.1580       0.6457
           Comp4 |      .812211     .0367542             0.1354       0.7810
           Comp5 |      .775457      .237165             0.1292       0.9103
           Comp6 |      .538292            .             0.0897       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.4293 |       .7008 
       Shar_SCST |  -0.1345 |       .9706 
    n_school_gov |  -0.3989 |       .7417 
    n_school_p~v |   0.3848 |       .7596 
    distance_m~a |  -0.3597 |       .7899 
    distance_b~a |   0.6009 |       .4137 
    --------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==0,factor(1)

Principal components/correlation                 Number of obs    =         26
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.3553

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.13163      .749354             0.3553       0.3553
           Comp2 |      1.38227      .374655             0.2304       0.5857
           Comp3 |      1.00762      .259975             0.1679       0.7536
           Comp4 |      .747644      .310609             0.1246       0.8782
           Comp5 |      .437035      .143235             0.0728       0.9510
           Comp6 |        .2938            .             0.0490       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.0587 |       .9927 
       Shar_SCST |   0.5784 |       .2868 
    n_school_gov |  -0.3989 |       .6608 
    n_school_p~v |   0.1907 |       .9225 
    distance_m~a |  -0.4854 |       .4979 
    distance_b~a |   0.4805 |       .5078 
    --------------------------------------

. predict vp_control
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |  -0.0587 
       Shar_SCST |   0.5784 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.1907 
    distance_m~a |  -0.4854 
    distance_b~a |   0.4805 
    ------------------------

. 
end of do-file

. tab vp_control

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.067646 |          1        1.22        1.22
  -2.548575 |          1        1.22        2.44
   -2.10829 |          1        1.22        3.66
  -2.099763 |          1        1.22        4.88
  -1.977343 |          1        1.22        6.10
  -1.905747 |          1        1.22        7.32
  -1.735115 |          1        1.22        8.54
  -1.730749 |          1        1.22        9.76
  -1.575929 |          1        1.22       10.98
  -1.464077 |          1        1.22       12.20
  -1.335136 |          1        1.22       13.41
  -1.299713 |          1        1.22       14.63
  -1.288869 |          1        1.22       15.85
   -1.24818 |          1        1.22       17.07
  -1.226388 |          1        1.22       18.29
  -1.156105 |          1        1.22       19.51
   -1.04739 |          1        1.22       20.73
  -1.038592 |          1        1.22       21.95
  -.9893468 |          1        1.22       23.17
  -.9160016 |          1        1.22       24.39
  -.8193551 |          1        1.22       25.61
  -.7876631 |          1        1.22       26.83
  -.7262341 |          1        1.22       28.05
  -.6887115 |          1        1.22       29.27
  -.6741436 |          1        1.22       30.49
  -.6523533 |          1        1.22       31.71
  -.6186315 |          1        1.22       32.93
  -.5982032 |          1        1.22       34.15
  -.5812187 |          1        1.22       35.37
  -.4688337 |          1        1.22       36.59
  -.4680875 |          1        1.22       37.80
  -.4354438 |          1        1.22       39.02
  -.4191577 |          1        1.22       40.24
  -.3991778 |          1        1.22       41.46
  -.3883781 |          1        1.22       42.68
  -.3780011 |          1        1.22       43.90
  -.3266928 |          1        1.22       45.12
  -.2837299 |          1        1.22       46.34
  -.2172568 |          1        1.22       47.56
  -.2108468 |          1        1.22       48.78
  -.1727052 |          1        1.22       50.00
  -.1349784 |          1        1.22       51.22
  -.0336978 |          1        1.22       52.44
  -.0317531 |          1        1.22       53.66
  -.0118346 |          1        1.22       54.88
     .03513 |          1        1.22       56.10
    .061761 |          1        1.22       57.32
   .2555604 |          1        1.22       58.54
   .3186486 |          1        1.22       59.76
    .327535 |          1        1.22       60.98
   .4164156 |          1        1.22       62.20
   .4565862 |          1        1.22       63.41
    .481077 |          1        1.22       64.63
   .4914274 |          1        1.22       65.85
   .5255193 |          1        1.22       67.07
   .5753109 |          1        1.22       68.29
   .6121833 |          1        1.22       69.51
   .6460248 |          1        1.22       70.73
   .6732372 |          1        1.22       71.95
   .6978132 |          1        1.22       73.17
   .7068801 |          1        1.22       74.39
   .7575716 |          1        1.22       75.61
   .8619856 |          1        1.22       76.83
   .9043614 |          1        1.22       78.05
   .9500555 |          1        1.22       79.27
   1.091892 |          1        1.22       80.49
   1.144676 |          1        1.22       81.71
   1.191103 |          1        1.22       82.93
   1.223061 |          1        1.22       84.15
   1.266784 |          1        1.22       85.37
   1.327365 |          1        1.22       86.59
   1.441595 |          1        1.22       87.80
    1.47676 |          1        1.22       89.02
   1.488751 |          1        1.22       90.24
   1.597949 |          1        1.22       91.46
   1.602204 |          1        1.22       92.68
   1.704674 |          1        1.22       93.90
   1.744071 |          1        1.22       95.12
   1.803217 |          1        1.22       96.34
   1.849265 |          1        1.22       97.56
   1.871043 |          1        1.22       98.78
   2.034641 |          1        1.22      100.00
------------+-----------------------------------
      Total |         82      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. 
. 
. *Merge information on SHG in villages
. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==1,factor(1)

Principal components/correlation                 Number of obs    =         56
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2706

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       1.6236      .321093             0.2706       0.2706
           Comp2 |      1.30251      .354573             0.2171       0.4877
           Comp3 |      .947934      .135723             0.1580       0.6457
           Comp4 |      .812211     .0367542             0.1354       0.7810
           Comp5 |      .775457      .237165             0.1292       0.9103
           Comp6 |      .538292            .             0.0897       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.4293 |       .7008 
       Shar_SCST |  -0.1345 |       .9706 
    n_school_gov |  -0.3989 |       .7417 
    n_school_p~v |   0.3848 |       .7596 
    distance_m~a |  -0.3597 |       .7899 
    distance_b~a |   0.6009 |       .4137 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. predict progressiveness if treatment_BS==1
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.4293 
       Shar_SCST |  -0.1345 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.3848 
    distance_m~a |  -0.3597 
    distance_b~a |   0.6009 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -1.929242 |          1        1.79        1.79
  -1.787164 |          1        1.79        3.57
   -1.77582 |          1        1.79        5.36
   -1.70614 |          1        1.79        7.14
  -1.496963 |          1        1.79        8.93
  -1.361339 |          1        1.79       10.71
  -1.334418 |          1        1.79       12.50
  -1.089542 |          1        1.79       14.29
  -1.089193 |          1        1.79       16.07
  -1.071595 |          1        1.79       17.86
  -1.054156 |          1        1.79       19.64
  -1.033253 |          1        1.79       21.43
  -1.022799 |          1        1.79       23.21
  -.9568407 |          1        1.79       25.00
  -.9375736 |          1        1.79       26.79
  -.8826711 |          1        1.79       28.57
  -.7363334 |          1        1.79       30.36
  -.6636144 |          1        1.79       32.14
  -.6302326 |          1        1.79       33.93
  -.5243812 |          1        1.79       35.71
  -.4987087 |          1        1.79       37.50
  -.4614216 |          1        1.79       39.29
   -.456519 |          1        1.79       41.07
  -.4543181 |          1        1.79       42.86
  -.3829014 |          1        1.79       44.64
  -.3739886 |          1        1.79       46.43
  -.3448464 |          1        1.79       48.21
  -.3210422 |          1        1.79       50.00
  -.2971204 |          1        1.79       51.79
  -.2783628 |          1        1.79       53.57
  -.2135898 |          1        1.79       55.36
  -.2095408 |          1        1.79       57.14
  -.1798305 |          1        1.79       58.93
   -.093914 |          1        1.79       60.71
  -.0802579 |          1        1.79       62.50
  -.0290428 |          1        1.79       64.29
  -.0237165 |          1        1.79       66.07
   .1890888 |          1        1.79       67.86
   .3088356 |          1        1.79       69.64
   .3656395 |          1        1.79       71.43
   .4840727 |          1        1.79       73.21
   .5975259 |          1        1.79       75.00
   .6209013 |          1        1.79       76.79
   .6776739 |          1        1.79       78.57
   .7435304 |          1        1.79       80.36
   1.141663 |          1        1.79       82.14
   1.370474 |          1        1.79       83.93
   1.562025 |          1        1.79       85.71
   1.822725 |          1        1.79       87.50
   2.304631 |          1        1.79       89.29
   2.320331 |          1        1.79       91.07
    2.42903 |          1        1.79       92.86
   2.449697 |          1        1.79       94.64
    2.50627 |          1        1.79       96.43
   2.515741 |          1        1.79       98.21
   3.372535 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(132 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(160 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(160 real changes made)

. gen VP=100*norm_progressive
(132 missing values generated)

. lab var VP "VP index"

. 
. *control sites
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==0,factor(1)

Principal components/correlation                 Number of obs    =         26
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.3553

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.13163      .749354             0.3553       0.3553
           Comp2 |      1.38227      .374655             0.2304       0.5857
           Comp3 |      1.00762      .259975             0.1679       0.7536
           Comp4 |      .747644      .310609             0.1246       0.8782
           Comp5 |      .437035      .143235             0.0728       0.9510
           Comp6 |        .2938            .             0.0490       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.0587 |       .9927 
       Shar_SCST |   0.5784 |       .2868 
    n_school_gov |  -0.3989 |       .6608 
    n_school_p~v |   0.1907 |       .9225 
    distance_m~a |  -0.4854 |       .4979 
    distance_b~a |   0.4805 |       .5078 
    --------------------------------------

. predict vp_control if treatment_BS==0
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |  -0.0587 
       Shar_SCST |   0.5784 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.1907 
    distance_m~a |  -0.4854 
    distance_b~a |   0.4805 
    ------------------------

. tab vp_control

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.067646 |          1        3.85        3.85
  -2.548575 |          1        3.85        7.69
  -2.099763 |          1        3.85       11.54
  -1.977343 |          1        3.85       15.38
  -1.735115 |          1        3.85       19.23
  -1.288869 |          1        3.85       23.08
  -.9160016 |          1        3.85       26.92
  -.6523533 |          1        3.85       30.77
  -.4354438 |          1        3.85       34.62
  -.4191577 |          1        3.85       38.46
  -.3780011 |          1        3.85       42.31
  -.2108468 |          1        3.85       46.15
   .3186486 |          1        3.85       50.00
    .327535 |          1        3.85       53.85
   .4565862 |          1        3.85       57.69
    .481077 |          1        3.85       61.54
   .6460248 |          1        3.85       65.38
   .6978132 |          1        3.85       69.23
   1.223061 |          1        3.85       73.08
   1.327365 |          1        3.85       76.92
   1.441595 |          1        3.85       80.77
    1.47676 |          1        3.85       84.62
   1.704674 |          1        3.85       88.46
   1.744071 |          1        3.85       92.31
   1.849265 |          1        3.85       96.15
   2.034641 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

. su vp_control, meanonly 

. gen norm_vp_control = (vp_control - r(min)) / (r(max) - r(min)) 
(162 missing values generated)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. clear all

. import excel "$working_ANALYSIS/data/Sample_Locations.xlsx", sheet ("Sheet1") firstrow
(6 vars, 90 obs)

. 
. save "$working_ANALYSIS/data/road_distances.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/data/road_distances.dta saved

. 
. 
. use "$working_ANALYSIS/processed/games_SHG.dta"

. merge 1:1 site_ID using "$working_ANALYSIS/data/road_distances.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            98
        from master                        98  (_merge==1)
        from using                          0  (_merge==2)

    matched                                90  (_merge==3)
    -----------------------------------------

. drop _merge

. *all information ON SHG for 56 treatment communities matched
. 
. 
. *Generate progressiveness index
. pwcorr  Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

             | Shar_Lit Shar_S~T n_sch~ov n_sch~iv dista~la dista~ya
-------------+------------------------------------------------------
    Shar_Lit |   1.0000 
   Shar_SCST |  -0.1618   1.0000 
n_school_gov |  -0.0100  -0.2955   1.0000 
n_school_p~v |  -0.0056   0.0946  -0.0774   1.0000 
distance_m~a |  -0.2362  -0.1183   0.1012   0.0323   1.0000 
distance_b~a |   0.0866   0.0801  -0.2170   0.2269  -0.2986   1.0000 

. alpha Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya

Test scale = mean(unstandardized items)
Reversed items:  n_school_gov distance_mandla

Average interitem covariance:     9.307324
Number of items in the scale:            6
Scale reliability coefficient:      0.2948

. 
. 
. 
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==1,factor(1)

Principal components/correlation                 Number of obs    =         56
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.2706

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       1.6236      .321093             0.2706       0.2706
           Comp2 |      1.30251      .354573             0.2171       0.4877
           Comp3 |      .947934      .135723             0.1580       0.6457
           Comp4 |      .812211     .0367542             0.1354       0.7810
           Comp5 |      .775457      .237165             0.1292       0.9103
           Comp6 |      .538292            .             0.0897       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |   0.4293 |       .7008 
       Shar_SCST |  -0.1345 |       .9706 
    n_school_gov |  -0.3989 |       .7417 
    n_school_p~v |   0.3848 |       .7596 
    distance_m~a |  -0.3597 |       .7899 
    distance_b~a |   0.6009 |       .4137 
    --------------------------------------

. *first component loads positively on scheduled caste and distance to the district capital and negatively on number of schools and literacy rate --> reverse it so higher values imply more progressiveness
. predict progressiveness if treatment_BS==1
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |   0.4293 
       Shar_SCST |  -0.1345 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.3848 
    distance_m~a |  -0.3597 
    distance_b~a |   0.6009 
    ------------------------

. tab progressiveness

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -1.929242 |          1        1.79        1.79
  -1.787164 |          1        1.79        3.57
   -1.77582 |          1        1.79        5.36
   -1.70614 |          1        1.79        7.14
  -1.496963 |          1        1.79        8.93
  -1.361339 |          1        1.79       10.71
  -1.334418 |          1        1.79       12.50
  -1.089542 |          1        1.79       14.29
  -1.089193 |          1        1.79       16.07
  -1.071595 |          1        1.79       17.86
  -1.054156 |          1        1.79       19.64
  -1.033253 |          1        1.79       21.43
  -1.022799 |          1        1.79       23.21
  -.9568407 |          1        1.79       25.00
  -.9375736 |          1        1.79       26.79
  -.8826711 |          1        1.79       28.57
  -.7363334 |          1        1.79       30.36
  -.6636144 |          1        1.79       32.14
  -.6302326 |          1        1.79       33.93
  -.5243812 |          1        1.79       35.71
  -.4987087 |          1        1.79       37.50
  -.4614216 |          1        1.79       39.29
   -.456519 |          1        1.79       41.07
  -.4543181 |          1        1.79       42.86
  -.3829014 |          1        1.79       44.64
  -.3739886 |          1        1.79       46.43
  -.3448464 |          1        1.79       48.21
  -.3210422 |          1        1.79       50.00
  -.2971204 |          1        1.79       51.79
  -.2783628 |          1        1.79       53.57
  -.2135898 |          1        1.79       55.36
  -.2095408 |          1        1.79       57.14
  -.1798305 |          1        1.79       58.93
   -.093914 |          1        1.79       60.71
  -.0802579 |          1        1.79       62.50
  -.0290428 |          1        1.79       64.29
  -.0237165 |          1        1.79       66.07
   .1890888 |          1        1.79       67.86
   .3088356 |          1        1.79       69.64
   .3656395 |          1        1.79       71.43
   .4840727 |          1        1.79       73.21
   .5975259 |          1        1.79       75.00
   .6209013 |          1        1.79       76.79
   .6776739 |          1        1.79       78.57
   .7435304 |          1        1.79       80.36
   1.141663 |          1        1.79       82.14
   1.370474 |          1        1.79       83.93
   1.562025 |          1        1.79       85.71
   1.822725 |          1        1.79       87.50
   2.304631 |          1        1.79       89.29
   2.320331 |          1        1.79       91.07
    2.42903 |          1        1.79       92.86
   2.449697 |          1        1.79       94.64
    2.50627 |          1        1.79       96.43
   2.515741 |          1        1.79       98.21
   3.372535 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. su progressiveness, meanonly 

. gen norm_progressive = (progressiveness - r(min)) / (r(max) - r(min)) 
(132 missing values generated)

. 
. egen med_progressive = median(norm_progressive)

. gen d_progressive = 0 if norm_progressive<= med_progressive
(160 missing values generated)

. replace  d_progressive = 1 if norm_progressive> med_progressive
(160 real changes made)

. gen VP=100*norm_progressive
(132 missing values generated)

. lab var VP "VP index"

. 
. *control sites
. pca Shar_Lit Shar_SCST n_school_gov n_school_priv distance_mandla distance_bychhiya if treatment_BS==0,factor(1)

Principal components/correlation                 Number of obs    =         26
                                                 Number of comp.  =          1
                                                 Trace            =          6
    Rotation: (unrotated = principal)            Rho              =     0.3553

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.13163      .749354             0.3553       0.3553
           Comp2 |      1.38227      .374655             0.2304       0.5857
           Comp3 |      1.00762      .259975             0.1679       0.7536
           Comp4 |      .747644      .310609             0.1246       0.8782
           Comp5 |      .437035      .143235             0.0728       0.9510
           Comp6 |        .2938            .             0.0490       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.0587 |       .9927 
       Shar_SCST |   0.5784 |       .2868 
    n_school_gov |  -0.3989 |       .6608 
    n_school_p~v |   0.1907 |       .9225 
    distance_m~a |  -0.4854 |       .4979 
    distance_b~a |   0.4805 |       .5078 
    --------------------------------------

. predict vp_control if treatment_BS==0
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |  -0.0587 
       Shar_SCST |   0.5784 
    n_school_gov |  -0.3989 
    n_school_p~v |   0.1907 
    distance_m~a |  -0.4854 
    distance_b~a |   0.4805 
    ------------------------

. tab vp_control

 Scores for |
component 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  -3.067646 |          1        3.85        3.85
  -2.548575 |          1        3.85        7.69
  -2.099763 |          1        3.85       11.54
  -1.977343 |          1        3.85       15.38
  -1.735115 |          1        3.85       19.23
  -1.288869 |          1        3.85       23.08
  -.9160016 |          1        3.85       26.92
  -.6523533 |          1        3.85       30.77
  -.4354438 |          1        3.85       34.62
  -.4191577 |          1        3.85       38.46
  -.3780011 |          1        3.85       42.31
  -.2108468 |          1        3.85       46.15
   .3186486 |          1        3.85       50.00
    .327535 |          1        3.85       53.85
   .4565862 |          1        3.85       57.69
    .481077 |          1        3.85       61.54
   .6460248 |          1        3.85       65.38
   .6978132 |          1        3.85       69.23
   1.223061 |          1        3.85       73.08
   1.327365 |          1        3.85       76.92
   1.441595 |          1        3.85       80.77
    1.47676 |          1        3.85       84.62
   1.704674 |          1        3.85       88.46
   1.744071 |          1        3.85       92.31
   1.849265 |          1        3.85       96.15
   2.034641 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

. su vp_control, meanonly 

. gen norm_vp_control = (vp_control - r(min)) / (r(max) - r(min)) 
(162 missing values generated)

. 
. gen VP_control=100*norm_vp_control
(162 missing values generated)

. lab var VP_control "Control:VP index"

. 
. 
. *----------------------------
. * SAVE FINAL DATASET
. *----------------------------
. save "$working_ANALYSIS/processed/games_clean_final.dta", replace
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/processed/games_clean_final.dta saved

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. prtest leader_comp1_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .0357143   .0350707                     -.0330231    .1044517
           1 |   .2857143   .0853735                      .1183854    .4530432
-------------+----------------------------------------------------------------
        diff |       -.25   .0922962                     -.4308972   -.0691028
             |  under Ho:   .0981563    -2.55   0.011
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -2.5470
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0054         Pr(|Z| > |z|) = 0.0109          Pr(Z > z) = 0.9946

. prtest leader_comp2_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .6071429   .0922962                      .4262457    .7880401
           1 |   .3571429   .0905522                      .1796637     .534622
-------------+----------------------------------------------------------------
        diff |        .25   .1292992                     -.0034219    .5034219
             |  under Ho:   .1335454     1.87   0.061
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   1.8720
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9694         Pr(|Z| > |z|) = 0.0612          Pr(Z > z) = 0.0306

. prtest leader_comp3_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |   .1071429   .0584512                     -.0074194    .2217051
-------------+----------------------------------------------------------------
        diff |   .0714286   .0930336                     -.1109139     .253771
             |  under Ho:    .093522     0.76   0.445
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =   0.7638
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7775         Pr(|Z| > |z|) = 0.4450          Pr(Z > z) = 0.2225

. prtest leader_comp4_BS, by(seq_split)

Two-sample test of proportions                     0: Number of obs =       28
                                                   1: Number of obs =       28
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |   .1785714   .0723789                      .0367114    .3204314
           1 |        .25   .0818317                      .0896128    .4103872
-------------+----------------------------------------------------------------
        diff |  -.0714286    .109248                     -.2855508    .1426936
             |  under Ho:   .1096642    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -0.6513
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| > |z|) = 0.5148          Pr(Z > z) = 0.7426

. ttest game_no_leader_fem_vill, by(seq_split)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      28    2.535714    .3654458    1.933757    1.785881    3.285547
       1 |      28    4.321429    .4961587    2.625425    3.303395    5.339462
---------+--------------------------------------------------------------------
combined |      56    3.428571    .3281759    2.455844    2.770892    4.086251
---------+--------------------------------------------------------------------
    diff |           -1.785714    .6162176               -3.021156   -.5502724
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8979
Ho: diff = 0                                     degrees of freedom =       54

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0027         Pr(|T| > |t|) = 0.0054          Pr(T > t) = 0.9973

. 
. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab game_sum_leader_SHG if female_leader_present_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       90.00       90.00
          1 |          1       10.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

     Sum of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       40.00       40.00
          1 |          6       60.00      100.00
------------+-----------------------------------
      Total |         10      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .
no observations


. bys seq_split: tab1 SHG_before2017 if treatment_BS==1

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 0

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       14.29       14.29
          1 |         24       85.71      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = 1

-> tabulation of SHG_before2017 if treatment_BS==1 

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        7.14        7.14
          1 |         26       92.86      100.00
------------+-----------------------------------
      Total |         28      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> seq_split = .

-> tabulation of SHG_before2017 if treatment_BS==1 
no observations

. 
. 
. *REVISIONS
. *Globals
. egen z_VP = std(VP)
(132 missing values generated)

. egen z_HH = std(No_HH)
(105 missing values generated)

. egen z_SHG_before2017 = std(n_SHG_before2017)
(99 missing values generated)

. global village z_VP z_SHG_before2017 z_HH FES_site 

. global village2 VP n_SHG_before2017 No_HH FES_site 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. mlogit leader_present_BS $village sequence, vce(robust)

Iteration 0:   log pseudolikelihood = -70.202666  
Iteration 1:   log pseudolikelihood = -54.161871  
Iteration 2:   log pseudolikelihood = -49.942549  
Iteration 3:   log pseudolikelihood = -49.241518  
Iteration 4:   log pseudolikelihood = -49.226159  
Iteration 5:   log pseudolikelihood =  -49.22612  
Iteration 6:   log pseudolikelihood =  -49.22612  

Multinomial logistic regression                 Number of obs     =         56
                                                Wald chi2(15)     =      41.15
                                                Prob > chi2       =     0.0003
Log pseudolikelihood =  -49.22612               Pseudo R2         =     0.2988

----------------------------------------------------------------------------------
                 |               Robust
leader_present~S |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
None             |
            z_VP |   .2296097   .6152921     0.37   0.709    -.9763406     1.43556
z_SHG_before2017 |  -4.203998   1.463892    -2.87   0.004    -7.073174   -1.334823
            z_HH |  -.1658355   .7416255    -0.22   0.823    -1.619395    1.287724
        FES_site |  -3.432065   1.479231    -2.32   0.020    -6.331305   -.5328245
        sequence |    .197278   .0518618     3.80   0.000     .0956308    .2989253
           _cons |  -7.367536    2.26036    -3.26   0.001    -11.79776   -2.937311
-----------------+----------------------------------------------------------------
Only_Male        |  (base outcome)
-----------------+----------------------------------------------------------------
Both             |
            z_VP |   .7880027   .4852634     1.62   0.104     -.163096    1.739101
z_SHG_before2017 |   1.751401   .9029761     1.94   0.052    -.0183994    3.521202
            z_HH |  -2.045243   .8157175    -2.51   0.012    -3.644019   -.4464656
        FES_site |   1.221231   1.105679     1.10   0.269    -.9458598    3.388322
        sequence |   .0153633   .0387073     0.40   0.691    -.0605016    .0912283
           _cons |  -3.505463    1.34682    -2.60   0.009    -6.145183   -.8657438
-----------------+----------------------------------------------------------------
Only_Female      |
            z_VP |  -.0463444   .4162294    -0.11   0.911     -.862139    .7694503
z_SHG_before2017 |  -.6322872   .6662483    -0.95   0.343     -1.93811    .6735355
            z_HH |   1.016056   .6235594     1.63   0.103    -.2060979     2.23821
        FES_site |  -1.391544   1.043682    -1.33   0.182    -3.437123    .6540348
        sequence |    .046812   .0268365     1.74   0.081    -.0057864    .0994105
           _cons |  -1.230598   .9035517    -1.36   0.173    -3.001527    .5403304
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

dy/dx w.r.t. : z_VP z_SHG_before2017 z_HH FES_site sequence
1._predict   : Pr(leader_present_BS==None), predict(pr outcome(0))
2._predict   : Pr(leader_present_BS==Only_Male), predict(pr outcome(1))
3._predict   : Pr(leader_present_BS==Both), predict(pr outcome(2))
4._predict   : Pr(leader_present_BS==Only_Female), predict(pr outcome(3))

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
z_VP             |
        _predict |
              1  |   .0091032   .0389776     0.23   0.815    -.0672916    .0854979
              2  |  -.0636835   .0609678    -1.04   0.296    -.1831782    .0558112
              3  |   .0806422   .0450633     1.79   0.074    -.0076803    .1689647
              4  |  -.0260619   .0516189    -0.50   0.614    -.1272331    .0751094
-----------------+----------------------------------------------------------------
z_SHG_before2017 |
        _predict |
              1  |  -.2783795   .0581265    -4.79   0.000    -.3923052   -.1644537
              2  |   .0464103    .099332     0.47   0.640    -.1482769    .2410976
              3  |   .2326547   .0945268     2.46   0.014     .0473856    .4179238
              4  |  -.0006855    .056494    -0.01   0.990    -.1114118    .1100407
-----------------+----------------------------------------------------------------
z_HH             |
        _predict |
              1  |   -.019694    .045476    -0.43   0.665    -.1088254    .0694374
              2  |    .069889   .1049696     0.67   0.506    -.1358477    .2756257
              3  |  -.2285944   .0985736    -2.32   0.020    -.4217952   -.0353937
              4  |   .1783994   .0664831     2.68   0.007      .048095    .3087039
-----------------+----------------------------------------------------------------
FES_site         |
        _predict |
              1  |   -.201221    .078952    -2.55   0.011    -.3559641   -.0464779
              2  |    .134911   .1386789     0.97   0.331    -.1368946    .4067166
              3  |   .1831152   .1105981     1.66   0.098    -.0336531    .3998836
              4  |  -.1168052   .1111644    -1.05   0.293    -.3346835     .101073
-----------------+----------------------------------------------------------------
sequence         |
        _predict |
              1  |   .0116727   .0018241     6.40   0.000     .0080975    .0152479
              2  |  -.0113354   .0037369    -3.03   0.002    -.0186596   -.0040112
              3  |  -.0010559   .0029735    -0.36   0.722    -.0068838    .0047719
              4  |   .0007186    .002727     0.26   0.792    -.0046262    .0060634
----------------------------------------------------------------------------------

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. egen z_VP_control = std(VP_control)
(162 missing values generated)

. 
end of do-file

. tab FES_site

    NGO active in village |
                     (=1) |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NGO not active in village |         33       39.29       39.29
    NGO active in village |         51       60.71      100.00
--------------------------+-----------------------------------
                    Total |         84      100.00

. tab survey_dam_for_irrigation_FS

   Dam used |
        for |
 irrigation |
       (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50       59.52       59.52
          1 |         34       40.48      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6e58_000000.tmp"

. reg survey_maint_2017_FS z_VP_control z_SHG_before2017 z_HH survey_maint_12m_BS survey_maint_rule_FS FES_site survey_dam_for_irrigation_FS, vce(robust)

Linear regression                               Number of obs     =         26
                                                F(7, 18)          =      10.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4564
                                                Root MSE          =     .44308

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                z_VP_control |  -.1017575   .1702149    -0.60   0.557    -.4593656    .2558507
            z_SHG_before2017 |   .1374872   .1033577     1.33   0.200    -.0796594    .3546337
                        z_HH |  -.1148759   .1827061    -0.63   0.537    -.4987272    .2689754
         survey_maint_12m_BS |   .5661713   .1674596     3.38   0.003     .2143516    .9179909
        survey_maint_rule_FS |    -.18971    .217656    -0.87   0.395    -.6469884    .2675683
                    FES_site |  -.2621607   .2021532    -1.30   0.211    -.6868688    .1625475
survey_dam_for_irrigation_FS |  -.4027032   .2328996    -1.73   0.101    -.8920072    .0866008
                       _cons |    .535188   .2166819     2.47   0.024     .0799562    .9904199
----------------------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
