--------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for 
> Sustainability\analysis/scripts/logs/2024.07.16-10.50.
> 40.log.txt
  log type:  text
 opened on:  16 Jul 2024, 10:50:40

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 16 Jul 2024 10:50:40

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",
> c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 1
> 6
. version 16              // Set Version number for back
> ward compatibility

. 
. * All required Stata packages are available in the /li
> braries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Gam
> es for Sustainability\analysis/scripts/libraries/stata
> "
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatal
> asso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanuml
> ib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;l
> matasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/librari
> es/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference 
> scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphre
> gion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. M
> ultiplying the color, that is "xx yy zz*0.5" reduces/i
> ncreases intensity and "xx yy zz%50" reduces transpare
> ncy)
. grstyle set color       "100 143 255" "120 94 240" "22
> 0 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0
> .4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "
> 255 176 0*0.4" ///
>                                         "100 143 255*1
> .7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "
> 255 176 0*1.7" ///
>                                         : p# p#line p#
> lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis tit
> les
. grstyle set size 8pt: p#label p#boxlabel body small_bo
> dy text_option axis_label tick_label minortick_label k
> ey_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.t
> mp"

. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean.dta", cle
> ar

. 
. 
. 
. *Sequence of interventions in treatment villages
. sort game_date_intervention

. gen sequence=[_n]

. gen seq_split= 0

. replace seq_split=1 if sequence>28
(56 real changes made)

. lab var sequence "Sequence of game interventions (1 to
>  56)"

. 
. 
. 
. *REVISIONS
. egen n_school_gov = rowtotal(census_gov_school_middle 
> census_gov_school_prim census_gov_school_sec)

. egen n_school_priv = rowtotal(census_priv_school_middl
> e census_priv_school_prim census_priv_school_sec)

. 
. gen d_public_school = 0 if n_school_gov==0
(74 missing values generated)

. replace d_public_school = 1 if n_school_gov>0
(74 real changes made)

. 
. gen d_private_school = 0 if n_school_priv==0
(7 missing values generated)

. replace d_private_school = 1 if n_school_priv>0
(7 real changes made)

. 
. gen no_school = 1 if d_public_school==0 & d_private_sc
> hool==0
(75 missing values generated)

. replace no_school = 0 if  d_public_school>0 | d_privat
> e_school>0
(75 real changes made)

. 
. tab1 d_public_school d_private_school no_school

-> tabulation of d_public_school  

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of d_private_school  

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

-> tabulation of no_school  

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       89.29       89.29
          1 |          9       10.71      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
. *GLobals
. global village  No_HH FES_site Shar_Lit Shar_SCST d_pr
> ivate_school no_school

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.t
> mp"

. factor Shar_Lit Shar_SCST d_private_school no_school
(obs=83)

Factor analysis/correlation                      Number 
> of obs    =         83
    Method: principal factors                    Retaine
> d factors =          3
    Rotation: (unrotated)                        Number 
> of params =          6

    ----------------------------------------------------
> ----------------------
         Factor  |   Eigenvalue   Difference        Prop
> ortion   Cumulative
    -------------+--------------------------------------
> ----------------------
        Factor1  |      0.28727      0.16522            
> 1.5825       1.5825
        Factor2  |      0.12204      0.08863            
> 0.6723       2.2548
        Factor3  |      0.03341      0.29460            
> 0.1840       2.4389
        Factor4  |     -0.26119            .           -
> 1.4389       1.0000
    ----------------------------------------------------
> ----------------------
    LR test: independent vs. saturated:  chi2(6)  =    7
> .16 Prob>chi2 = 0.3067

Factor loadings (pattern matrix) and unique variances

    --------------------------------------------
        Variable |  Factor1   Factor2   Factor3 
    -------------+------------------------------
        Shar_Lit |  -0.2075    0.1752    0.1153 
       Shar_SCST |   0.3995   -0.0743    0.0367 
    d_private_~l |  -0.0258   -0.2047    0.1299 
       no_school |   0.2898    0.2096    0.0435 
    --------------------------------------------

    ----------------------------
        Variable |   Uniqueness 
    -------------+--------------
        Shar_Lit |      0.9130  
       Shar_SCST |      0.8335  
    d_private_~l |      0.9406  
       no_school |      0.8702  
    ----------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. factor Shar_Lit Shar_SCST d_private_school no_school
(obs=83)

Factor analysis/correlation                      Number of obs    =         83
    Method: principal factors                    Retained factors =          3
    Rotation: (unrotated)                        Number of params =          6

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      0.28727      0.16522            1.5825       1.5825
        Factor2  |      0.12204      0.08863            0.6723       2.2548
        Factor3  |      0.03341      0.29460            0.1840       2.4389
        Factor4  |     -0.26119            .           -1.4389       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(6)  =    7.16 Prob>chi2 = 0.3067

Factor loadings (pattern matrix) and unique variances

    -----------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3 |   Uniqueness 
    -------------+------------------------------+--------------
        Shar_Lit |  -0.2075    0.1752    0.1153 |      0.9130  
       Shar_SCST |   0.3995   -0.0743    0.0367 |      0.8335  
    d_private_~l |  -0.0258   -0.2047    0.1299 |      0.9406  
       no_school |   0.2898    0.2096    0.0435 |      0.8702  
    -----------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. alpha  Shar_Lit Shar_SCST d_private_school no_school

Test scale = mean(unstandardized items)
Reversed items:  Shar_Lit d_private_school

Average interitem covariance:     4.470979
Number of items in the scale:            4
Scale reliability coefficient:      0.1442

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. alpha  Shar_Lit Shar_SCST n_school_gov n_school_priv

Test scale = mean(unstandardized items)
Reversed items:  Shar_Lit n_school_gov

Average interitem covariance:     5.548634
Number of items in the scale:            4
Scale reliability coefficient:      0.1740

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. factor   Shar_Lit Shar_SCST n_school_gov n_school_priv
(obs=83)

Factor analysis/correlation                      Number of obs    =         83
    Method: principal factors                    Retained factors =          2
    Rotation: (unrotated)                        Number of params =          6

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      0.46719      0.40531            1.8302       1.8302
        Factor2  |      0.06189      0.09038            0.2424       2.0726
        Factor3  |     -0.02850      0.21682           -0.1116       1.9610
        Factor4  |     -0.24531            .           -0.9610       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(6)  =   10.84 Prob>chi2 = 0.0935

Factor loadings (pattern matrix) and unique variances

    -------------------------------------------------
        Variable |  Factor1   Factor2 |   Uniqueness 
    -------------+--------------------+--------------
        Shar_Lit |  -0.1712    0.2124 |      0.9256  
       Shar_SCST |   0.4821   -0.0383 |      0.7661  
    n_school_gov |  -0.4167   -0.1007 |      0.8162  
    n_school_p~v |   0.1785    0.0719 |      0.9630  
    -------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. pca   Shar_Lit Shar_SCST n_school_gov n_school_priv

Principal components/correlation                 Number of obs    =         83
                                                 Number of comp.  =          4
                                                 Trace            =          4
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.37235      .348165             0.3431       0.3431
           Comp2 |      1.02418     .0789575             0.2560       0.5991
           Comp3 |      .945224      .286978             0.2363       0.8354
           Comp4 |      .658246            .             0.1646       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4 | Unexplained 
    -------------+----------------------------------------+-------------
        Shar_Lit |  -0.2838    0.8417   -0.2950    0.3521 |           0 
       Shar_SCST |   0.6794   -0.1208   -0.1543    0.7072 |           0 
    n_school_gov |  -0.6010   -0.3165    0.4054    0.6118 |           0 
    n_school_p~v |   0.3110    0.4205    0.8513   -0.0412 |           0 
    --------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. pca Shar_Lit Shar_SCST n_school_gov n_school_priv, factor(1)

Principal components/correlation                 Number of obs    =         83
                                                 Number of comp.  =          1
                                                 Trace            =          4
    Rotation: (unrotated = principal)            Rho              =     0.3431

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.37235      .348165             0.3431       0.3431
           Comp2 |      1.02418     .0789575             0.2560       0.5991
           Comp3 |      .945224      .286978             0.2363       0.8354
           Comp4 |      .658246            .             0.1646       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
        Shar_Lit |  -0.2838 |       .8894 
       Shar_SCST |   0.6794 |       .3666 
    n_school_gov |  -0.6010 |       .5043 
    n_school_p~v |   0.3110 |       .8673 
    --------------------------------------

. predict progressiveness 
(score assumed)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
        Shar_Lit |  -0.2838 
       Shar_SCST |   0.6794 
    n_school_gov |  -0.6010 
    n_school_p~v |   0.3110 
    ------------------------

. 
end of do-file

. hist progressiveness
(bin=9, start=-3.5123858, width=.66320809)

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. eststo lpm_female_leader1:reg leader2_3_BS progressiveness No_HH FES_site, vce(robust)

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       0.74
                                                Prob > F          =     0.5338
                                                R-squared         =     0.0486
                                                Root MSE          =     .42736

---------------------------------------------------------------------------------
                |               Robust
   leader2_3_BS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
progressiveness |  -.0405402   .0769332    -0.53   0.600    -.1949181    .1138376
          No_HH |   .0005913   .0008588     0.69   0.494    -.0011321    .0023147
       FES_site |  -.0302156    .148732    -0.20   0.840    -.3286681    .2682369
          _cons |   .1553446   .2150149     0.72   0.473    -.2761145    .5868036
---------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. 
. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. sort site_ID round

. 
. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. drop if round!=1
(7,560 observations deleted)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. tab leader_type

           leader_type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
             no leader |        743       88.45       88.45
          state leader |         40        4.76       93.21
             CR leader |         47        5.60       98.81
            SHG leader |          7        0.83       99.64
Social  culture leader |          3        0.36      100.00
-----------------------+-----------------------------------
                 Total |        840      100.00

. 
end of do-file

. tab leader_no

  No leader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         97       11.55       11.55
          1 |        743       88.45      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab leader_type

           leader_type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
             no leader |        743       88.45       88.45
          state leader |         40        4.76       93.21
             CR leader |         47        5.60       98.81
            SHG leader |          7        0.83       99.64
Social  culture leader |          3        0.36      100.00
-----------------------+-----------------------------------
                 Total |        840      100.00

. 
. , nola
, is not a valid command name
r(199);

. tab leader_type, nola

leader_type |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        743       88.45       88.45
          2 |         40        4.76       93.21
          3 |         47        5.60       98.81
          4 |          7        0.83       99.64
          5 |          3        0.36      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab no_leader
no_leader ambiguous abbreviation
r(111);

. tab leader_no

  No leader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         97       11.55       11.55
          1 |        743       88.45      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab female_leader

   female is leader |
(=1); female is not |
        leader (=0) |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  Female is  leader |        201       89.73       89.73
Female is no leader |         23       10.27      100.00
--------------------+-----------------------------------
              Total |        224      100.00

. tab female_leader leader_male

                    | leader is
                    | male (=1);
                    | leader is
   female is leader |   female
(=1); female is not |    (=0)
        leader (=0) | Leader is |     Total
--------------------+-----------+----------
Female is no leader |        23 |        23 
--------------------+-----------+----------
              Total |        23 |        23 

. tab leader_male

  leader is male |
 (=1); leader is |
     female (=0) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Leader is female |         23       23.71       23.71
  Leader is male |         74       76.29      100.00
-----------------+-----------------------------------
           Total |         97      100.00

. tab leader_fem

leader is female |
 (=1); leader is |
       male (=0) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  Leader is male |         74       76.29       76.29
Leader is female |         23       23.71      100.00
-----------------+-----------------------------------
           Total |         97      100.00

. tab leader_fem, nola

  leader is |
     female |
      (=1); |
  leader is |
  male (=0) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         74       76.29       76.29
          1 |         23       23.71      100.00
------------+-----------------------------------
      Total |         97      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. lab def party 1 "Male" 2 "Female" 3 "Villagers", replace

. lab val participant_type party
variable participant_type not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. gen participant_type = 3 if leader_type==1
(97 missing values generated)

. replace participant_type = 1 if leader_fem==0
(74 real changes made)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. 
. lab def party 1 "Male" 2 "Female" 3 "Villagers", replace

. lab val participant_type party

. 
. 
end of do-file

. tab participant_type

participant |
      _type |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |         74        8.81        8.81
     Female |         23        2.74       11.55
  Villagers |        743       88.45      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab no_leader_fem_vill

     Sum of |
    females |
that are no |
 leaders in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        140       16.67       16.67
          1 |         70        8.33       25.00
          2 |        112       13.33       38.33
          3 |        154       18.33       56.67
          4 |         98       11.67       68.33
          5 |        140       16.67       85.00
          6 |         56        6.67       91.67
          7 |         28        3.33       95.00
          9 |         28        3.33       98.33
         13 |         14        1.67      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        560       66.67       66.67
          1 |        238       28.33       95.00
          2 |         42        5.00      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab leader_state

  Leader in |
   state or |
  political |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        800       95.24       95.24
          1 |         40        4.76      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab leader_CR

  Leader in |
     common |
  resources |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        793       94.40       94.40
          1 |         47        5.60      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab vill_elected_leader_sum

     sum of |
    leaders |
    present |
during game |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        140       16.67       16.67
          1 |        392       46.67       63.33
          2 |        140       16.67       80.00
          3 |         84       10.00       90.00
          4 |         28        3.33       93.33
          5 |         28        3.33       96.67
          6 |         14        1.67       98.33
          7 |         14        1.67      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab  leader_present_vill

 leader was |
    present |
during game |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        140       16.67       16.67
          1 |        700       83.33      100.00
------------+-----------------------------------
      Total |        840      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. foreach x of varlist leader_state leader_CR leader_SHG leader_culture {
  2.         replace `x'=. if leader_type==1
  3. }
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)

. global leader_types leader_state leader_CR leader_SHG leader_culture

. 
end of do-file

. tab leader_state

  Leader in |
   state or |
  political |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       58.76       58.76
          1 |         40       41.24      100.00
------------+-----------------------------------
      Total |         97      100.00

. sum leader_state leader_CR leader_SHG leader_culture

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
leader_state |         97    .4123711    .4948185          0          1
   leader_CR |         97    .4845361     .502357          0          1
  leader_SHG |         97    .0721649    .2601051          0          1
leader_cul~e |         97    .0309278    .1740216          0          1

. tab leader_no

  No leader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         97       11.55       11.55
          1 |        743       88.45      100.00
------------+-----------------------------------
      Total |        840      100.00

. tab1 leader_state leader_CR leader_SHG leader_culture

-> tabulation of leader_state  

  Leader in |
   state or |
  political |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       58.76       58.76
          1 |         40       41.24      100.00
------------+-----------------------------------
      Total |         97      100.00

-> tabulation of leader_CR  

  Leader in |
     common |
  resources |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50       51.55       51.55
          1 |         47       48.45      100.00
------------+-----------------------------------
      Total |         97      100.00

-> tabulation of leader_SHG  

  Leader in |
  self help |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         90       92.78       92.78
          1 |          7        7.22      100.00
------------+-----------------------------------
      Total |         97      100.00

-> tabulation of leader_culture  

  Leader in |
  social or |
   cultural |
     groups |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       96.91       96.91
          1 |          3        3.09      100.00
------------+-----------------------------------
      Total |         97      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. global socio_economic age literacy edu_primary edu_secondary edu_university total_help  cont_lab cont_money dam_contribution

. 
. foreach x of varlist leader_state leader_CR leader_SHG leader_culture {
  2.         replace `x'=. if leader_type==1
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. global leader_types leader_state leader_CR leader_SHG leader_culture

. 
. iebaltab $socio_economic $leader_types , grpvar(participant_type)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_differences.xlsx") re
> place
variable dam_contribution not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. tab leader_
leader_ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1
(7,560 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. tab leader_type

           leader_type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
             no leader |        743       88.45       88.45
          state leader |         40        4.76       93.21
             CR leader |         47        5.60       98.81
            SHG leader |          7        0.83       99.64
Social  culture leader |          3        0.36      100.00
-----------------------+-----------------------------------
                 Total |        840      100.00

. 
. gen participant_type = 3 if leader_type==1
(97 missing values generated)

. replace participant_type = 1 if leader_fem==0
(74 real changes made)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. 
. lab def party 1 "Male" 2 "Female" 3 "Villagers", replace

. lab val participant_type party

. 
. tab leader_
leader_ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. global types leader_state leader_CR leader_SHG leader_culture

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. iebaltab $socio_economic $types , grpvar(participant_type)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_differences.xlsx") replace

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) below carefully before using the values generated for this table.

        Difference-in-Means Tests: The variance in both groups listed below is zero for the variable indicated and a difference-in-means test between the two groups is therefore
        not valid. Tests are reported as N/A in the table.

        +--------------------------------------------------------------+
        |   Test    |   Group    |    Balance Variable                 |
        |-----------+------------+-------------------------------------|
        | t-test    | (1)-(3)    |  leader_SHG                         |
        | t-test    | (2)-(3)    |  leader_culture                     |
        +--------------------------------------------------------------+

        Joint Significance Tests: F-tests are not possible to perform or unreliable. See below for details:

        In the following tests, F-tests are not valid as the variation in, and the covariation between, the balance variables is too close to zero in the joint test. This could
        be due to many reasons, but is usually due to a balance variable with high correlation with group dummy. Tests are reported as N/A in the table.

        +------------+
        |   Test     |
        |------------|
        |  (1)-(3)   |
        |  (2)-(3)   |
        +------------+

    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) above carefully before using the values generated for this table.
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_differences.xlsx

. 
end of do-file

. tab leader_state

  Leader in |
   state or |
  political |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        800       95.24       95.24
          1 |         40        4.76      100.00
------------+-----------------------------------
      Total |        840      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1
(7,560 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. tab leader_type

           leader_type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
             no leader |        743       88.45       88.45
          state leader |         40        4.76       93.21
             CR leader |         47        5.60       98.81
            SHG leader |          7        0.83       99.64
Social  culture leader |          3        0.36      100.00
-----------------------+-----------------------------------
                 Total |        840      100.00

. 
. gen participant_type = 3 if leader_type==1
(97 missing values generated)

. replace participant_type = 1 if leader_fem==0
(74 real changes made)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. 
. lab def party 1 "Male" 2 "Female" 3 "Villagers", replace

. lab val participant_type party

. 
. tab leader_
leader_ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. */
. *--------------------------------------------------
. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1
(7,560 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. tab leader_type

           leader_type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
             no leader |        743       88.45       88.45
          state leader |         40        4.76       93.21
             CR leader |         47        5.60       98.81
            SHG leader |          7        0.83       99.64
Social  culture leader |          3        0.36      100.00
-----------------------+-----------------------------------
                 Total |        840      100.00

. 
. gen participant_type = 3 if leader_type==1
(97 missing values generated)

. replace participant_type = 1 if leader_fem==0
(74 real changes made)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. 
. lab def party 1 "Male" 2 "Female" 3 "Villagers", replace

. lab val participant_type party

. 
. 
. global socio_economic age literacy edu_primary edu_secondary edu_university total_help  cont_lab cont_money dam_contribution

. 
. foreach x of varlist leader_state leader_CR leader_SHG leader_culture {
  2.         replace `x'=. if leader_type==1
  3. }
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)
(743 real changes made, 743 to missing)

. global types leader_state leader_CR leader_SHG leader_culture

. 
. iebaltab $socio_economic $types , grpvar(participant_type)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_differences.xlsx") replace
no observations
r(2000);

end of do-file

r(2000);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. iebaltab $types , grpvar(leader_fem)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_differences.xlsx") replace
    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_differences.xlsx

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. iebaltab $socio_economic , grpvar(participant_type)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_differences.xlsx") replace
    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_differences.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. betterbarci leader_type if leader_type > 1, over(fem_leader)
command betterbarci is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. catplot leader_type if leader_type > 1, over(fem_leader) vertical
variable fem_leader not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. catplot leader_type if leader_type > 1, over(leader_fem) vertical percent

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. catplot leader_type if leader_type > 1, over(leader_fem) vertical percent(leader_fem) asyvars stack

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. catplot leader_type if leader_type > 1, over(leader_fem) vertical percent(leader_fem) asyvars 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. label define leadertype   1 "no leader" 2 "Political office" 3 "CBNRM" 4 "Self-help group" 5 "Cultural group" 
label leadertype already defined
r(110);

end of do-file

r(110);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. 
. catplot leader_type if leader_type > 1, over(leader_fem) vertical percent(leader_fem) asyvars 

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. label define leadertype   1 "no leader" 2 "Political office" 3 "CBNRM" 4 "Self-help group" 5 "Cultural group",replace 

. label values leader_type leadertype

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. mylabels 0(10)50, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 10 "10%" 20 "20%" 30 "30%" 40 "40%" 50 "50%"

. catplot leader_type, over(leader_fem) asyvars  vertical recast(bar) yla(`pctlabel', nogrid) percent(leader_fem) bargap(10) blabel(bar, size(6pt) format(%9.0f) pos(center)  gap(0.
> 1))  b1title("", size(6pt)) legend(ring(1) pos(6) rows(3) size(6pt)) xsize(3.465) ysize(2)

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph not found)
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph could not be opened
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. foreach x of varlist leader_state leader_CR leader_SHG leader_culture {
  2.         replace `x'=. if leader_type==1
  3.         ttest `x', by(leader_fem)
  4. }
(0 real changes made)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      74    .4189189     .057746    .4967499    .3038313    .5340065
Leader i |      23    .3913043     .104051    .4990109    .1755159    .6070928
---------+--------------------------------------------------------------------
combined |      97    .4123711    .0502412    .4948185    .3126431    .5120991
---------+--------------------------------------------------------------------
    diff |            .0276146    .1187141               -.2080627    .2632918
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   0.2326
Ho: diff = 0                                     degrees of freedom =       95

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5917         Pr(|T| > |t|) = 0.8166          Pr(T > t) = 0.4083
(0 real changes made)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      74    .5405405    .0583279    .5017555    .4242932    .6567879
Leader i |      23    .3043478    .0981002     .470472    .1009005    .5077952
---------+--------------------------------------------------------------------
combined |      97    .4845361    .0510066     .502357    .3832887    .5857834
---------+--------------------------------------------------------------------
    diff |            .2361927    .1180964                .0017418    .4706437
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   2.0000
Ho: diff = 0                                     degrees of freedom =       95

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9758         Pr(|T| > |t|) = 0.0484          Pr(T > t) = 0.0242
(0 real changes made)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      74           0           0           0           0           0
Leader i |      23    .3043478    .0981002     .470472    .1009005    .5077952
---------+--------------------------------------------------------------------
combined |      97    .0721649    .0264097    .2601051    .0197422    .1245877
---------+--------------------------------------------------------------------
    diff |           -.3043478    .0540492               -.4116491   -.1970466
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =  -5.6309
Ho: diff = 0                                     degrees of freedom =       95

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000
(0 real changes made)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      74    .0405405    .0230832    .1985695   -.0054643    .0865454
Leader i |      23           0           0           0           0           0
---------+--------------------------------------------------------------------
combined |      97    .0309278    .0176692    .1740216   -.0041453    .0660009
---------+--------------------------------------------------------------------
    diff |            .0405405    .0415545               -.0419556    .1230367
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   0.9756
Ho: diff = 0                                     degrees of freedom =       95

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8341         Pr(|T| > |t|) = 0.3317          Pr(T > t) = 0.1659

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. mylabels 0(10)50, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 10 "10%" 20 "20%" 30 "30%" 40 "40%" 50 "50%"

. catplot leader_type, over(leader_fem) asyvars  vertical recast(bar) yla(`pctlabel', nogrid) percent(leader_fem) bargap(10) blabel(bar, size(6pt) format(%9.0f) pos(center)  gap(0.
> 1))  b1title("", size(6pt)) legend(ring(1) pos(6) rows(3) size(6pt)) xsize(3.465) ysize(2)

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph not found)
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph could not be opened
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. mylabels 0(10)60, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 10 "10%" 20 "20%" 30 "30%" 40 "40%" 50 "50%" 60 "60%"

. catplot leader_type, over(leader_fem) asyvars  vertical recast(bar) yla(`pctlabel', nogrid) percent(leader_fem) bargap(10) blabel(bar, size(6pt) format(%9.0f) pos(center)  gap(0.
> 1))  b1title("", size(6pt)) legend(ring(1) pos(6) rows(3) size(6pt)) xsize(3.465) ysize(2)

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph not found)
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph could not be opened
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. mylabels 0(10)60, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 10 "10%" 20 "20%" 30 "30%" 40 "40%" 50 "50%" 60 "60%"

. catplot leader_type, over(leader_fem) asyvars  vertical recast(bar) yla(`pctlabel', nogrid) percent(leader_fem) bargap(10) blabel(bar, size(6pt) format(%9.0f) pos(center)  gap(0.
> 1))  b1title("", size(6pt)) legend(ring(1) pos(6) rows(1) size(6pt)) xsize(3.465) ysize(2)

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph not found)
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph could not be opened
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph not found)
file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph could not be opened
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STD3140_000000.tmp"

. *--------------------------------------------------
. * Set global Working Directory
. *--------------------------------------------------
. * Define this global macro to point where the replication folder is saved locally that includes this run.do script
. global working_ANALYSIS "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis"

. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. * Initialize log and record system parameters
. clear

. set more off

. cap mkdir "$working_ANALYSIS/scripts/logs"

. cap log close
