-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2025.05.09-11.06.46.log.txt
  log type:  text
 opened on:   9 May 2025, 11:06:46

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  9 May 2025 11:06:46

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;
> lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace-desktop-r4995g6;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50
> " reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

.         1) Analysis Main Manuscript
1 is not a valid command name
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. ** REVISIONS
. *difference between FES and non-FES villages in outcome variables
. 
. ttest survey_maint_12m_BS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .4848485    .0883478    .5075192      .30489     .664807
NGO acti |      51    .5490196      .07037    .5025426    .4076772     .690362
---------+--------------------------------------------------------------------
combined |      84    .5238095    .0548199    .5024324     .414775     .632844
---------+--------------------------------------------------------------------
    diff |           -.0641711    .1127069               -.2883811    .1600388
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5694
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2853         Pr(|T| > |t|) = 0.5707          Pr(T > t) = 0.7147

. ttest survey_maint_2017_, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .6060606    .0863769    .4961977    .4301166    .7820046
NGO acti |      51    .6666667    .0666667    .4760952    .5327627    .8005706
---------+--------------------------------------------------------------------
combined |      84    .6428571    .0525944    .4820353    .5382491    .7474652
---------+--------------------------------------------------------------------
    diff |           -.0606061     .108138                -.275727    .1545149
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5605
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2883         Pr(|T| > |t|) = 0.5767          Pr(T > t) = 0.7117

. 
. ttest survey_maint_rule_BS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .1818182    .0681818    .3916747    .0429364       .3207
NGO acti |      51    .1372549    .0486654    .3475404    .0395076    .2350022
---------+--------------------------------------------------------------------
combined |      84    .1547619    .0396993    .3638498    .0758017    .2337222
---------+--------------------------------------------------------------------
    diff |            .0445633    .0816327               -.1178302    .2069567
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =   0.5459
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7067         Pr(|T| > |t|) = 0.5866          Pr(T > t) = 0.2933

. ttest survey_maint_rule_FS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .2727273    .0787296     .452267    .1123604    .4330942
NGO acti |      51    .3333333    .0666667    .4760952    .1994294    .4672373
---------+--------------------------------------------------------------------
combined |      84    .3095238    .0507437    .4650739    .2085966     .410451
---------+--------------------------------------------------------------------
    diff |           -.0606061    .1043181                -.268128    .1469159
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5810
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2814         Pr(|T| > |t|) = 0.5629          Pr(T > t) = 0.7186

. 
. 
. 
. * discussions within community
. gen game_discussed_formally = 0 if survey_share_exp_comm_meet_FS==0 & survey_share_exp_vc_meet_FS==0
(157 missing values generated)

. replace game_discussed_formally = 1 if survey_share_exp_vc_meet_FS==1 | survey_share_exp_comm_meet_FS==1
(24 real changes made)

. tab game_discussed_formally

game_discus |
sed_formall |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       56.36       56.36
          1 |         24       43.64      100.00
------------+-----------------------------------
      Total |         55      100.00

. ttest game_discussed_formally, by(female_leader_present_BS)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      35    .4285714    .0848698    .5020964    .2560953    .6010476
       1 |      20         .45    .1141329    .5104178    .2111171    .6888829
---------+--------------------------------------------------------------------
combined |      55    .4363636    .0674881    .5005048    .3010582     .571669
---------+--------------------------------------------------------------------
    diff |           -.0214286    .1415812               -.3054046    .2625474
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1514
Ho: diff = 0                                     degrees of freedom =       53

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4401         Pr(|T| > |t|) = 0.8803          Pr(T > t) = 0.5599

. * the game was dicussed formally in community and/or village council meetings in 24 out of the 55 intervention villages (46%), but not signific
> antly more often when female leaders were present
. 
. 
end of do-file

. tab game_share_leader_SHG_vill

   Share of |
 leaders in |
  self help |
   group in |
    village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         49       87.50       87.50
   .0714286 |          7       12.50      100.00
------------+-----------------------------------
      Total |         56      100.00

. sum game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate game_sum_leader_no game_sum_leader_state

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_sum_l~R |         56    .7678571    1.414099          0          6
game_sum_l~G |         56        .125    .3337119          0          1
game_~estate |         56    .0535714    .2272078          0          1
game_sum_l~o |         56    12.41071    1.510891          7         14
game_~_state |         56    .6428571    .9030971          0          3

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_present_vill

 Leader was |
    present |
during game |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       16.07       16.07
          1 |         47       83.93      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_leader_fem_vill

     Sum of |
     female |
    leaders |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         17       30.36       94.64
          2 |          3        5.36      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. gen female_leader = 0 if game_leader_fem_vill == 0
(152 missing values generated)

. replace female_leader = 1 if game_leader_fem_vill>0
(152 real changes made)

. 
end of do-file

. tab female_leader

female_lead |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       19.15       19.15
          1 |        152       80.85      100.00
------------+-----------------------------------
      Total |        188      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. replace female_leader = 1 if game_leader_fem_vill== 1 | game_leader_fem_vill== 2
(0 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. ** REVISIONS
. *difference between FES and non-FES villages in outcome variables
. 
. ttest survey_maint_12m_BS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .4848485    .0883478    .5075192      .30489     .664807
NGO acti |      51    .5490196      .07037    .5025426    .4076772     .690362
---------+--------------------------------------------------------------------
combined |      84    .5238095    .0548199    .5024324     .414775     .632844
---------+--------------------------------------------------------------------
    diff |           -.0641711    .1127069               -.2883811    .1600388
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5694
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2853         Pr(|T| > |t|) = 0.5707          Pr(T > t) = 0.7147

. ttest survey_maint_2017_, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .6060606    .0863769    .4961977    .4301166    .7820046
NGO acti |      51    .6666667    .0666667    .4760952    .5327627    .8005706
---------+--------------------------------------------------------------------
combined |      84    .6428571    .0525944    .4820353    .5382491    .7474652
---------+--------------------------------------------------------------------
    diff |           -.0606061     .108138                -.275727    .1545149
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5605
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2883         Pr(|T| > |t|) = 0.5767          Pr(T > t) = 0.7117

. 
. ttest survey_maint_rule_BS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .1818182    .0681818    .3916747    .0429364       .3207
NGO acti |      51    .1372549    .0486654    .3475404    .0395076    .2350022
---------+--------------------------------------------------------------------
combined |      84    .1547619    .0396993    .3638498    .0758017    .2337222
---------+--------------------------------------------------------------------
    diff |            .0445633    .0816327               -.1178302    .2069567
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =   0.5459
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7067         Pr(|T| > |t|) = 0.5866          Pr(T > t) = 0.2933

. ttest survey_maint_rule_FS, by(FES_site)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 NGO not |      33    .2727273    .0787296     .452267    .1123604    .4330942
NGO acti |      51    .3333333    .0666667    .4760952    .1994294    .4672373
---------+--------------------------------------------------------------------
combined |      84    .3095238    .0507437    .4650739    .2085966     .410451
---------+--------------------------------------------------------------------
    diff |           -.0606061    .1043181                -.268128    .1469159
------------------------------------------------------------------------------
    diff = mean(NGO not) - mean(NGO acti)                         t =  -0.5810
Ho: diff = 0                                     degrees of freedom =       82

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2814         Pr(|T| > |t|) = 0.5629          Pr(T > t) = 0.7186

. 
. 
. 
. * discussions within community
. gen game_discussed_formally = 0 if survey_share_exp_comm_meet_FS==0 & survey_share_exp_vc_meet_FS==0
(157 missing values generated)

. replace game_discussed_formally = 1 if survey_share_exp_vc_meet_FS==1 | survey_share_exp_comm_meet_FS==1
(24 real changes made)

. tab game_discussed_formally

game_discus |
sed_formall |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       56.36       56.36
          1 |         24       43.64      100.00
------------+-----------------------------------
      Total |         55      100.00

. ttest game_discussed_formally, by(female_leader_present_BS)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      35    .4285714    .0848698    .5020964    .2560953    .6010476
       1 |      20         .45    .1141329    .5104178    .2111171    .6888829
---------+--------------------------------------------------------------------
combined |      55    .4363636    .0674881    .5005048    .3010582     .571669
---------+--------------------------------------------------------------------
    diff |           -.0214286    .1415812               -.3054046    .2625474
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1514
Ho: diff = 0                                     degrees of freedom =       53

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4401         Pr(|T| > |t|) = 0.8803          Pr(T > t) = 0.5599

. * the game was dicussed formally in community and/or village council meetings in 24 out of the 55 intervention villages (46%), but not signific
> antly more often when female leaders were present
. 
. ttest survey_share_exp_comm_meet_FS, by(female_leader_present_BS)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      35    .3142857    .0796149    .4710082    .1524887    .4760827
       1 |      20          .4    .1123903    .5026247    .1647644    .6352356
---------+--------------------------------------------------------------------
combined |      55    .3454545    .0647096     .479899    .2157197    .4751894
---------+--------------------------------------------------------------------
    diff |           -.0857143    .1352702                -.357032    .1856034
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.6337
Ho: diff = 0                                     degrees of freedom =       53

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2645         Pr(|T| > |t|) = 0.5290          Pr(T > t) = 0.7355

. 
. 
. *type of leaders by gender
. gen female_leader = 0 if game_leader_fem_vill == 0
(152 missing values generated)

. replace female_leader = 1 if game_leader_fem_vill== 1 | game_leader_fem_vill== 2
(20 real changes made)

. iebaltab game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate  game_sum_leader_state
option grpvar() required
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. iebaltab game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate  game_sum_leader_state
option grpvar() required
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. iebaltab game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate  game_sum_leader_state, grpvar(female_leader) rowvarlabels  format
> (%8.2f) savexlsx( "$working_ANALYSIS/results/tables/\leader_types.xlsx") replace
option savexlsx() not allowed
r(198);

end of do-file

r(198);

. tab female_leader

female_lead |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       64.29       64.29
          1 |         20       35.71      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. iebaltab game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate  game_sum_leader_state, grpvar(female_leader) rowvarlabels  format
> (%8.2f) save("$working_ANALYSIS/results/tables/leader_types.xlsx") replace
    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_types.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *--------------------------------------------------
. 
. * Types of leaders present
. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1 
(7,560 observations deleted)

. drop if excluded_villages==1
(56 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. *leader composition in games
. *dummy for male leader presence
. gen male_leader_present = 0 if leader_male_vill==0
(490 missing values generated)

. replace male_leader_present = 1 if leader_male_vill>0
(490 real changes made)

. 
. 
. *dummy for female leader presence
. gen female_leader_present= 0 if leader_fem_vill==0
(280 missing values generated)

. replace female_leader_present = 1 if leader_fem_vill>0
(280 real changes made)

. 
. tab female_leader_present male_leader_present

female_lea |
der_presen |  male_leader_present
         t |         0          1 |     Total
-----------+----------------------+----------
         0 |       126        378 |       504 
         1 |       168        112 |       280 
-----------+----------------------+----------
     Total |       294        490 |       784 

. 
. *composition of leader presence
. gen leader_present = 0 if male_leader_present==0 & female_leader_present==0
(658 missing values generated)

. replace leader_present = 1 if male_leader_present == 1 & female_leader_present==0
(378 real changes made)

. replace leader_present = 2 if male_leader_present == 1 & female_leader_present==1
(112 real changes made)

. replace leader_present = 3 if male_leader_present == 0 & female_leader_present==1
(168 real changes made)

. 
. lab def leader_lab 0 "None" 1 "Only Male" 2 "Both" 3 "Only Female", replace

. lab val leader_present leader_lab

. tab leader_present, gen(leader_comp)

leader_pres |
        ent |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |        126       16.07       16.07
  Only Male |        378       48.21       64.29
       Both |        112       14.29       78.57
Only Female |        168       21.43      100.00
------------+-----------------------------------
      Total |        784      100.00

. 
. gen participant_type = 1 if leader_fem==0
(718 missing values generated)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. replace participant_type = 3 if leader_type==1 & sex==1
(503 real changes made)

. replace participant_type = 4 if leader_type==1 & sex==0
(192 real changes made)

. lab def party 1 "Male leader" 2 "Female leader" 3 "Male villager" 4 "Female villager", replace

. lab val participant_type party

. 
. gen party_type = sex*leader_no

. 
. global socio_economic age literacy edu_primary edu_secondary  total_help  dam_contribution

. 
. foreach x of varlist leader_state leader_CR leader_SHG leader_culture {
  2.         replace `x'=. if leader_type==1
  3.         ttest `x', by(leader_fem)
  4. }
(695 real changes made, 695 to missing)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      66    .4090909    .0609837    .4954337    .2872981    .5308837
Leader i |      23    .3913043     .104051    .4990109    .1755159    .6070928
---------+--------------------------------------------------------------------
combined |      89    .4044944    .0523188    .4935746    .3005217     .508467
---------+--------------------------------------------------------------------
    diff |            .0177866    .1201819               -.2210879    .2566611
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   0.1480
Ho: diff = 0                                     degrees of freedom =       87

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5587         Pr(|T| > |t|) = 0.8827          Pr(T > t) = 0.4413
(695 real changes made, 695 to missing)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      66    .5454545    .0617606    .5017452    .4221102    .6687989
Leader i |      23    .3043478    .0981002     .470472    .1009005    .5077952
---------+--------------------------------------------------------------------
combined |      89    .4831461    .0532699    .5025471    .3772834    .5890088
---------+--------------------------------------------------------------------
    diff |            .2411067    .1196209                .0033471    .4788663
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   2.0156
Ho: diff = 0                                     degrees of freedom =       87

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9765         Pr(|T| > |t|) = 0.0469          Pr(T > t) = 0.0235
(695 real changes made, 695 to missing)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      66           0           0           0           0           0
Leader i |      23    .3043478    .0981002     .470472    .1009005    .5077952
---------+--------------------------------------------------------------------
combined |      89    .0786517    .0286962    .2707195     .021624    .1356794
---------+--------------------------------------------------------------------
    diff |           -.3043478    .0572855               -.4182089   -.1904867
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =  -5.3128
Ho: diff = 0                                     degrees of freedom =       87

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000
(695 real changes made, 695 to missing)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Leader i |      66    .0454545    .0258363    .2098951   -.0061441    .0970532
Leader i |      23           0           0           0           0           0
---------+--------------------------------------------------------------------
combined |      89    .0337079    .0192388    .1814987   -.0045253     .071941
---------+--------------------------------------------------------------------
    diff |            .0454545    .0439297               -.0418605    .1327696
------------------------------------------------------------------------------
    diff = mean(Leader i) - mean(Leader i)                        t =   1.0347
Ho: diff = 0                                     degrees of freedom =       87

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8482         Pr(|T| > |t|) = 0.3037          Pr(T > t) = 0.1518

. global types leader_state leader_CR leader_SHG leader_culture

. 
. *significant differences between female leaders in only female villages compared to male & female villages
. preserve

. drop if leader_no==1
(695 observations deleted)

. keep if leader_fem==1
(66 observations deleted)

. iebaltab $socio_economic, grpvar(leader_present)  format(%9.2f) stdev ftest fmissok tblnonote save("$working_ANALYSIS/results/tables/leader_vil
> lager_differences.xlsx") replace
    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_villager_differences.xlsx

. restore

. tab leader_fem

leader is female |
 (=1); leader is |
       male (=0) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  Leader is male |         66       74.16       74.16
Leader is female |         23       25.84      100.00
-----------------+-----------------------------------
           Total |         89      100.00

. lab def lead_fem 0 "Male leader (n=66)" 1 "Female leader (n=23)", replace

. lab val leader_fem lead_fem

. 
. egen total_leaders = rowtotal(sum_leader_state sum_leader_CR sum_leader_SHG sum_leader_culturestate)

. 
. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot leader_fem, over(leader_type) percent(leader_type) asyvars  recast(bar) yla(`pctlabel', nogrid)  bargap(10) blabel(bar, size(6pt) forma
> t(%9.0f) pos(center)  gap(0.1))  b1title("", size(6pt)) legend(ring(1) pos(6) rows(1) size(6pt)) xsize(3.465) ysize(2)

. gr save  "$working_ANALYSIS/results/intermediate/leader_positions.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/leader_positions.gph saved)

. gr export  "$working_ANALYSIS/results/figures/leader_positions.png", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/figures/leader_positions.png written in PNG format)

. 
. bys leader_fem: tab leader_SHG

-------------------------------------------------------------------------------------------------------------------------------------------------
-> leader_fem = Male leader (n=66)

  Leader in |
  self help |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         66      100.00      100.00
------------+-----------------------------------
      Total |         66      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------
-> leader_fem = Female leader (n=23)

  Leader in |
  self help |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         16       69.57       69.57
          1 |          7       30.43      100.00
------------+-----------------------------------
      Total |         23      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------
-> leader_fem = .
no observations


. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. tab leader_fem

    leader is female |
(=1); leader is male |
                (=0) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  Male leader (n=66) |         66       74.16       74.16
Female leader (n=23) |         23       25.84      100.00
---------------------+-----------------------------------
               Total |         89      100.00

. lab def lead_fem 0 "Male leader (n=66)" 1 "Female leader (n=23)", replace

. lab val leader_fem lead_fem

. 
. iebaltab game_sum_leader_CR game_sum_leader_SHG game_sum_leader_culturestate  game_sum_leader_state, grpvar(lead_fem) rowvarlabels  format(%8.2
> f) save("$working_ANALYSIS/results/tables/leader_types.xlsx") replace
variable game_sum_leader_CR not found
r(111);

end of do-file

r(111);

. tab leader_type

     leader_type |      Freq.     Percent        Cum.
-----------------+-----------------------------------
       no leader |        695       88.65       88.65
Political office |         36        4.59       93.24
           CBNRM |         43        5.48       98.72
 Self-help group |          7        0.89       99.62
  Cultural group |          3        0.38      100.00
-----------------+-----------------------------------
           Total |        784      100.00

. tab leader_fem

    leader is female |
(=1); leader is male |
                (=0) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  Male leader (n=66) |         66       74.16       74.16
Female leader (n=23) |         23       25.84      100.00
---------------------+-----------------------------------
               Total |         89      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. tab leader_type, gen(leader_)

     leader_type |      Freq.     Percent        Cum.
-----------------+-----------------------------------
       no leader |        695       88.65       88.65
Political office |         36        4.59       93.24
           CBNRM |         43        5.48       98.72
 Self-help group |          7        0.89       99.62
  Cultural group |          3        0.38      100.00
-----------------+-----------------------------------
           Total |        784      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. iebaltab leader_2 leader_3 leader_4 leader_5, grpvar(lead_fem) rowvarlabels  format(%8.2f) save("$working_ANALYSIS/results/tables/leader_types.
> xlsx") replace
variable lead_fem not found
(error in option grpvar())
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. iebaltab leader_2 leader_3 leader_4 leader_5, grpvar(leader_fem) rowvarlabels  format(%8.2f) save("$working_ANALYSIS/results/tables/leader_type
> s.xlsx") replace
    Balance table saved to: D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/tables/leader_types.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. 
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. ** REVISIONS
. *difference between FES and non-FES villages in outcome variables
. 
end of do-file

. tab treatment

          0 |
 treatment_ |      Freq.     Percent        Cum.
------------+-----------------------------------
    Control |         28       33.33       33.33
      Games |         56       66.67      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *drop variables with all missings and generate some additional variabels and labels
. global village No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

. 
. 
. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 7 obs not used

Iteration 0:   log pseudolikelihood = -50.042525  
Iteration 1:   log pseudolikelihood = -41.018186  
Iteration 2:   log pseudolikelihood = -40.956348  
Iteration 3:   log pseudolikelihood = -40.956292  
Iteration 4:   log pseudolikelihood = -40.956292  

Probit regression                               Number of obs     =         75
                                                Wald chi2(9)      =      16.24
                                                Prob > chi2       =     0.0620
Log pseudolikelihood = -40.956292               Pseudo R2         =     0.1816

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6877685   .3399401     2.02   0.043     .0214982    1.354039
         survey_maint_12m_BS |   .6746932    .345198     1.95   0.051    -.0018825    1.351269
survey_dam_for_irrigation_FS |    .319278   .3618387     0.88   0.378    -.3899127    1.028469
                       No_HH |   -.000091    .002074    -0.04   0.965    -.0041559    .0039739
                    FES_site |   .3530123   .3727644     0.95   0.344    -.3775925    1.083617
            n_SHG_before2017 |    .015694   .0336871     0.47   0.641    -.0503315    .0817195
             d_public_school |   .5920728   .5419464     1.09   0.275    -.4701227    1.654268
            d_private_school |          0  (omitted)
                    Shar_Lit |   .0173284   .0213324     0.81   0.417    -.0244824    .0591392
                   Shar_SCST |  -.0169742   .0095137    -1.78   0.074    -.0356208    .0016723
                       _cons |  -1.060834   1.698931    -0.62   0.532    -4.390678     2.26901
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         75
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school d_private_school
               Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2136518   .0981976     2.18   0.030      .021188    .4061156
         survey_maint_12m_BS |     .20959   .0976522     2.15   0.032     .0181952    .4009849
survey_dam_for_irrigation_FS |   .0991821   .1097142     0.90   0.366    -.1158537     .314218
                       No_HH |  -.0000283   .0006443    -0.04   0.965     -.001291    .0012345
                    FES_site |   .1096615   .1127125     0.97   0.331    -.1112509    .3305739
            n_SHG_before2017 |   .0048753   .0105033     0.46   0.643    -.0157108    .0254613
             d_public_school |   .1839244   .1627984     1.13   0.259    -.1351545    .5030033
            d_private_school |          0  (omitted)
                    Shar_Lit |    .005383   .0065218     0.83   0.409    -.0073995    .0181654
                   Shar_SCST |   -.005273   .0028245    -1.87   0.062    -.0108088    .0002629
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .18157023

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. global village No_HH FES_site n_SHG_before2017 d_public_school  Shar_Lit Shar_SCST

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood =  -46.56098  
Iteration 2:   log pseudolikelihood = -46.537399  
Iteration 3:   log pseudolikelihood = -46.537397  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      12.76
                                                Prob > chi2       =     0.1737
Log pseudolikelihood = -46.537397               Pseudo R2         =     0.1265

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5272445   .3264733     1.61   0.106    -.1126313     1.16712
         survey_maint_12m_BS |   .5780886   .3251426     1.78   0.075    -.0591792    1.215356
survey_dam_for_irrigation_FS |   .1477561   .3354461     0.44   0.660    -.5097061    .8052183
                       No_HH |  -.0013189   .0019598    -0.67   0.501      -.00516    .0025222
                    FES_site |   .1208437   .3423789     0.35   0.724    -.5502066     .791894
            n_SHG_before2017 |   .0203073   .0321895     0.63   0.528    -.0427829    .0833975
             d_public_school |   .4002343   .5195511     0.77   0.441    -.6180671    1.418536
                    Shar_Lit |   .0194498   .0202091     0.96   0.336    -.0201593    .0590588
                   Shar_SCST |  -.0155727   .0090978    -1.71   0.087     -.033404    .0022586
                       _cons |  -.4291232   1.557743    -0.28   0.783    -3.482243    2.623997
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1699349   .1005282     1.69   0.091    -.0270968    .3669666
         survey_maint_12m_BS |   .1863223   .0976211     1.91   0.056    -.0050115    .3776562
survey_dam_for_irrigation_FS |   .0476229   .1073593     0.44   0.657    -.1627975    .2580433
                       No_HH |  -.0004251   .0006269    -0.68   0.498    -.0016537    .0008036
                    FES_site |   .0389488   .1101535     0.35   0.724    -.1769481    .2548458
            n_SHG_before2017 |   .0065452    .010402     0.63   0.529    -.0138424    .0269328
             d_public_school |   .1289986   .1650504     0.78   0.434    -.1944943    .4524914
                    Shar_Lit |   .0062688   .0064193     0.98   0.329    -.0063128    .0188504
                   Shar_SCST |  -.0050192   .0028111    -1.79   0.074    -.0105289    .0004905
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .1264508

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. 
. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood =  -46.56098  
Iteration 2:   log pseudolikelihood = -46.537399  
Iteration 3:   log pseudolikelihood = -46.537397  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      12.76
                                                Prob > chi2       =     0.1737
Log pseudolikelihood = -46.537397               Pseudo R2         =     0.1265

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5272445   .3264733     1.61   0.106    -.1126313     1.16712
         survey_maint_12m_BS |   .5780886   .3251426     1.78   0.075    -.0591792    1.215356
survey_dam_for_irrigation_FS |   .1477561   .3354461     0.44   0.660    -.5097061    .8052183
                       No_HH |  -.0013189   .0019598    -0.67   0.501      -.00516    .0025222
                    FES_site |   .1208437   .3423789     0.35   0.724    -.5502066     .791894
            n_SHG_before2017 |   .0203073   .0321895     0.63   0.528    -.0427829    .0833975
             d_public_school |   .4002343   .5195511     0.77   0.441    -.6180671    1.418536
                    Shar_Lit |   .0194498   .0202091     0.96   0.336    -.0201593    .0590588
                   Shar_SCST |  -.0155727   .0090978    -1.71   0.087     -.033404    .0022586
                       _cons |  -.4291232   1.557743    -0.28   0.783    -3.482243    2.623997
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1699349   .1005282     1.69   0.091    -.0270968    .3669666
         survey_maint_12m_BS |   .1863223   .0976211     1.91   0.056    -.0050115    .3776562
survey_dam_for_irrigation_FS |   .0476229   .1073593     0.44   0.657    -.1627975    .2580433
                       No_HH |  -.0004251   .0006269    -0.68   0.498    -.0016537    .0008036
                    FES_site |   .0389488   .1101535     0.35   0.724    -.1769481    .2548458
            n_SHG_before2017 |   .0065452    .010402     0.63   0.529    -.0138424    .0269328
             d_public_school |   .1289986   .1650504     0.78   0.434    -.1944943    .4524914
                    Shar_Lit |   .0062688   .0064193     0.98   0.329    -.0063128    .0188504
                   Shar_SCST |  -.0050192   .0028111    -1.79   0.074    -.0105289    .0004905
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .1264508

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *drop variables with all missings and generate some additional variabels and labels
. global village No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.839882  
Iteration 2:   log pseudolikelihood = -46.818642  
Iteration 3:   log pseudolikelihood =  -46.81864  

Probit regression                               Number of obs     =         82
                                                Wald chi2(8)      =      12.36
                                                Prob > chi2       =     0.1360
Log pseudolikelihood =  -46.81864               Pseudo R2         =     0.1212

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .572921   .3228286     1.77   0.076    -.0598114    1.205653
         survey_maint_12m_BS |   .5540125   .3216997     1.72   0.085    -.0765073    1.184532
survey_dam_for_irrigation_FS |   .1087983   .3237355     0.34   0.737    -.5257116    .7433082
                       No_HH |  -.0011825   .0019438    -0.61   0.543    -.0049924    .0026273
                    FES_site |   .1088048   .3417698     0.32   0.750    -.5610516    .7786613
            n_SHG_before2017 |   .0228855    .031735     0.72   0.471     -.039314     .085085
                    Shar_Lit |   .0183363    .019851     0.92   0.356    -.0205709    .0572436
                   Shar_SCST |   -.016222   .0090253    -1.80   0.072    -.0339113    .0014673
                       _cons |   .0023246   1.430048     0.00   0.999    -2.800517    2.805167
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1855633    .098542     1.88   0.060    -.0075754    .3787021
         survey_maint_12m_BS |   .1794391   .0977013     1.84   0.066    -.0120519    .3709301
survey_dam_for_irrigation_FS |   .0352387   .1045284     0.34   0.736    -.1696332    .2401105
                       No_HH |   -.000383   .0006256    -0.61   0.540    -.0016092    .0008432
                    FES_site |   .0352408   .1105214     0.32   0.750    -.1813772    .2518587
            n_SHG_before2017 |   .0074124   .0102784     0.72   0.471     -.012733    .0275578
                    Shar_Lit |    .005939   .0063485     0.94   0.350    -.0065038    .0183818
                   Shar_SCST |  -.0052541   .0027877    -1.88   0.059    -.0107178    .0002096
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12117162

. 
end of do-file

. tab d_private_school

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          7        8.33      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. global village No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST d_private_school

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 7 obs not used

Iteration 0:   log pseudolikelihood = -50.042525  
Iteration 1:   log pseudolikelihood = -41.480246  
Iteration 2:   log pseudolikelihood = -41.428013  
Iteration 3:   log pseudolikelihood =  -41.42797  
Iteration 4:   log pseudolikelihood =  -41.42797  

Probit regression                               Number of obs     =         75
                                                Wald chi2(8)      =      16.25
                                                Prob > chi2       =     0.0389
Log pseudolikelihood =  -41.42797               Pseudo R2         =     0.1721

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .7363042   .3416859     2.15   0.031     .0666121    1.405996
         survey_maint_12m_BS |   .6259265    .335838     1.86   0.062    -.0323038    1.284157
survey_dam_for_irrigation_FS |   .2555316   .3454427     0.74   0.459    -.4215237    .9325868
                       No_HH |  -.0000656   .0020953    -0.03   0.975    -.0041724    .0040411
                    FES_site |   .3178778   .3687505     0.86   0.389    -.4048599    1.040615
            n_SHG_before2017 |   .0209497   .0330853     0.63   0.527    -.0438963    .0857957
                    Shar_Lit |   .0167548    .020875     0.80   0.422    -.0241594    .0576689
                   Shar_SCST |  -.0186638   .0095386    -1.96   0.050     -.037359    .0000315
            d_private_school |          0  (omitted)
                       _cons |  -.3624704   1.532821    -0.24   0.813    -3.366743    2.641803
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         75
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST
               d_private_school

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2305573   .0981704     2.35   0.019     .0381467    .4229678
         survey_maint_12m_BS |   .1959949   .0973912     2.01   0.044     .0051117    .3868782
survey_dam_for_irrigation_FS |    .080014   .1068002     0.75   0.454    -.1293105    .2893386
                       No_HH |  -.0000205   .0006561    -0.03   0.975    -.0013065    .0012654
                    FES_site |   .0995364   .1129837     0.88   0.378    -.1219077    .3209804
            n_SHG_before2017 |   .0065599   .0103618     0.63   0.527    -.0137488    .0268686
                    Shar_Lit |   .0052464   .0064399     0.81   0.415    -.0073756    .0178683
                   Shar_SCST |  -.0058441   .0028173    -2.07   0.038     -.011366   -.0003223
            d_private_school |          0  (omitted)
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .17214469

. 
end of do-file

. tab n_school_gov

n_school_go |
          v |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       11.90       11.90
          1 |         37       44.05       55.95
          2 |         26       30.95       86.90
          3 |          5        5.95       92.86
          4 |          5        5.95       98.81
          7 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab n_school_priv

n_school_pr |
         iv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       91.67       91.67
          1 |          6        7.14       98.81
          2 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab number_schools

number_scho |
        ols |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       10.71       10.71
          1 |         34       40.48       51.19
          2 |         28       33.33       84.52
          3 |          6        7.14       91.67
          4 |          6        7.14       98.81
          7 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. global village No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST number_schools

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.780928  
Iteration 2:   log pseudolikelihood =  -46.75224  
Iteration 3:   log pseudolikelihood = -46.752236  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      11.97
                                                Prob > chi2       =     0.2148
Log pseudolikelihood = -46.752236               Pseudo R2         =     0.1224

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5873615    .331056     1.77   0.076    -.0614963    1.236219
         survey_maint_12m_BS |   .5445317   .3245226     1.68   0.093    -.0915208    1.180584
survey_dam_for_irrigation_FS |   .0880974   .3274844     0.27   0.788    -.5537603    .7299551
                       No_HH |  -.0008569   .0021651    -0.40   0.692    -.0051005    .0033867
                    FES_site |   .0985351   .3389607     0.29   0.771    -.5658156    .7628859
            n_SHG_before2017 |   .0245937   .0323869     0.76   0.448    -.0388834    .0880707
                    Shar_Lit |   .0177971   .0199197     0.89   0.372    -.0212447     .056839
                   Shar_SCST |  -.0164994    .009096    -1.81   0.070    -.0343273    .0013285
              number_schools |  -.0606852   .1848593    -0.33   0.743    -.4230028    .3016323
                       _cons |     .10116   1.444932     0.07   0.944    -2.730854    2.933174
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1899676   .1008461     1.88   0.060    -.0076871    .3876223
         survey_maint_12m_BS |   .1761154   .0987346     1.78   0.074    -.0174009    .3696317
survey_dam_for_irrigation_FS |   .0284929   .1056531     0.27   0.787    -.1785833    .2355692
                       No_HH |  -.0002771   .0006978    -0.40   0.691    -.0016448    .0010905
                    FES_site |   .0318688   .1094363     0.29   0.771    -.1826224      .24636
            n_SHG_before2017 |   .0079542   .0104639     0.76   0.447    -.0125547    .0284631
                    Shar_Lit |    .005756   .0063642     0.90   0.366    -.0067176    .0182297
                   Shar_SCST |  -.0053363   .0028024    -1.90   0.057     -.010829    .0001563
              number_schools |  -.0196271   .0597598    -0.33   0.743    -.1367542    .0974999
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12241808

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. global village No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.839882  
Iteration 2:   log pseudolikelihood = -46.818642  
Iteration 3:   log pseudolikelihood =  -46.81864  

Probit regression                               Number of obs     =         82
                                                Wald chi2(8)      =      12.36
                                                Prob > chi2       =     0.1360
Log pseudolikelihood =  -46.81864               Pseudo R2         =     0.1212

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .572921   .3228286     1.77   0.076    -.0598114    1.205653
         survey_maint_12m_BS |   .5540125   .3216997     1.72   0.085    -.0765073    1.184532
survey_dam_for_irrigation_FS |   .1087983   .3237355     0.34   0.737    -.5257116    .7433082
                       No_HH |  -.0011825   .0019438    -0.61   0.543    -.0049924    .0026273
                    FES_site |   .1088048   .3417698     0.32   0.750    -.5610516    .7786613
            n_SHG_before2017 |   .0228855    .031735     0.72   0.471     -.039314     .085085
                    Shar_Lit |   .0183363    .019851     0.92   0.356    -.0205709    .0572436
                   Shar_SCST |   -.016222   .0090253    -1.80   0.072    -.0339113    .0014673
                       _cons |   .0023246   1.430048     0.00   0.999    -2.800517    2.805167
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1855633    .098542     1.88   0.060    -.0075754    .3787021
         survey_maint_12m_BS |   .1794391   .0977013     1.84   0.066    -.0120519    .3709301
survey_dam_for_irrigation_FS |   .0352387   .1045284     0.34   0.736    -.1696332    .2401105
                       No_HH |   -.000383   .0006256    -0.61   0.540    -.0016092    .0008432
                    FES_site |   .0352408   .1105214     0.32   0.750    -.1813772    .2518587
            n_SHG_before2017 |   .0074124   .0102784     0.72   0.471     -.012733    .0275578
                    Shar_Lit |    .005939   .0063485     0.94   0.350    -.0065038    .0183818
                   Shar_SCST |  -.0052541   .0027877    -1.88   0.059    -.0107178    .0002096
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12117162

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *drop variables with all missings and generate some additional variabels and labels
. global village No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST number_schools

. 
. 
. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.780928  
Iteration 2:   log pseudolikelihood =  -46.75224  
Iteration 3:   log pseudolikelihood = -46.752236  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      11.97
                                                Prob > chi2       =     0.2148
Log pseudolikelihood = -46.752236               Pseudo R2         =     0.1224

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5873615    .331056     1.77   0.076    -.0614963    1.236219
         survey_maint_12m_BS |   .5445317   .3245226     1.68   0.093    -.0915208    1.180584
survey_dam_for_irrigation_FS |   .0880974   .3274844     0.27   0.788    -.5537603    .7299551
                       No_HH |  -.0008569   .0021651    -0.40   0.692    -.0051005    .0033867
                    FES_site |   .0985351   .3389607     0.29   0.771    -.5658156    .7628859
            n_SHG_before2017 |   .0245937   .0323869     0.76   0.448    -.0388834    .0880707
                    Shar_Lit |   .0177971   .0199197     0.89   0.372    -.0212447     .056839
                   Shar_SCST |  -.0164994    .009096    -1.81   0.070    -.0343273    .0013285
              number_schools |  -.0606852   .1848593    -0.33   0.743    -.4230028    .3016323
                       _cons |     .10116   1.444932     0.07   0.944    -2.730854    2.933174
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1899676   .1008461     1.88   0.060    -.0076871    .3876223
         survey_maint_12m_BS |   .1761154   .0987346     1.78   0.074    -.0174009    .3696317
survey_dam_for_irrigation_FS |   .0284929   .1056531     0.27   0.787    -.1785833    .2355692
                       No_HH |  -.0002771   .0006978    -0.40   0.691    -.0016448    .0010905
                    FES_site |   .0318688   .1094363     0.29   0.771    -.1826224      .24636
            n_SHG_before2017 |   .0079542   .0104639     0.76   0.447    -.0125547    .0284631
                    Shar_Lit |    .005756   .0063642     0.90   0.366    -.0067176    .0182297
                   Shar_SCST |  -.0053363   .0028024    -1.90   0.057     -.010829    .0001563
              number_schools |  -.0196271   .0597598    -0.33   0.743    -.1367542    .0974999
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12241808

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.780928  
Iteration 2:   log pseudolikelihood =  -46.75224  
Iteration 3:   log pseudolikelihood = -46.752236  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      11.97
                                                Prob > chi2       =     0.2148
Log pseudolikelihood = -46.752236               Pseudo R2         =     0.1224

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5873615    .331056     1.77   0.076    -.0614963    1.236219
         survey_maint_12m_BS |   .5445317   .3245226     1.68   0.093    -.0915208    1.180584
survey_dam_for_irrigation_FS |   .0880974   .3274844     0.27   0.788    -.5537603    .7299551
                       No_HH |  -.0008569   .0021651    -0.40   0.692    -.0051005    .0033867
                    FES_site |   .0985351   .3389607     0.29   0.771    -.5658156    .7628859
            n_SHG_before2017 |   .0245937   .0323869     0.76   0.448    -.0388834    .0880707
                    Shar_Lit |   .0177971   .0199197     0.89   0.372    -.0212447     .056839
                   Shar_SCST |  -.0164994    .009096    -1.81   0.070    -.0343273    .0013285
              number_schools |  -.0606852   .1848593    -0.33   0.743    -.4230028    .3016323
                       _cons |     .10116   1.444932     0.07   0.944    -2.730854    2.933174
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1899676   .1008461     1.88   0.060    -.0076871    .3876223
         survey_maint_12m_BS |   .1761154   .0987346     1.78   0.074    -.0174009    .3696317
survey_dam_for_irrigation_FS |   .0284929   .1056531     0.27   0.787    -.1785833    .2355692
                       No_HH |  -.0002771   .0006978    -0.40   0.691    -.0016448    .0010905
                    FES_site |   .0318688   .1094363     0.29   0.771    -.1826224      .24636
            n_SHG_before2017 |   .0079542   .0104639     0.76   0.447    -.0125547    .0284631
                    Shar_Lit |    .005756   .0063642     0.90   0.366    -.0067176    .0182297
                   Shar_SCST |  -.0053363   .0028024    -1.90   0.057     -.010829    .0001563
              number_schools |  -.0196271   .0597598    -0.33   0.743    -.1367542    .0974999
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12241808

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. sum No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST number_schools

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       No_HH |         83    175.2651    123.4358         24        633
    FES_site |         84    .6071429    .4913188          0          1
n_SHG_b~2017 |         89    7.168539    6.619935          0         40
    Shar_Lit |         83    51.42858    8.370013   33.55556   73.15914
   Shar_SCST |         83     77.7139    19.35809   16.90491        100
-------------+---------------------------------------------------------
number_sch~s |         84    1.654762     1.17703          0          7

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *drop variables with all missings and generate some additional variabels and labels
. global controls No_HH FES_site n_SHG_before2017  Shar_Lit Shar_SCST number_schools

. 
. 
. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -46.780928  
Iteration 2:   log pseudolikelihood =  -46.75224  
Iteration 3:   log pseudolikelihood = -46.752236  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      11.97
                                                Prob > chi2       =     0.2148
Log pseudolikelihood = -46.752236               Pseudo R2         =     0.1224

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .5873615    .331056     1.77   0.076    -.0614963    1.236219
         survey_maint_12m_BS |   .5445317   .3245226     1.68   0.093    -.0915208    1.180584
survey_dam_for_irrigation_FS |   .0880974   .3274844     0.27   0.788    -.5537603    .7299551
                       No_HH |  -.0008569   .0021651    -0.40   0.692    -.0051005    .0033867
                    FES_site |   .0985351   .3389607     0.29   0.771    -.5658156    .7628859
            n_SHG_before2017 |   .0245937   .0323869     0.76   0.448    -.0388834    .0880707
                    Shar_Lit |   .0177971   .0199197     0.89   0.372    -.0212447     .056839
                   Shar_SCST |  -.0164994    .009096    -1.81   0.070    -.0343273    .0013285
              number_schools |  -.0606852   .1848593    -0.33   0.743    -.4230028    .3016323
                       _cons |     .10116   1.444932     0.07   0.944    -2.730854    2.933174
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1899676   .1008461     1.88   0.060    -.0076871    .3876223
         survey_maint_12m_BS |   .1761154   .0987346     1.78   0.074    -.0174009    .3696317
survey_dam_for_irrigation_FS |   .0284929   .1056531     0.27   0.787    -.1785833    .2355692
                       No_HH |  -.0002771   .0006978    -0.40   0.691    -.0016448    .0010905
                    FES_site |   .0318688   .1094363     0.29   0.771    -.1826224      .24636
            n_SHG_before2017 |   .0079542   .0104639     0.76   0.447    -.0125547    .0284631
                    Shar_Lit |    .005756   .0063642     0.90   0.366    -.0067176    .0182297
                   Shar_SCST |  -.0053363   .0028024    -1.90   0.057     -.010829    .0001563
              number_schools |  -.0196271   .0597598    -0.33   0.743    -.1367542    .0974999
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .12241808

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.295031  
Iteration 2:   log pseudolikelihood = -51.294734  
Iteration 3:   log pseudolikelihood = -51.294734  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       1.29
                                                Prob > chi2       =     0.5238
Log pseudolikelihood = -51.294734               Pseudo R2         =     0.0130

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .086564   .3099871     0.28   0.780    -.5209995    .6941274
 survey_maint_12m_BS |   .3219676   .2907744     1.11   0.268    -.2479398     .891875
               _cons |  -.7304377   .3046826    -2.40   0.017    -1.327605   -.1332708
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .0301018   .1075954     0.28   0.780    -.1807813    .2409848
survey_maint_12m_BS |    .111961   .0989799     1.13   0.258     -.082036    .3059581
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01303908

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -42.249759  
Iteration 2:   log pseudolikelihood = -41.865974  
Iteration 3:   log pseudolikelihood = -41.865156  
Iteration 4:   log pseudolikelihood = -41.865156  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      17.85
                                                Prob > chi2       =     0.0370
Log pseudolikelihood = -41.865156               Pseudo R2         =     0.1698

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1955863   .3386702     0.58   0.564     -.468195    .8593676
         survey_maint_12m_BS |   .2622513   .3315442     0.79   0.429    -.3875634    .9120659
survey_dam_for_irrigation_FS |  -.7449107   .3562398    -2.09   0.037    -1.443128   -.0466935
                       No_HH |  -.0060682   .0026935    -2.25   0.024    -.0113474    -.000789
                    FES_site |   .1149356   .3493577     0.33   0.742    -.5697929     .799664
            n_SHG_before2017 |   .1238835   .0363169     3.41   0.001     .0527038    .1950633
                    Shar_Lit |   .0102047   .0205348     0.50   0.619    -.0300427    .0504521
                   Shar_SCST |  -.0112693   .0098323    -1.15   0.252    -.0305403    .0080016
              number_schools |  -.3131532   .1821389    -1.72   0.086    -.6701388    .0438324
                       _cons |   .3444309   1.465457     0.24   0.814    -2.527813    3.216674
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0561092   .0964907     0.58   0.561    -.1330091    .2452275
         survey_maint_12m_BS |   .0752338   .0942541     0.80   0.425    -.1095008    .2599685
survey_dam_for_irrigation_FS |  -.2136977   .0937078    -2.28   0.023    -.3973616   -.0300338
                       No_HH |  -.0017408   .0007373    -2.36   0.018     -.003186   -.0002957
                    FES_site |   .0329724   .0999105     0.33   0.741    -.1628487    .2287934
            n_SHG_before2017 |   .0355393    .009334     3.81   0.000      .017245    .0538336
                    Shar_Lit |   .0029275   .0058524     0.50   0.617     -.008543     .014398
                   Shar_SCST |  -.0032329    .002767    -1.17   0.243    -.0086562    .0021903
              number_schools |  -.0898364   .0514546    -1.75   0.081    -.1906856    .0110128
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .16975662

. 
. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/intervention_effect.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph saved)

. gr export "$working_ANALYSIS\results\figures\intervention_effect.png", replace width(3800)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png written in PNG format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. global controls No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

. 
. 
. probit survey_maint_2017_ treatment_BS survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -45.625234  
Iteration 2:   log pseudolikelihood =  -45.53759  
Iteration 3:   log pseudolikelihood = -45.537414  
Iteration 4:   log pseudolikelihood = -45.537414  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      13.27
                                                Prob > chi2       =     0.1507
Log pseudolikelihood = -45.537414               Pseudo R2         =     0.1452

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .681092   .3446175     1.98   0.048     .0056542     1.35653
         survey_maint_12m_BS |   .5359933   .3278513     1.63   0.102    -.1065835     1.17857
survey_dam_for_irrigation_FS |   .0266462   .3381333     0.08   0.937    -.6360829    .6893752
                       No_HH |   .0006988   .0022275     0.31   0.754     -.003667    .0050647
                    FES_site |   .0964965   .3396557     0.28   0.776    -.5692165    .7622095
            n_SHG_before2017 |   .0319183   .0332489     0.96   0.337    -.0332483    .0970848
                    Shar_Lit |   .0157667   .0201537     0.78   0.434    -.0237339    .0552673
                   Shar_SCST |  -.0184847   .0093247    -1.98   0.047    -.0367609   -.0002086
                n_school_gov |  -.3069403    .191121    -1.61   0.108    -.6815306      .06765
                       _cons |   .4224325   1.456272     0.29   0.772    -2.431808    3.276673
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2142335   .1004292     2.13   0.033      .017396    .4110711
         survey_maint_12m_BS |   .1685936   .0973938     1.73   0.083    -.0222947    .3594819
survey_dam_for_irrigation_FS |   .0083814   .1063148     0.08   0.937    -.1999918    .2167546
                       No_HH |   .0002198   .0007008     0.31   0.754    -.0011538    .0015934
                    FES_site |   .0303524   .1065121     0.28   0.776    -.1784074    .2391123
            n_SHG_before2017 |   .0100397   .0103718     0.97   0.333    -.0102887    .0303682
                    Shar_Lit |   .0049593   .0062845     0.79   0.430    -.0073581    .0172768
                   Shar_SCST |  -.0058143   .0027736    -2.10   0.036    -.0112504   -.0003782
                n_school_gov |  -.0965463   .0582482    -1.66   0.097    -.2107106     .017618
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14522138

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.295031  
Iteration 2:   log pseudolikelihood = -51.294734  
Iteration 3:   log pseudolikelihood = -51.294734  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       1.29
                                                Prob > chi2       =     0.5238
Log pseudolikelihood = -51.294734               Pseudo R2         =     0.0130

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .086564   .3099871     0.28   0.780    -.5209995    .6941274
 survey_maint_12m_BS |   .3219676   .2907744     1.11   0.268    -.2479398     .891875
               _cons |  -.7304377   .3046826    -2.40   0.017    -1.327605   -.1332708
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .0301018   .1075954     0.28   0.780    -.1807813    .2409848
survey_maint_12m_BS |    .111961   .0989799     1.13   0.258     -.082036    .3059581
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01303908

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -42.442673  
Iteration 2:   log pseudolikelihood =  -42.08842  
Iteration 3:   log pseudolikelihood = -42.087074  
Iteration 4:   log pseudolikelihood = -42.087074  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      17.91
                                                Prob > chi2       =     0.0363
Log pseudolikelihood = -42.087074               Pseudo R2         =     0.1654

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2084062   .3416438     0.61   0.542    -.4612034    .8780157
         survey_maint_12m_BS |   .2710409   .3298895     0.82   0.411    -.3755306    .9176124
survey_dam_for_irrigation_FS |  -.7210307   .3557094    -2.03   0.043    -1.418208   -.0238531
                       No_HH |  -.0057385   .0027675    -2.07   0.038    -.0111627   -.0003143
                    FES_site |    .152018   .3466601     0.44   0.661    -.5274232    .8314592
            n_SHG_before2017 |   .1217182   .0357161     3.41   0.001      .051716    .1917205
                    Shar_Lit |   .0095572    .020836     0.46   0.646    -.0312806     .050395
                   Shar_SCST |   -.011359   .0098189    -1.16   0.247    -.0306037    .0078857
                n_school_gov |  -.3091573   .2068141    -1.49   0.135    -.7145056    .0961909
                       _cons |   .2702073   1.474873     0.18   0.855     -2.62049    3.160905
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0601638    .097775     0.62   0.538    -.1314716    .2517993
         survey_maint_12m_BS |   .0782456    .094261     0.83   0.406    -.1065026    .2629938
survey_dam_for_irrigation_FS |  -.2081511   .0943097    -2.21   0.027    -.3929947   -.0233075
                       No_HH |  -.0016566   .0007741    -2.14   0.032    -.0031738   -.0001394
                    FES_site |   .0438854   .0996249     0.44   0.660    -.1513758    .2391466
            n_SHG_before2017 |   .0351383   .0092571     3.80   0.000     .0169947    .0532819
                    Shar_Lit |    .002759    .005983     0.46   0.645    -.0089674    .0144855
                   Shar_SCST |  -.0032792   .0027783    -1.18   0.238    -.0087246    .0021663
                n_school_gov |  -.0892492   .0586529    -1.52   0.128    -.2042067    .0257083
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .16535568

. 
. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/intervention_effect.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph saved)

. gr export "$working_ANALYSIS\results\figures\intervention_effect.png", replace width(3800)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png written in PNG format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -45.625234  
Iteration 2:   log pseudolikelihood =  -45.53759  
Iteration 3:   log pseudolikelihood = -45.537414  
Iteration 4:   log pseudolikelihood = -45.537414  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      13.27
                                                Prob > chi2       =     0.1507
Log pseudolikelihood = -45.537414               Pseudo R2         =     0.1452

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .681092   .3446175     1.98   0.048     .0056542     1.35653
         survey_maint_12m_BS |   .5359933   .3278513     1.63   0.102    -.1065835     1.17857
survey_dam_for_irrigation_FS |   .0266462   .3381333     0.08   0.937    -.6360829    .6893752
                       No_HH |   .0006988   .0022275     0.31   0.754     -.003667    .0050647
                    FES_site |   .0964965   .3396557     0.28   0.776    -.5692165    .7622095
            n_SHG_before2017 |   .0319183   .0332489     0.96   0.337    -.0332483    .0970848
                    Shar_Lit |   .0157667   .0201537     0.78   0.434    -.0237339    .0552673
                   Shar_SCST |  -.0184847   .0093247    -1.98   0.047    -.0367609   -.0002086
                n_school_gov |  -.3069403    .191121    -1.61   0.108    -.6815306      .06765
                       _cons |   .4224325   1.456272     0.29   0.772    -2.431808    3.276673
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2142335   .1004292     2.13   0.033      .017396    .4110711
         survey_maint_12m_BS |   .1685936   .0973938     1.73   0.083    -.0222947    .3594819
survey_dam_for_irrigation_FS |   .0083814   .1063148     0.08   0.937    -.1999918    .2167546
                       No_HH |   .0002198   .0007008     0.31   0.754    -.0011538    .0015934
                    FES_site |   .0303524   .1065121     0.28   0.776    -.1784074    .2391123
            n_SHG_before2017 |   .0100397   .0103718     0.97   0.333    -.0102887    .0303682
                    Shar_Lit |   .0049593   .0062845     0.79   0.430    -.0073581    .0172768
                   Shar_SCST |  -.0058143   .0027736    -2.10   0.036    -.0112504   -.0003782
                n_school_gov |  -.0965463   .0582482    -1.66   0.097    -.2107106     .017618
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14522138

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. *Table S7: SEM main result output
. sem ($village sequence-> leader_comp1_BS ) ($village  sequence-> leader_comp2_BS ) ($village  sequence-> leader_comp3_BS ) ($village  sequence-
> > leader_comp4_BS ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders $village  sequence -> share_female_percent3_BS , )  (leader_
> comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS survey_maint_rule_BS $village  survey_dam_for_irrigation_FS seq
> uence -> survey_maint_rule_FS, ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS  total_leaders share_female_percent3_BS survey_maint_12m_BS s
> urvey_maint_rule_FS $village  survey_dam_for_irrigation_FS sequence -> survey_maint_2017_FS , ), vce(robust) nocapslatent
(132 observations with missing values excluded)

Endogenous variables

Observed:  leader_comp1_BS leader_comp2_BS leader_comp3_BS leader_comp4_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST number_schools sequence total_leaders survey_maint_rule_BS
           survey_dam_for_irrigation_FS survey_maint_12m_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1652.6123  
Iteration 1:   log pseudolikelihood = -1652.6123  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1652.6123

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0004872   .0007248     0.67   0.501    -.0009334    .0019078
                      FES_site |  -.2183241   .1061111    -2.06   0.040    -.4262981     -.01035
              n_SHG_before2017 |  -.0344536   .0096678    -3.56   0.000     -.053402   -.0155051
                      Shar_Lit |   -.009762   .0044778    -2.18   0.029    -.0185384   -.0009856
                     Shar_SCST |  -.0021745   .0023914    -0.91   0.363    -.0068616    .0025127
                number_schools |   -.045558   .0421363    -1.08   0.280    -.1281436    .0370277
                      sequence |   .0102486   .0025893     3.96   0.000     .0051737    .0153236
                         _cons |   .9184379   .3674643     2.50   0.012     .1982211    1.638655
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   .0001986   .0009794     0.20   0.839     -.001721    .0021181
                      FES_site |   .2141548   .1465608     1.46   0.144     -.073099    .5014087
              n_SHG_before2017 |   .0176507   .0135782     1.30   0.194     -.008962    .0442635
                      Shar_Lit |    .001626   .0081776     0.20   0.842    -.0144017    .0176537
                     Shar_SCST |   .0035712   .0040313     0.89   0.376    -.0043299    .0114723
                number_schools |  -.0755348   .0766239    -0.99   0.324    -.2257149    .0746454
                      sequence |  -.0098992   .0039761    -2.49   0.013    -.0176921   -.0021062
                         _cons |   .2303755   .6527439     0.35   0.724    -1.048979     1.50973
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0009546   .0005498    -1.74   0.083    -.0020322    .0001231
                      FES_site |   .1042258   .0673763     1.55   0.122    -.0278293    .2362809
              n_SHG_before2017 |   .0126136   .0067679     1.86   0.062    -.0006512    .0258784
                      Shar_Lit |   -.000162   .0058493    -0.03   0.978    -.0116265    .0113025
                     Shar_SCST |  -.0056244   .0033953    -1.66   0.098     -.012279    .0010301
                number_schools |  -.0306696   .0409069    -0.75   0.453    -.1108456    .0495065
                      sequence |  -.0020192   .0033321    -0.61   0.545      -.00855    .0045117
                         _cons |   .7015791   .5141036     1.36   0.172    -.3060454    1.709204
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0002688   .0008488     0.32   0.751    -.0013947    .0019324
                      FES_site |  -.1000566   .1353017    -0.74   0.460    -.3652431    .1651299
              n_SHG_before2017 |   .0041893   .0130772     0.32   0.749    -.0214416    .0298201
                      Shar_Lit |    .008298   .0070481     1.18   0.239     -.005516    .0221121
                     Shar_SCST |   .0042277   .0027659     1.53   0.126    -.0011935    .0096489
                number_schools |   .1517623    .068503     2.22   0.027     .0174988    .2860258
                      sequence |   .0016697   .0030635     0.55   0.586    -.0043347    .0076741
                         _cons |  -.8503925   .5059728    -1.68   0.093    -1.842081    .1412959
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .6612397   .7063337     0.94   0.349    -.7231488    2.045628
               leader_comp3_BS |   .7415203   .8817184     0.84   0.400     -.986616    2.469657
               leader_comp4_BS |   2.075582   .8707542     2.38   0.017     .3689354    3.782229
                         No_HH |   .0010493   .0029308     0.36   0.720    -.0046951    .0067936
                      FES_site |   -.380379   .4698658    -0.81   0.418    -1.301299    .5405411
              n_SHG_before2017 |   -.075857   .0394389    -1.92   0.054    -.1531558    .0014418
                      Shar_Lit |    .031061   .0274626     1.13   0.258    -.0227647    .0848867
                     Shar_SCST |  -.0003065   .0164938    -0.02   0.985    -.0326337    .0320208
                number_schools |  -.1967211   .2264769    -0.87   0.385    -.6406077    .2471656
                      sequence |   .0383966   .0162556     2.36   0.018     .0065362     .070257
                 total_leaders |  -.3084417   .1782284    -1.73   0.084    -.6577629    .0408795
                         _cons |   .3361585   2.394686     0.14   0.888     -4.35734    5.029657
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0651206   .1808601     0.36   0.719    -.2893588    .4195999
               leader_comp3_BS |  -.1112427   .3227076    -0.34   0.730     -.743738    .5212526
               leader_comp4_BS |    .012014   .1724326     0.07   0.944    -.3259478    .3499757
      share_female_percent3_BS |    .131771   .0291067     4.53   0.000     .0747229    .1888192
                         No_HH |  -.0010659   .0007741    -1.38   0.169    -.0025832    .0004513
                      FES_site |   .2794618   .1050835     2.66   0.008      .073502    .4854216
              n_SHG_before2017 |   .0359447     .01138     3.16   0.002     .0136404     .058249
                      Shar_Lit |  -.0047224   .0066193    -0.71   0.476     -.017696    .0082512
                     Shar_SCST |  -.0024483   .0031645    -0.77   0.439    -.0086506    .0037541
                number_schools |  -.0899395    .062367    -1.44   0.149    -.2121765    .0322975
                      sequence |  -.0037007   .0051703    -0.72   0.474    -.0138343    .0064329
                 total_leaders |   .0344935   .0533231     0.65   0.518    -.0700178    .1390048
          survey_maint_rule_BS |  -.0448428   .1726004    -0.26   0.795    -.3831334    .2934478
  survey_dam_for_irrigation_FS |  -.2581741    .113503    -2.27   0.023    -.4806359   -.0357123
                         _cons |   .4751535    .492086     0.97   0.334    -.4893173    1.439624
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |  -.0426861    .165245    -0.26   0.796    -.3665604    .2811881
               leader_comp3_BS |   .3312939   .2297988     1.44   0.149    -.1191034    .7816913
               leader_comp4_BS |  -.1704424   .1713597    -0.99   0.320    -.5063011    .1654164
      share_female_percent3_BS |     .00885   .0316347     0.28   0.780    -.0531528    .0708529
          survey_maint_rule_FS |   .3021488   .1086733     2.78   0.005      .089153    .5151445
                         No_HH |   .0014847    .000759     1.96   0.050    -2.98e-06    .0029724
                      FES_site |   .0792695   .1258254     0.63   0.529    -.1673438    .3258828
              n_SHG_before2017 |  -.0049033   .0117969    -0.42   0.678    -.0280249    .0182182
                      Shar_Lit |   .0110046   .0069938     1.57   0.116     -.002703    .0247122
                     Shar_SCST |   .0004917   .0033472     0.15   0.883    -.0060688    .0070521
                number_schools |  -.1368253   .0628079    -2.18   0.029    -.2599266    -.013724
                      sequence |   .0082518    .004235     1.95   0.051    -.0000487    .0165522
                 total_leaders |  -.0368839    .051017    -0.72   0.470    -.1368754    .0631076
  survey_dam_for_irrigation_FS |   .3010853   .1258601     2.39   0.017     .0544041    .5477665
           survey_maint_12m_BS |  -.1206755   .1146773    -1.05   0.293    -.3454388    .1040878
                         _cons |  -.2735851   .5734339    -0.48   0.633    -1.397495    .8503248
-------------------------------+----------------------------------------------------------------
         var(e.leader_comp1_BS)|   .0827668   .0173252                      .0549134    .1247481
         var(e.leader_comp2_BS)|   .2054208   .0212924                      .1676544    .2516945
         var(e.leader_comp3_BS)|   .1044605   .0266544                      .0633516     .172245
         var(e.leader_comp4_BS)|   .1275059   .0214794                      .0916514     .177387
var(e.share_female_percent3_BS)|   1.773612   .4187919                      1.116528    2.817393
    var(e.survey_maint_rule_FS)|   .1367901   .0196525                      .1032199    .1812783
    var(e.survey_maint_2017_FS)|   .1249938   .0216994                      .0889439     .175655
------------------------------------------------------------------------------------------------

. 
. eststo SEM

. estat teffects


Direct effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0004872   .0007248     0.67   0.501    -.0009334    .0019078
                      FES_site |  -.2183241   .1061111    -2.06   0.040    -.4262981     -.01035
              n_SHG_before2017 |  -.0344536   .0096678    -3.56   0.000     -.053402   -.0155051
                      Shar_Lit |   -.009762   .0044778    -2.18   0.029    -.0185384   -.0009856
                     Shar_SCST |  -.0021745   .0023914    -0.91   0.363    -.0068616    .0025127
                number_schools |   -.045558   .0421363    -1.08   0.280    -.1281436    .0370277
                      sequence |   .0102486   .0025893     3.96   0.000     .0051737    .0153236
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   .0001986   .0009794     0.20   0.839     -.001721    .0021181
                      FES_site |   .2141548   .1465608     1.46   0.144     -.073099    .5014087
              n_SHG_before2017 |   .0176507   .0135782     1.30   0.194     -.008962    .0442635
                      Shar_Lit |    .001626   .0081776     0.20   0.842    -.0144017    .0176537
                     Shar_SCST |   .0035712   .0040313     0.89   0.376    -.0043299    .0114723
                number_schools |  -.0755348   .0766239    -0.99   0.324    -.2257149    .0746454
                      sequence |  -.0098992   .0039761    -2.49   0.013    -.0176921   -.0021062
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0009546   .0005498    -1.74   0.083    -.0020322    .0001231
                      FES_site |   .1042258   .0673763     1.55   0.122    -.0278293    .2362809
              n_SHG_before2017 |   .0126136   .0067679     1.86   0.062    -.0006512    .0258784
                      Shar_Lit |   -.000162   .0058493    -0.03   0.978    -.0116265    .0113025
                     Shar_SCST |  -.0056244   .0033953    -1.66   0.098     -.012279    .0010301
                number_schools |  -.0306696   .0409069    -0.75   0.453    -.1108456    .0495065
                      sequence |  -.0020192   .0033321    -0.61   0.545      -.00855    .0045117
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0002688   .0008488     0.32   0.751    -.0013947    .0019324
                      FES_site |  -.1000566   .1353017    -0.74   0.460    -.3652431    .1651299
              n_SHG_before2017 |   .0041893   .0130772     0.32   0.749    -.0214416    .0298201
                      Shar_Lit |    .008298   .0070481     1.18   0.239     -.005516    .0221121
                     Shar_SCST |   .0042277   .0027659     1.53   0.126    -.0011935    .0096489
                number_schools |   .1517623    .068503     2.22   0.027     .0174988    .2860258
                      sequence |   .0016697   .0030635     0.55   0.586    -.0043347    .0076741
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .6612397   .7063337     0.94   0.349    -.7231488    2.045628
               leader_comp3_BS |   .7415203   .8817184     0.84   0.400     -.986616    2.469657
               leader_comp4_BS |   2.075582   .8707542     2.38   0.017     .3689354    3.782229
                         No_HH |   .0010493   .0029308     0.36   0.720    -.0046951    .0067936
                      FES_site |   -.380379   .4698658    -0.81   0.418    -1.301299    .5405411
              n_SHG_before2017 |   -.075857   .0394389    -1.92   0.054    -.1531558    .0014418
                      Shar_Lit |    .031061   .0274626     1.13   0.258    -.0227647    .0848867
                     Shar_SCST |  -.0003065   .0164938    -0.02   0.985    -.0326337    .0320208
                number_schools |  -.1967211   .2264769    -0.87   0.385    -.6406077    .2471656
                      sequence |   .0383966   .0162556     2.36   0.018     .0065362     .070257
                 total_leaders |  -.3084417   .1782284    -1.73   0.084    -.6577629    .0408795
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0651206   .1808601     0.36   0.719    -.2893588    .4195999
               leader_comp3_BS |  -.1112427   .3227076    -0.34   0.730     -.743738    .5212526
               leader_comp4_BS |    .012014   .1724326     0.07   0.944    -.3259478    .3499757
      share_female_percent3_BS |    .131771   .0291067     4.53   0.000     .0747229    .1888192
                         No_HH |  -.0010659   .0007741    -1.38   0.169    -.0025832    .0004513
                      FES_site |   .2794618   .1050835     2.66   0.008      .073502    .4854216
              n_SHG_before2017 |   .0359447     .01138     3.16   0.002     .0136404     .058249
                      Shar_Lit |  -.0047224   .0066193    -0.71   0.476     -.017696    .0082512
                     Shar_SCST |  -.0024483   .0031645    -0.77   0.439    -.0086506    .0037541
                number_schools |  -.0899395    .062367    -1.44   0.149    -.2121765    .0322975
                      sequence |  -.0037007   .0051703    -0.72   0.474    -.0138343    .0064329
                 total_leaders |   .0344935   .0533231     0.65   0.518    -.0700178    .1390048
          survey_maint_rule_BS |  -.0448428   .1726004    -0.26   0.795    -.3831334    .2934478
  survey_dam_for_irrigation_FS |  -.2581741    .113503    -2.27   0.023    -.4806359   -.0357123
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |  -.0426861    .165245    -0.26   0.796    -.3665604    .2811881
               leader_comp3_BS |   .3312939   .2297988     1.44   0.149    -.1191034    .7816913
               leader_comp4_BS |  -.1704424   .1713597    -0.99   0.320    -.5063011    .1654164
      share_female_percent3_BS |     .00885   .0316347     0.28   0.780    -.0531528    .0708529
          survey_maint_rule_FS |   .3021488   .1086733     2.78   0.005      .089153    .5151445
                         No_HH |   .0014847    .000759     1.96   0.050    -2.98e-06    .0029724
                      FES_site |   .0792695   .1258254     0.63   0.529    -.1673438    .3258828
              n_SHG_before2017 |  -.0049033   .0117969    -0.42   0.678    -.0280249    .0182182
                      Shar_Lit |   .0110046   .0069938     1.57   0.116     -.002703    .0247122
                     Shar_SCST |   .0004917   .0033472     0.15   0.883    -.0060688    .0070521
                number_schools |  -.1368253   .0628079    -2.18   0.029    -.2599266    -.013724
                      sequence |   .0082518    .004235     1.95   0.051    -.0000487    .0165522
                 total_leaders |  -.0368839    .051017    -0.72   0.470    -.1368754    .0631076
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |   .3010853   .1258601     2.39   0.017     .0544041    .5477665
           survey_maint_12m_BS |  -.1206755   .1146773    -1.05   0.293    -.3454388    .1040878
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                number_schools |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                number_schools |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                number_schools |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                number_schools |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |          0  (no path)
               leader_comp3_BS |          0  (no path)
               leader_comp4_BS |          0  (no path)
                         No_HH |  -.0000186   .0016146    -0.01   0.991    -.0031831    .0031459
                      FES_site |   .0112175   .2836248     0.04   0.968    -.5446769     .567112
              n_SHG_before2017 |   .0297198   .0380012     0.78   0.434    -.0447612    .1042007
                      Shar_Lit |   .0181783   .0158126     1.15   0.250    -.0128139    .0491705
                     Shar_SCST |   .0069657   .0058429     1.19   0.233    -.0044862    .0184177
                number_schools |   .2423065   .1230299     1.97   0.049     .0011723    .4834407
                      sequence |  -.0045773   .0079441    -0.58   0.564    -.0201476    .0109929
                 total_leaders |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0871322   .0913699     0.95   0.340    -.0919494    .2662139
               leader_comp3_BS |   .0977109   .1115072     0.88   0.381    -.1208391    .3162609
               leader_comp4_BS |   .2735016   .1239008     2.21   0.027     .0306605    .5163427
      share_female_percent3_BS |          0  (no path)
                         No_HH |   .0002582   .0005509     0.47   0.639    -.0008216    .0013379
                      FES_site |  -.0474953   .0862605    -0.55   0.582    -.2165629    .1215722
              n_SHG_before2017 |   -.006283   .0101418    -0.62   0.536    -.0261606    .0135947
                      Shar_Lit |   .0067119   .0047066     1.43   0.154    -.0025129    .0159368
                     Shar_SCST |   .0017865   .0029748     0.60   0.548     -.004044     .007617
                number_schools |    .006323   .0348515     0.18   0.856    -.0619848    .0746307
                      sequence |   .0040564   .0034116     1.19   0.234    -.0026301     .010743
                 total_leaders |  -.0406437   .0243529    -1.67   0.095    -.0883745    .0070871
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |    .051855   .0660865     0.78   0.433    -.0776721    .1813821
               leader_comp3_BS |   .0024739   .1085153     0.02   0.982    -.2102122    .2151599
               leader_comp4_BS |   .1046371   .0739171     1.42   0.157    -.0402376    .2495119
      share_female_percent3_BS |   .0398145   .0166422     2.39   0.017     .0071962    .0724327
          survey_maint_rule_FS |          0  (no path)
                         No_HH |  -.0006055   .0003904    -1.55   0.121    -.0013706    .0001597
                      FES_site |   .1092631   .0847723     1.29   0.197    -.0568875    .2754137
              n_SHG_before2017 |   .0112653   .0092144     1.22   0.221    -.0067946    .0293252
                      Shar_Lit |  -.0005005   .0033621    -0.15   0.882    -.0070902    .0060891
                     Shar_SCST |  -.0028774   .0021894    -1.31   0.189    -.0071685    .0014138
                number_schools |  -.0576643   .0319447    -1.81   0.071    -.1202747    .0049462
                      sequence |  -.0001242   .0032515    -0.04   0.970     -.006497    .0062487
                 total_leaders |   -.004588   .0215446    -0.21   0.831    -.0468146    .0376386
          survey_maint_rule_BS |  -.0135492   .0522006    -0.26   0.795    -.1158605    .0887621
  survey_dam_for_irrigation_FS |   -.078007   .0440232    -1.77   0.076    -.1642908    .0082769
           survey_maint_12m_BS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0004872   .0007248     0.67   0.501    -.0009334    .0019078
                      FES_site |  -.2183241   .1061111    -2.06   0.040    -.4262981     -.01035
              n_SHG_before2017 |  -.0344536   .0096678    -3.56   0.000     -.053402   -.0155051
                      Shar_Lit |   -.009762   .0044778    -2.18   0.029    -.0185384   -.0009856
                     Shar_SCST |  -.0021745   .0023914    -0.91   0.363    -.0068616    .0025127
                number_schools |   -.045558   .0421363    -1.08   0.280    -.1281436    .0370277
                      sequence |   .0102486   .0025893     3.96   0.000     .0051737    .0153236
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   .0001986   .0009794     0.20   0.839     -.001721    .0021181
                      FES_site |   .2141548   .1465608     1.46   0.144     -.073099    .5014087
              n_SHG_before2017 |   .0176507   .0135782     1.30   0.194     -.008962    .0442635
                      Shar_Lit |    .001626   .0081776     0.20   0.842    -.0144017    .0176537
                     Shar_SCST |   .0035712   .0040313     0.89   0.376    -.0043299    .0114723
                number_schools |  -.0755348   .0766239    -0.99   0.324    -.2257149    .0746454
                      sequence |  -.0098992   .0039761    -2.49   0.013    -.0176921   -.0021062
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0009546   .0005498    -1.74   0.083    -.0020322    .0001231
                      FES_site |   .1042258   .0673763     1.55   0.122    -.0278293    .2362809
              n_SHG_before2017 |   .0126136   .0067679     1.86   0.062    -.0006512    .0258784
                      Shar_Lit |   -.000162   .0058493    -0.03   0.978    -.0116265    .0113025
                     Shar_SCST |  -.0056244   .0033953    -1.66   0.098     -.012279    .0010301
                number_schools |  -.0306696   .0409069    -0.75   0.453    -.1108456    .0495065
                      sequence |  -.0020192   .0033321    -0.61   0.545      -.00855    .0045117
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0002688   .0008488     0.32   0.751    -.0013947    .0019324
                      FES_site |  -.1000566   .1353017    -0.74   0.460    -.3652431    .1651299
              n_SHG_before2017 |   .0041893   .0130772     0.32   0.749    -.0214416    .0298201
                      Shar_Lit |    .008298   .0070481     1.18   0.239     -.005516    .0221121
                     Shar_SCST |   .0042277   .0027659     1.53   0.126    -.0011935    .0096489
                number_schools |   .1517623    .068503     2.22   0.027     .0174988    .2860258
                      sequence |   .0016697   .0030635     0.55   0.586    -.0043347    .0076741
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .6612397   .7063337     0.94   0.349    -.7231488    2.045628
               leader_comp3_BS |   .7415203   .8817184     0.84   0.400     -.986616    2.469657
               leader_comp4_BS |   2.075582   .8707542     2.38   0.017     .3689354    3.782229
                         No_HH |   .0010307   .0035994     0.29   0.775     -.006024    .0080853
                      FES_site |  -.3691614   .4701534    -0.79   0.432    -1.290645    .5523223
              n_SHG_before2017 |  -.0461373   .0484494    -0.95   0.341    -.1410963    .0488218
                      Shar_Lit |   .0492393   .0354182     1.39   0.164    -.0201791    .1186577
                     Shar_SCST |   .0066593    .016562     0.40   0.688    -.0258017    .0391202
                number_schools |   .0455854   .2227621     0.20   0.838    -.3910203    .4821912
                      sequence |   .0338192    .018481     1.83   0.067    -.0024028    .0700413
                 total_leaders |  -.3084417   .1782284    -1.73   0.084    -.6577629    .0408795
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1522528   .2085678     0.73   0.465    -.2565326    .5610382
               leader_comp3_BS |  -.0135318   .3508874    -0.04   0.969    -.7012584    .6741948
               leader_comp4_BS |   .2855156   .2010973     1.42   0.156     -.108628    .6796591
      share_female_percent3_BS |    .131771   .0291067     4.53   0.000     .0747229    .1888192
                         No_HH |  -.0008078   .0008106    -1.00   0.319    -.0023965     .000781
                      FES_site |   .2319664     .12497     1.86   0.063    -.0129703    .4769032
              n_SHG_before2017 |   .0296617   .0119612     2.48   0.013     .0062183    .0531052
                      Shar_Lit |   .0019895   .0090672     0.22   0.826    -.0157818    .0197608
                     Shar_SCST |  -.0006617   .0042185    -0.16   0.875    -.0089298    .0076064
                number_schools |  -.0836165   .0574656    -1.46   0.146     -.196247     .029014
                      sequence |   .0003558   .0056547     0.06   0.950    -.0107272    .0114388
                 total_leaders |  -.0061502   .0612347    -0.10   0.920     -.126168    .1138676
          survey_maint_rule_BS |  -.0448428   .1726004    -0.26   0.795    -.3831334    .2934478
  survey_dam_for_irrigation_FS |  -.2581741    .113503    -2.27   0.023    -.4806359   -.0357123
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0091688   .1920584     0.05   0.962    -.3672587    .3855964
               leader_comp3_BS |   .3337678   .2630465     1.27   0.204    -.1817938    .8493294
               leader_comp4_BS |  -.0658052   .1847047    -0.36   0.722    -.4278197    .2962093
      share_female_percent3_BS |   .0486645   .0279172     1.74   0.081    -.0060523    .1033812
          survey_maint_rule_FS |   .3021488   .1086733     2.78   0.005      .089153    .5151445
                         No_HH |   .0008792   .0007303     1.20   0.229    -.0005522    .0023106
                      FES_site |   .1885326   .1383085     1.36   0.173    -.0825471    .4596123
              n_SHG_before2017 |   .0063619    .011937     0.53   0.594    -.0170341     .029758
                      Shar_Lit |    .010504   .0072603     1.45   0.148     -.003726    .0247341
                     Shar_SCST |  -.0023857   .0039812    -0.60   0.549    -.0101886    .0054172
                number_schools |  -.1944896   .0592014    -3.29   0.001    -.3105221    -.078457
                      sequence |   .0081276    .004941     1.64   0.100    -.0015566    .0178118
                 total_leaders |  -.0414719   .0553108    -0.75   0.453     -.149879    .0669352
          survey_maint_rule_BS |  -.0135492   .0522006    -0.26   0.795    -.1158605    .0887621
  survey_dam_for_irrigation_FS |   .2230783   .1284633     1.74   0.082     -.028705    .4748617
           survey_maint_12m_BS |  -.1206755   .1146773    -1.05   0.293    -.3454388    .1040878
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -45.625234  
Iteration 2:   log pseudolikelihood =  -45.53759  
Iteration 3:   log pseudolikelihood = -45.537414  
Iteration 4:   log pseudolikelihood = -45.537414  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      13.27
                                                Prob > chi2       =     0.1507
Log pseudolikelihood = -45.537414               Pseudo R2         =     0.1452

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .681092   .3446175     1.98   0.048     .0056542     1.35653
         survey_maint_12m_BS |   .5359933   .3278513     1.63   0.102    -.1065835     1.17857
survey_dam_for_irrigation_FS |   .0266462   .3381333     0.08   0.937    -.6360829    .6893752
                       No_HH |   .0006988   .0022275     0.31   0.754     -.003667    .0050647
                    FES_site |   .0964965   .3396557     0.28   0.776    -.5692165    .7622095
            n_SHG_before2017 |   .0319183   .0332489     0.96   0.337    -.0332483    .0970848
                    Shar_Lit |   .0157667   .0201537     0.78   0.434    -.0237339    .0552673
                   Shar_SCST |  -.0184847   .0093247    -1.98   0.047    -.0367609   -.0002086
                n_school_gov |  -.3069403    .191121    -1.61   0.108    -.6815306      .06765
                       _cons |   .4224325   1.456272     0.29   0.772    -2.431808    3.276673
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2142335   .1004292     2.13   0.033      .017396    .4110711
         survey_maint_12m_BS |   .1685936   .0973938     1.73   0.083    -.0222947    .3594819
survey_dam_for_irrigation_FS |   .0083814   .1063148     0.08   0.937    -.1999918    .2167546
                       No_HH |   .0002198   .0007008     0.31   0.754    -.0011538    .0015934
                    FES_site |   .0303524   .1065121     0.28   0.776    -.1784074    .2391123
            n_SHG_before2017 |   .0100397   .0103718     0.97   0.333    -.0102887    .0303682
                    Shar_Lit |   .0049593   .0062845     0.79   0.430    -.0073581    .0172768
                   Shar_SCST |  -.0058143   .0027736    -2.10   0.036    -.0112504   -.0003782
                n_school_gov |  -.0965463   .0582482    -1.66   0.097    -.2107106     .017618
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14522138

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood = -53.273928  
Iteration 1:   log pseudolikelihood = -45.625234  
Iteration 2:   log pseudolikelihood =  -45.53759  
Iteration 3:   log pseudolikelihood = -45.537414  
Iteration 4:   log pseudolikelihood = -45.537414  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      13.27
                                                Prob > chi2       =     0.1507
Log pseudolikelihood = -45.537414               Pseudo R2         =     0.1452

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .681092   .3446175     1.98   0.048     .0056542     1.35653
         survey_maint_12m_BS |   .5359933   .3278513     1.63   0.102    -.1065835     1.17857
survey_dam_for_irrigation_FS |   .0266462   .3381333     0.08   0.937    -.6360829    .6893752
                       No_HH |   .0006988   .0022275     0.31   0.754     -.003667    .0050647
                    FES_site |   .0964965   .3396557     0.28   0.776    -.5692165    .7622095
            n_SHG_before2017 |   .0319183   .0332489     0.96   0.337    -.0332483    .0970848
                    Shar_Lit |   .0157667   .0201537     0.78   0.434    -.0237339    .0552673
                   Shar_SCST |  -.0184847   .0093247    -1.98   0.047    -.0367609   -.0002086
                n_school_gov |  -.3069403    .191121    -1.61   0.108    -.6815306      .06765
                       _cons |   .4224325   1.456272     0.29   0.772    -2.431808    3.276673
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2142335   .1004292     2.13   0.033      .017396    .4110711
         survey_maint_12m_BS |   .1685936   .0973938     1.73   0.083    -.0222947    .3594819
survey_dam_for_irrigation_FS |   .0083814   .1063148     0.08   0.937    -.1999918    .2167546
                       No_HH |   .0002198   .0007008     0.31   0.754    -.0011538    .0015934
                    FES_site |   .0303524   .1065121     0.28   0.776    -.1784074    .2391123
            n_SHG_before2017 |   .0100397   .0103718     0.97   0.333    -.0102887    .0303682
                    Shar_Lit |   .0049593   .0062845     0.79   0.430    -.0073581    .0172768
                   Shar_SCST |  -.0058143   .0027736    -2.10   0.036    -.0112504   -.0003782
                n_school_gov |  -.0965463   .0582482    -1.66   0.097    -.2107106     .017618
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .14522138

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.295031  
Iteration 2:   log pseudolikelihood = -51.294734  
Iteration 3:   log pseudolikelihood = -51.294734  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       1.29
                                                Prob > chi2       =     0.5238
Log pseudolikelihood = -51.294734               Pseudo R2         =     0.0130

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .086564   .3099871     0.28   0.780    -.5209995    .6941274
 survey_maint_12m_BS |   .3219676   .2907744     1.11   0.268    -.2479398     .891875
               _cons |  -.7304377   .3046826    -2.40   0.017    -1.327605   -.1332708
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .0301018   .1075954     0.28   0.780    -.1807813    .2409848
survey_maint_12m_BS |    .111961   .0989799     1.13   0.258     -.082036    .3059581
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01303908

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $controls, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -42.442673  
Iteration 2:   log pseudolikelihood =  -42.08842  
Iteration 3:   log pseudolikelihood = -42.087074  
Iteration 4:   log pseudolikelihood = -42.087074  

Probit regression                               Number of obs     =         82
                                                Wald chi2(9)      =      17.91
                                                Prob > chi2       =     0.0363
Log pseudolikelihood = -42.087074               Pseudo R2         =     0.1654

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2084062   .3416438     0.61   0.542    -.4612034    .8780157
         survey_maint_12m_BS |   .2710409   .3298895     0.82   0.411    -.3755306    .9176124
survey_dam_for_irrigation_FS |  -.7210307   .3557094    -2.03   0.043    -1.418208   -.0238531
                       No_HH |  -.0057385   .0027675    -2.07   0.038    -.0111627   -.0003143
                    FES_site |    .152018   .3466601     0.44   0.661    -.5274232    .8314592
            n_SHG_before2017 |   .1217182   .0357161     3.41   0.001      .051716    .1917205
                    Shar_Lit |   .0095572    .020836     0.46   0.646    -.0312806     .050395
                   Shar_SCST |   -.011359   .0098189    -1.16   0.247    -.0306037    .0078857
                n_school_gov |  -.3091573   .2068141    -1.49   0.135    -.7145056    .0961909
                       _cons |   .2702073   1.474873     0.18   0.855     -2.62049    3.160905
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0601638    .097775     0.62   0.538    -.1314716    .2517993
         survey_maint_12m_BS |   .0782456    .094261     0.83   0.406    -.1065026    .2629938
survey_dam_for_irrigation_FS |  -.2081511   .0943097    -2.21   0.027    -.3929947   -.0233075
                       No_HH |  -.0016566   .0007741    -2.14   0.032    -.0031738   -.0001394
                    FES_site |   .0438854   .0996249     0.44   0.660    -.1513758    .2391466
            n_SHG_before2017 |   .0351383   .0092571     3.80   0.000     .0169947    .0532819
                    Shar_Lit |    .002759    .005983     0.46   0.645    -.0089674    .0144855
                   Shar_SCST |  -.0032792   .0027783    -1.18   0.238    -.0087246    .0021663
                n_school_gov |  -.0892492   .0586529    -1.52   0.128    -.2042067    .0257083
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .16535568

. 
. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/intervention_effect.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph saved)

. gr export "$working_ANALYSIS\results\figures\intervention_effect.png", replace width(3800)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png written in PNG format)

. 
. 
. * Table S9.     Treatment effects
. esttab treatment1 treatment2 using "$working_ANALYSIS\results\Tables\tableS9_treatment_effects.rtf", ci transform(ln*: exp(@) exp(@))mtitles("D
> am maintenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *
> ** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust stand
> ard errors. Omitted category is ‘village villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableS9_treatment_effects.rtf)

. restore
nothing to restore
r(622);

end of do-file

r(622);

. do "C:\Users\istei\AppData\Local\Temp\STDbfc_000000.tmp"

. esttab treatment1 treatment2 treatment3 treatment4 using "$working_ANALYSIS\results\Tables\tableS9_treatment_effects.rtf", ci transform(ln*: ex
> p(@) exp(@))mtitles("Dam maintenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f))
>  star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regress
> ions with robust standard errors. Omitted category is ‘village villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.00
> 1") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableS9_treatment_effects.rtf)

. 
end of do-file

. exit, clear
