-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2025.05.21-09.33.19.log.txt
  log type:  text
 opened on:  21 May 2025, 09:33:19

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 21 May 2025 09:33:19

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;
> lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace-desktop-r4995g6;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50
> " reduces transparency)
. grstyle set color       "100 143 255" "220 38 127" "120 94 240"  "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "220 38 127*0.4" "120 94 240*0.4"  "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "220 38 127*1.7" "120 94 240*1.7"  "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *margins
. grstyle set compact
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. 
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. ** REVISIONS
. 
end of do-file

. sum game_total_all

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_total~l |         56    106.9286    33.36457         15        174

. sum game_total_gamerelated

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
game_total~d |         56     105.125      33.436         15        174

. tab leader_comp
leader_comp ambiguous abbreviation
r(111);

. tab leader_comp1_BS

  No leader |
participate |
     d (=1) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         47       83.93       83.93
          1 |          9       16.07      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. *d
. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(3, 52)        =      2.36
       Model |  7356.06944         3  2452.02315   Prob > F        =    0.0825
    Residual |  54132.0556        52  1041.00107   R-squared       =    0.1196
-------------+----------------------------------   Adj R-squared   =    0.0688
       Total |   61488.125        55  1117.96591   Root MSE        =    32.265

---------------------------------------------------------------------------------
game_total_ga~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
leader_comp2_BS |   12.55556   12.41863     1.01   0.317    -12.36425    37.47536
leader_comp3_BS |   10.13889   15.67775     0.65   0.521    -21.32082     41.5986
leader_comp4_BS |  -16.27778   14.22733    -1.14   0.258      -44.827    12.27145
          _cons |   101.1111   10.75485     9.40   0.000     79.52993    122.6923
---------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =       5.01
                                                Prob > F          =     0.0040
                                                R-squared         =     0.1196
                                                Root MSE          =     32.265

---------------------------------------------------------------------------------
                |               Robust
game_total_ga~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
leader_comp2_BS |   12.55556   14.66531     0.86   0.396    -16.87255    41.98366
leader_comp3_BS |   10.13889   20.38327     0.50   0.621    -30.76313    51.04091
leader_comp4_BS |  -16.27778   14.31917    -1.14   0.261    -45.01129    12.45573
          _cons |   101.1111   13.43934     7.52   0.000     74.14311    128.0791
---------------------------------------------------------------------------------

. 
. *
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. global controls No_HH FES_site n_SHG_before2017 Shar_Lit Shar_SCST n_school_gov

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. *total game related discussions in villages
. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       4.45
                                                Prob > F          =     0.0003
                                                R-squared         =     0.2454
                                                Root MSE          =     31.759

----------------------------------------------------------------------------------
                 |               Robust
game_total_gam~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   24.75264   12.76059     1.94   0.059    -.9330906    50.43837
 leader_comp3_BS |   18.50596    20.8449     0.89   0.379    -23.45265    60.46456
 leader_comp4_BS |  -2.111893   16.87616    -0.13   0.901    -36.08185    31.85806
           No_HH |    .021296   .0717251     0.30   0.768    -.1230791    .1656711
        FES_site |  -17.26179   10.79037    -1.60   0.117    -38.98168    4.458099
n_SHG_before2017 |  -1.177213   .9094378    -1.29   0.202    -3.007816    .6533909
        Shar_Lit |  -1.200035    .692175    -1.73   0.090    -2.593311    .1932415
       Shar_SCST |  -.4468434   .2773404    -1.61   0.114    -1.005101    .1114139
    n_school_gov |  -4.582799   5.248332    -0.87   0.387    -15.14714    5.981545
           _cons |   211.4185   46.97833     4.50   0.000      116.856     305.981
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_propose_rule leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       2.79
                                                Prob > F          =     0.0106
                                                R-squared         =     0.1652
                                                Root MSE          =     7.9839

----------------------------------------------------------------------------------
                 |               Robust
game_propose_r~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   3.443773   2.957294     1.16   0.250    -2.508952    9.396497
 leader_comp3_BS |    3.38992   4.886955     0.69   0.491     -6.44701    13.22685
 leader_comp4_BS |  -.2313818    4.09056    -0.06   0.955    -8.465252    8.002488
           No_HH |  -.0013074    .016302    -0.08   0.936    -.0341217     .031507
        FES_site |  -2.904774   3.175253    -0.91   0.365    -9.296227    3.486679
n_SHG_before2017 |  -.1675946   .2444015    -0.69   0.496    -.6595492    .3243601
        Shar_Lit |  -.3079572   .1686859    -1.83   0.074    -.6475042    .0315899
       Shar_SCST |  -.0870277   .0636592    -1.37   0.178    -.2151671    .0411117
    n_school_gov |  -.8225764   1.224569    -0.67   0.505    -3.287506    1.642353
           _cons |   53.46516   10.33197     5.17   0.000     32.66797    74.26234
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_almost_opt_inv_r9_10 leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       1.23
                                                Prob > F          =     0.3033
                                                R-squared         =     0.1896
                                                Root MSE          =     .34756

----------------------------------------------------------------------------------
                 |               Robust
game_almost~9_10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   .1805955   .1677503     1.08   0.287    -.1570684    .5182594
 leader_comp3_BS |   .1716145   .2178501     0.79   0.435     -.266895     .610124
 leader_comp4_BS |   .1809361   .1989402     0.91   0.368    -.2195098    .5813821
           No_HH |  -.0005063   .0008005    -0.63   0.530    -.0021176    .0011049
        FES_site |   -.207943   .0776619    -2.68   0.010    -.3642683   -.0516178
n_SHG_before2017 |   .0067521   .0103807     0.65   0.519     -.014143    .0276473
        Shar_Lit |   .0097757   .0066654     1.47   0.149    -.0036411    .0231924
       Shar_SCST |  -.0010515    .002869    -0.37   0.716    -.0068264    .0047234
    n_school_gov |  -.0157714   .0664783    -0.24   0.814    -.1495852    .1180425
           _cons |   .4962989    .487922     1.02   0.314    -.4858371    1.478435
----------------------------------------------------------------------------------

. 
end of do-file

. tab game_almost_opt_inv_r9_10

Both groups |
   invested |
      about |
80-100 % in |
   last two |
     rounds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       14.29       14.29
          1 |         48       85.71      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_optimal_inv_r9_10

Both groups |
   invested |
  optimally |
in last two |
     rounds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         56      100.00      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_opt_inv_r9

    Optimal |
 investment |
 in round 9 |
    reached |
       by.. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6       10.91       10.91
          2 |         21       38.18       49.09
          3 |         28       50.91      100.00
------------+-----------------------------------
      Total |         55      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_praises leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       2.57
                                                Prob > F          =     0.0174
                                                R-squared         =     0.2507
                                                Root MSE          =      7.354

----------------------------------------------------------------------------------
                 |               Robust
    game_praises |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   5.434693   3.128479     1.74   0.089    -.8626091      11.732
 leader_comp3_BS |   2.829216   4.557646     0.62   0.538    -6.344849    12.00328
 leader_comp4_BS |  -.3395059   3.579933    -0.09   0.925    -7.545536    6.866525
           No_HH |  -.0008552   .0169285    -0.05   0.960    -.0349305      .03322
        FES_site |  -5.818157   2.301151    -2.53   0.015    -10.45013   -1.186179
n_SHG_before2017 |  -.3301036   .2288542    -1.44   0.156    -.7907632    .1305559
        Shar_Lit |  -.2834379   .1535136    -1.85   0.071    -.5924447     .025569
       Shar_SCST |  -.0617189   .0663293    -0.93   0.357     -.195233    .0717951
    n_school_gov |  -.8888117   1.136432    -0.78   0.438    -3.176331    1.398708
           _cons |   34.73212   11.24734     3.09   0.003     12.09241    57.37183
----------------------------------------------------------------------------------

. 
end of do-file

. tab game_praises

   Total of |
 praises in |
village for |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.79        1.79
          1 |          4        7.14        8.93
          2 |          7       12.50       21.43
          3 |          3        5.36       26.79
          4 |          2        3.57       30.36
          5 |          2        3.57       33.93
          6 |          2        3.57       37.50
          7 |          1        1.79       39.29
          8 |          3        5.36       44.64
          9 |          4        7.14       51.79
         10 |          3        5.36       57.14
         11 |          2        3.57       60.71
         12 |          3        5.36       66.07
         13 |          2        3.57       69.64
         15 |          2        3.57       73.21
         16 |          2        3.57       76.79
         17 |          1        1.79       78.57
         19 |          3        5.36       83.93
         21 |          2        3.57       87.50
         22 |          1        1.79       89.29
         23 |          1        1.79       91.07
         24 |          3        5.36       96.43
         26 |          1        1.79       98.21
         27 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_punish

   Total of |
   proposed |
 punishment |
 in village |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         17       30.36       30.36
          1 |         14       25.00       55.36
          2 |          5        8.93       64.29
          3 |          4        7.14       71.43
          4 |          2        3.57       75.00
          5 |          3        5.36       80.36
          7 |          1        1.79       82.14
          8 |          1        1.79       83.93
          9 |          3        5.36       89.29
         10 |          1        1.79       91.07
         11 |          2        3.57       94.64
         12 |          2        3.57       98.21
         15 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_total_all leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       4.48
                                                Prob > F          =     0.0003
                                                R-squared         =     0.2341
                                                Root MSE          =     31.927

----------------------------------------------------------------------------------
                 |               Robust
  game_total_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   23.43688   12.64181     1.85   0.070    -2.009763    48.88352
 leader_comp3_BS |   16.72169   20.89126     0.80   0.428    -25.33023    58.77361
 leader_comp4_BS |  -2.096962   16.96306    -0.12   0.902    -36.24182     32.0479
           No_HH |   .0221561   .0731485     0.30   0.763    -.1250842    .1693964
        FES_site |  -16.44303   10.95727    -1.50   0.140    -38.49886    5.612802
n_SHG_before2017 |  -1.177187   .9128088    -1.29   0.204    -3.014576    .6602017
        Shar_Lit |  -1.164706   .6921191    -1.68   0.099    -2.557869    .2284578
       Shar_SCST |  -.4303615   .2789329    -1.54   0.130    -.9918242    .1311013
    n_school_gov |  -5.341644   5.338049    -1.00   0.322    -16.08658    5.403292
           _cons |    211.526   46.80055     4.52   0.000     117.3214    305.7307
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS $controls, r

Linear regression                               Number of obs     =         56
                                                F(9, 46)          =       4.45
                                                Prob > F          =     0.0003
                                                R-squared         =     0.2454
                                                Root MSE          =     31.759

----------------------------------------------------------------------------------
                 |               Robust
game_total_gam~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
 leader_comp2_BS |   24.75264   12.76059     1.94   0.059    -.9330906    50.43837
 leader_comp3_BS |   18.50596    20.8449     0.89   0.379    -23.45265    60.46456
 leader_comp4_BS |  -2.111893   16.87616    -0.13   0.901    -36.08185    31.85806
           No_HH |    .021296   .0717251     0.30   0.768    -.1230791    .1656711
        FES_site |  -17.26179   10.79037    -1.60   0.117    -38.98168    4.458099
n_SHG_before2017 |  -1.177213   .9094378    -1.29   0.202    -3.007816    .6533909
        Shar_Lit |  -1.200035    .692175    -1.73   0.090    -2.593311    .1932415
       Shar_SCST |  -.4468434   .2773404    -1.61   0.114    -1.005101    .1114139
    n_school_gov |  -4.582799   5.248332    -0.87   0.387    -15.14714    5.981545
           _cons |   211.4185   46.97833     4.50   0.000      116.856     305.981
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.62
                                                Prob > F          =     0.0009
                                                R-squared         =     0.3597
                                                Root MSE          =     30.258

------------------------------------------------------------------------------------------
                         |               Robust
  game_total_gamerelated |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   3.275662   16.83499     0.19   0.847    -30.67534    37.22666
         leader_comp3_BS |  -7.803913   20.37417    -0.38   0.704    -48.89233    33.28451
         leader_comp4_BS |  -14.75956   16.70841    -0.88   0.382    -48.45527    18.93615
           total_leaders |   2.348928   4.667493     0.50   0.617    -7.063969    11.76183
share_female_percent3_BS |  -1.355771   3.001753    -0.45   0.654    -7.409383    4.697841
                sequence |  -.6922725    .453388    -1.53   0.134    -1.606617    .2220716
                   No_HH |   .0240194   .0766744     0.31   0.756    -.1306092     .178648
                FES_site |  -7.895827   11.96973    -0.66   0.513    -32.03509    16.24343
        n_SHG_before2017 |  -.6548856   .8939132    -0.73   0.468    -2.457633    1.147862
                Shar_Lit |  -1.311077   .7335689    -1.79   0.081     -2.79046    .1683058
               Shar_SCST |  -.4444745   .2880954    -1.54   0.130    -1.025474    .1365254
            n_school_gov |  -2.599257   4.950995    -0.52   0.602    -12.58389    7.385376
                   _cons |   239.4631     51.995     4.61   0.000     134.6052     344.321
------------------------------------------------------------------------------------------

. reg game_propose_rule leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       2.01
                                                Prob > F          =     0.0469
                                                R-squared         =     0.2330
                                                Root MSE          =     7.9155

------------------------------------------------------------------------------------------
                         |               Robust
       game_propose_rule |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.6116772   4.256758    -0.14   0.886    -9.196247    7.972893
         leader_comp3_BS |  -3.136622   5.454205    -0.58   0.568    -14.13608    7.862831
         leader_comp4_BS |  -2.453343   4.400707    -0.56   0.580    -11.32821    6.421528
           total_leaders |   1.147179   1.307325     0.88   0.385    -1.489293    3.783652
share_female_percent3_BS |  -.3028403   .6290878    -0.48   0.633    -1.571517    .9658362
                sequence |  -.0790601   .1164558    -0.68   0.501    -.3139155    .1557953
                   No_HH |  -.0001518   .0171283    -0.01   0.993    -.0346944    .0343907
                FES_site |  -1.671993   3.311915    -0.50   0.616    -8.351107    5.007121
        n_SHG_before2017 |  -.1103144   .2477705    -0.45   0.658    -.6099913    .3893625
                Shar_Lit |  -.3409096   .1961966    -1.74   0.089    -.7365777    .0547586
               Shar_SCST |   -.073983   .0704249    -1.05   0.299    -.2160084    .0680423
            n_school_gov |  -.6067748   1.237397    -0.49   0.626    -3.102224    1.888674
                   _cons |   56.89514   12.70897     4.48   0.000     31.26507    82.52522
------------------------------------------------------------------------------------------

. reg game_almost_opt_inv_r9_10 leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       1.01
                                                Prob > F          =     0.4542
                                                R-squared         =     0.2303
                                                Root MSE          =     .35035

------------------------------------------------------------------------------------------
                         |               Robust
game_almost_opt_inv_r9~0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .0777879   .1864789     0.42   0.679    -.2982826    .4538585
         leader_comp3_BS |   .1376535   .2822772     0.49   0.628    -.4316127    .7069198
         leader_comp4_BS |   .0763063   .2191669     0.35   0.729    -.3656858    .5182984
           total_leaders |  -.0246947   .0354073    -0.70   0.489    -.0961003     .046711
share_female_percent3_BS |    .016509   .0313102     0.53   0.601     -.046634     .079652
                sequence |  -.0065996   .0046136    -1.43   0.160    -.0159039    .0027047
                   No_HH |  -.0005681   .0007981    -0.71   0.480    -.0021775    .0010414
                FES_site |  -.1314508   .0955937    -1.38   0.176    -.3242339    .0613323
        n_SHG_before2017 |   .0128166   .0118751     1.08   0.286    -.0111318    .0367651
                Shar_Lit |   .0094901   .0069536     1.36   0.179    -.0045332    .0235134
               Shar_SCST |  -.0017542   .0026224    -0.67   0.507    -.0070428    .0035345
            n_school_gov |   .0079061   .0686399     0.12   0.909    -.1305195    .1463317
                   _cons |   .7083756   .4863959     1.46   0.153    -.2725352    1.689286
------------------------------------------------------------------------------------------

. reg game_praises leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.27
                                                Prob > F          =     0.0021
                                                R-squared         =     0.3641
                                                Root MSE          =     7.0071

------------------------------------------------------------------------------------------
                         |               Robust
            game_praises |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.1303568   3.411475    -0.04   0.970    -7.010252    6.749539
         leader_comp3_BS |  -5.442839   5.033157    -1.08   0.286    -15.59317     4.70749
         leader_comp4_BS |  -4.329294   4.032618    -1.07   0.289    -12.46184    3.803255
           total_leaders |   1.406929   1.101603     1.28   0.208    -.8146641    3.628522
share_female_percent3_BS |   .1172943   .6806051     0.17   0.864    -1.255277    1.489865
                sequence |  -.1371573   .0920733    -1.49   0.144    -.3228408    .0485262
                   No_HH |  -.0004863   .0176794    -0.03   0.978    -.0361403    .0351676
                FES_site |  -3.890408   2.599634    -1.50   0.142     -9.13307    1.352253
        n_SHG_before2017 |  -.2049038   .2377252    -0.86   0.394    -.6843223    .2745148
                Shar_Lit |  -.3350764   .1309148    -2.56   0.014    -.5990912   -.0710616
               Shar_SCST |  -.0486005   .0713205    -0.68   0.499    -.1924321     .095231
            n_school_gov |  -.4011465   1.155193    -0.35   0.730    -2.730816    1.928523
                   _cons |   39.44042   10.99802     3.59   0.001     17.26081    61.62003
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg survey_share_exp_comm_meet_FS leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       3.20
                                                Prob > F          =     0.0025
                                                R-squared         =     0.3049
                                                Root MSE          =     .45367

------------------------------------------------------------------------------------------
                         |               Robust
survey_share_exp_comm_~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.0764153   .2439362    -0.31   0.756    -.5686985    .4158678
         leader_comp3_BS |  -.4219874   .3669512    -1.15   0.257    -1.162525    .3185502
         leader_comp4_BS |  -.1726582   .2669074    -0.65   0.521    -.7112992    .3659828
           total_leaders |   .2016291    .074963     2.69   0.010     .0503477    .3529106
share_female_percent3_BS |   .1315097   .0356298     3.69   0.001     .0596058    .2034135
                sequence |  -.0024389   .0055078    -0.44   0.660    -.0135541    .0086764
                   No_HH |   .0003025   .0007988     0.38   0.707    -.0013095    .0019146
                FES_site |   .0021107    .163197     0.01   0.990    -.3272342    .3314556
        n_SHG_before2017 |   .0204259   .0142736     1.43   0.160    -.0083794    .0492313
                Shar_Lit |    -.00795    .007241    -1.10   0.278     -.022563     .006663
               Shar_SCST |   .0027421   .0041358     0.66   0.511    -.0056044    .0110885
            n_school_gov |  -.0020152   .0777167    -0.03   0.979    -.1588539    .1548236
                   _cons |  -.0864175   .5616321    -0.15   0.878    -1.219837    1.047002
------------------------------------------------------------------------------------------

. reg survey_share_exp_others_FS leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       0.89
                                                Prob > F          =     0.5621
                                                R-squared         =     0.2312
                                                Root MSE          =      .3344

------------------------------------------------------------------------------------------
                         |               Robust
survey_share_exp_other~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.0593243   .1525662    -0.39   0.699    -.3672153    .2485668
         leader_comp3_BS |  -.1923457   .2210988    -0.87   0.389     -.638541    .2538497
         leader_comp4_BS |  -.2905979   .1671009    -1.74   0.089    -.6278212    .0466254
           total_leaders |    .065291   .0561301     1.16   0.251    -.0479842    .1785662
share_female_percent3_BS |  -.0152548   .0215151    -0.71   0.482    -.0586741    .0281644
                sequence |   .0009805   .0043058     0.23   0.821     -.007709      .00967
                   No_HH |  -.0003272   .0005397    -0.61   0.548    -.0014165     .000762
                FES_site |  -.1963483   .1372034    -1.43   0.160    -.4732359    .0805393
        n_SHG_before2017 |   .0070378   .0081177     0.87   0.391    -.0093443      .02342
                Shar_Lit |  -.0011318   .0062716    -0.18   0.858    -.0137884    .0115249
               Shar_SCST |   .0041138   .0021679     1.90   0.065    -.0002611    .0084888
            n_school_gov |   .0813427   .0595023     1.37   0.179    -.0387377    .2014231
                   _cons |  -.1057387   .4847639    -0.22   0.828    -1.084032    .8725544
------------------------------------------------------------------------------------------

. reg   survey_share_exp_vc_meet_FS leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       0.61
                                                Prob > F          =     0.8255
                                                R-squared         =     0.1897
                                                Root MSE          =     .32113

------------------------------------------------------------------------------------------
                         |               Robust
survey_share_exp_vc_me~S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .2475154   .1270811     1.95   0.058    -.0089447    .5039755
         leader_comp3_BS |   .1685729   .1802185     0.94   0.355    -.1951228    .5322685
         leader_comp4_BS |   .0865463   .1310213     0.66   0.513    -.1778654     .350958
           total_leaders |  -.0109662   .0393216    -0.28   0.782    -.0903204     .068388
share_female_percent3_BS |  -.0255181   .0277896    -0.92   0.364    -.0815999    .0305636
                sequence |   .0053699    .003378     1.59   0.119    -.0014473     .012187
                   No_HH |  -.0000991   .0004651    -0.21   0.832    -.0010378    .0008395
                FES_site |   .1024178   .0685214     1.49   0.142    -.0358639    .2406996
        n_SHG_before2017 |   .0063565   .0065083     0.98   0.334    -.0067777    .0194908
                Shar_Lit |   .0021426   .0066096     0.32   0.747    -.0111961    .0154813
               Shar_SCST |   .0009415   .0026405     0.36   0.723    -.0043872    .0062703
            n_school_gov |   -.010779   .0727743    -0.15   0.883    -.1576436    .1360856
                   _cons |  -.3910756   .3910312    -1.00   0.323    -1.180209    .3980574
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.62
                                                Prob > F          =     0.0009
                                                R-squared         =     0.3597
                                                Root MSE          =     30.258

------------------------------------------------------------------------------------------
                         |               Robust
  game_total_gamerelated |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   3.275662   16.83499     0.19   0.847    -30.67534    37.22666
         leader_comp3_BS |  -7.803913   20.37417    -0.38   0.704    -48.89233    33.28451
         leader_comp4_BS |  -14.75956   16.70841    -0.88   0.382    -48.45527    18.93615
           total_leaders |   2.348928   4.667493     0.50   0.617    -7.063969    11.76183
share_female_percent3_BS |  -1.355771   3.001753    -0.45   0.654    -7.409383    4.697841
                sequence |  -.6922725    .453388    -1.53   0.134    -1.606617    .2220716
                   No_HH |   .0240194   .0766744     0.31   0.756    -.1306092     .178648
                FES_site |  -7.895827   11.96973    -0.66   0.513    -32.03509    16.24343
        n_SHG_before2017 |  -.6548856   .8939132    -0.73   0.468    -2.457633    1.147862
                Shar_Lit |  -1.311077   .7335689    -1.79   0.081     -2.79046    .1683058
               Shar_SCST |  -.4444745   .2880954    -1.54   0.130    -1.025474    .1365254
            n_school_gov |  -2.599257   4.950995    -0.52   0.602    -12.58389    7.385376
                   _cons |   239.4631     51.995     4.61   0.000     134.6052     344.321
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_propose_rule leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       2.01
                                                Prob > F          =     0.0469
                                                R-squared         =     0.2330
                                                Root MSE          =     7.9155

------------------------------------------------------------------------------------------
                         |               Robust
       game_propose_rule |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.6116772   4.256758    -0.14   0.886    -9.196247    7.972893
         leader_comp3_BS |  -3.136622   5.454205    -0.58   0.568    -14.13608    7.862831
         leader_comp4_BS |  -2.453343   4.400707    -0.56   0.580    -11.32821    6.421528
           total_leaders |   1.147179   1.307325     0.88   0.385    -1.489293    3.783652
share_female_percent3_BS |  -.3028403   .6290878    -0.48   0.633    -1.571517    .9658362
                sequence |  -.0790601   .1164558    -0.68   0.501    -.3139155    .1557953
                   No_HH |  -.0001518   .0171283    -0.01   0.993    -.0346944    .0343907
                FES_site |  -1.671993   3.311915    -0.50   0.616    -8.351107    5.007121
        n_SHG_before2017 |  -.1103144   .2477705    -0.45   0.658    -.6099913    .3893625
                Shar_Lit |  -.3409096   .1961966    -1.74   0.089    -.7365777    .0547586
               Shar_SCST |   -.073983   .0704249    -1.05   0.299    -.2160084    .0680423
            n_school_gov |  -.6067748   1.237397    -0.49   0.626    -3.102224    1.888674
                   _cons |   56.89514   12.70897     4.48   0.000     31.26507    82.52522
------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. * discussions within community
. gen game_discussed_formally = 0 if survey_share_exp_comm_meet_FS==0 & survey_share_exp_vc_meet_FS==0
(157 missing values generated)

. replace game_discussed_formally = 1 if survey_share_exp_vc_meet_FS==1 | survey_share_exp_comm_meet_FS==1
(24 real changes made)

. tab game_discussed_formally

game_discus |
sed_formall |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       56.36       56.36
          1 |         24       43.64      100.00
------------+-----------------------------------
      Total |         55      100.00

. ttest game_discussed_formally, by(female_leader_present_BS)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |      35    .4285714    .0848698    .5020964    .2560953    .6010476
       1 |      20         .45    .1141329    .5104178    .2111171    .6888829
---------+--------------------------------------------------------------------
combined |      55    .4363636    .0674881    .5005048    .3010582     .571669
---------+--------------------------------------------------------------------
    diff |           -.0214286    .1415812               -.3054046    .2625474
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1514
Ho: diff = 0                                     degrees of freedom =       53

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4401         Pr(|T| > |t|) = 0.8803          Pr(T > t) = 0.5599

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. reg game_discussed_formally leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       3.54
                                                Prob > F          =     0.0011
                                                R-squared         =     0.2724
                                                Root MSE          =      .4841

------------------------------------------------------------------------------------------
                         |               Robust
 game_discussed_formally |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .1604066   .2375359     0.68   0.503    -.3189603    .6397735
         leader_comp3_BS |  -.2026523    .356507    -0.57   0.573    -.9221125    .5168079
         leader_comp4_BS |  -.0059132   .2642046    -0.02   0.982    -.5390996    .5272733
           total_leaders |   .1704323   .0798139     2.14   0.039     .0093613    .3315033
share_female_percent3_BS |   .0965491   .0376857     2.56   0.014     .0204963     .172602
                sequence |   .0024207   .0057323     0.42   0.675    -.0091476    .0139891
                   No_HH |   .0003273   .0009297     0.35   0.727    -.0015489    .0022034
                FES_site |   .0754192   .1810249     0.42   0.679    -.2899038    .4407421
        n_SHG_before2017 |   .0234396   .0158178     1.48   0.146     -.008482    .0553611
                Shar_Lit |  -.0047505   .0086746    -0.55   0.587    -.0222566    .0127555
               Shar_SCST |   .0033797   .0044632     0.76   0.453    -.0056274    .0123867
            n_school_gov |  -.0748738   .0817039    -0.92   0.365    -.2397588    .0900113
                   _cons |  -.3504544   .6796785    -0.52   0.609    -1.722101    1.021192
------------------------------------------------------------------------------------------

. 
end of do-file

. tab game_propose_rule

   Total of |
   proposed |
   rules in |
village for |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          4 |          1        1.79        1.79
         14 |          1        1.79        3.57
         17 |          1        1.79        5.36
         20 |          3        5.36       10.71
         22 |          7       12.50       23.21
         23 |          3        5.36       28.57
         24 |          3        5.36       33.93
         25 |          4        7.14       41.07
         26 |          3        5.36       46.43
         27 |          3        5.36       51.79
         28 |          1        1.79       53.57
         29 |          5        8.93       62.50
         30 |          2        3.57       66.07
         31 |          4        7.14       73.21
         32 |          1        1.79       75.00
         33 |          1        1.79       76.79
         34 |          1        1.79       78.57
         35 |          2        3.57       82.14
         36 |          1        1.79       83.93
         37 |          2        3.57       87.50
         38 |          2        3.57       91.07
         41 |          1        1.79       92.86
         42 |          1        1.79       94.64
         43 |          1        1.79       96.43
         46 |          1        1.79       98.21
         49 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. tab game_praises

   Total of |
 praises in |
village for |
      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.79        1.79
          1 |          4        7.14        8.93
          2 |          7       12.50       21.43
          3 |          3        5.36       26.79
          4 |          2        3.57       30.36
          5 |          2        3.57       33.93
          6 |          2        3.57       37.50
          7 |          1        1.79       39.29
          8 |          3        5.36       44.64
          9 |          4        7.14       51.79
         10 |          3        5.36       57.14
         11 |          2        3.57       60.71
         12 |          3        5.36       66.07
         13 |          2        3.57       69.64
         15 |          2        3.57       73.21
         16 |          2        3.57       76.79
         17 |          1        1.79       78.57
         19 |          3        5.36       83.93
         21 |          2        3.57       87.50
         22 |          1        1.79       89.29
         23 |          1        1.79       91.07
         24 |          3        5.36       96.43
         26 |          1        1.79       98.21
         27 |          1        1.79      100.00
------------+-----------------------------------
      Total |         56      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. *did female leader participation /general female participation alter the game experience? (discussions, rules proposed, cooperative play, etc.)
. eststo game1: reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $contr
> ols, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.62
                                                Prob > F          =     0.0009
                                                R-squared         =     0.3597
                                                Root MSE          =     30.258

------------------------------------------------------------------------------------------
                         |               Robust
  game_total_gamerelated |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   3.275662   16.83499     0.19   0.847    -30.67534    37.22666
         leader_comp3_BS |  -7.803913   20.37417    -0.38   0.704    -48.89233    33.28451
         leader_comp4_BS |  -14.75956   16.70841    -0.88   0.382    -48.45527    18.93615
           total_leaders |   2.348928   4.667493     0.50   0.617    -7.063969    11.76183
share_female_percent3_BS |  -1.355771   3.001753    -0.45   0.654    -7.409383    4.697841
                sequence |  -.6922725    .453388    -1.53   0.134    -1.606617    .2220716
                   No_HH |   .0240194   .0766744     0.31   0.756    -.1306092     .178648
                FES_site |  -7.895827   11.96973    -0.66   0.513    -32.03509    16.24343
        n_SHG_before2017 |  -.6548856   .8939132    -0.73   0.468    -2.457633    1.147862
                Shar_Lit |  -1.311077   .7335689    -1.79   0.081     -2.79046    .1683058
               Shar_SCST |  -.4444745   .2880954    -1.54   0.130    -1.025474    .1365254
            n_school_gov |  -2.599257   4.950995    -0.52   0.602    -12.58389    7.385376
                   _cons |   239.4631     51.995     4.61   0.000     134.6052     344.321
------------------------------------------------------------------------------------------

. eststo game2: reg game_propose_rule leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, 
> r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       2.01
                                                Prob > F          =     0.0469
                                                R-squared         =     0.2330
                                                Root MSE          =     7.9155

------------------------------------------------------------------------------------------
                         |               Robust
       game_propose_rule |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.6116772   4.256758    -0.14   0.886    -9.196247    7.972893
         leader_comp3_BS |  -3.136622   5.454205    -0.58   0.568    -14.13608    7.862831
         leader_comp4_BS |  -2.453343   4.400707    -0.56   0.580    -11.32821    6.421528
           total_leaders |   1.147179   1.307325     0.88   0.385    -1.489293    3.783652
share_female_percent3_BS |  -.3028403   .6290878    -0.48   0.633    -1.571517    .9658362
                sequence |  -.0790601   .1164558    -0.68   0.501    -.3139155    .1557953
                   No_HH |  -.0001518   .0171283    -0.01   0.993    -.0346944    .0343907
                FES_site |  -1.671993   3.311915    -0.50   0.616    -8.351107    5.007121
        n_SHG_before2017 |  -.1103144   .2477705    -0.45   0.658    -.6099913    .3893625
                Shar_Lit |  -.3409096   .1961966    -1.74   0.089    -.7365777    .0547586
               Shar_SCST |   -.073983   .0704249    -1.05   0.299    -.2160084    .0680423
            n_school_gov |  -.6067748   1.237397    -0.49   0.626    -3.102224    1.888674
                   _cons |   56.89514   12.70897     4.48   0.000     31.26507    82.52522
------------------------------------------------------------------------------------------

. eststo game3: reg game_almost_opt_inv_r9_10 leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $co
> ntrols, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       1.01
                                                Prob > F          =     0.4542
                                                R-squared         =     0.2303
                                                Root MSE          =     .35035

------------------------------------------------------------------------------------------
                         |               Robust
game_almost_opt_inv_r9~0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .0777879   .1864789     0.42   0.679    -.2982826    .4538585
         leader_comp3_BS |   .1376535   .2822772     0.49   0.628    -.4316127    .7069198
         leader_comp4_BS |   .0763063   .2191669     0.35   0.729    -.3656858    .5182984
           total_leaders |  -.0246947   .0354073    -0.70   0.489    -.0961003     .046711
share_female_percent3_BS |    .016509   .0313102     0.53   0.601     -.046634     .079652
                sequence |  -.0065996   .0046136    -1.43   0.160    -.0159039    .0027047
                   No_HH |  -.0005681   .0007981    -0.71   0.480    -.0021775    .0010414
                FES_site |  -.1314508   .0955937    -1.38   0.176    -.3242339    .0613323
        n_SHG_before2017 |   .0128166   .0118751     1.08   0.286    -.0111318    .0367651
                Shar_Lit |   .0094901   .0069536     1.36   0.179    -.0045332    .0235134
               Shar_SCST |  -.0017542   .0026224    -0.67   0.507    -.0070428    .0035345
            n_school_gov |   .0079061   .0686399     0.12   0.909    -.1305195    .1463317
                   _cons |   .7083756   .4863959     1.46   0.153    -.2725352    1.689286
------------------------------------------------------------------------------------------

. eststo game4: reg game_praises leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.27
                                                Prob > F          =     0.0021
                                                R-squared         =     0.3641
                                                Root MSE          =     7.0071

------------------------------------------------------------------------------------------
                         |               Robust
            game_praises |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.1303568   3.411475    -0.04   0.970    -7.010252    6.749539
         leader_comp3_BS |  -5.442839   5.033157    -1.08   0.286    -15.59317     4.70749
         leader_comp4_BS |  -4.329294   4.032618    -1.07   0.289    -12.46184    3.803255
           total_leaders |   1.406929   1.101603     1.28   0.208    -.8146641    3.628522
share_female_percent3_BS |   .1172943   .6806051     0.17   0.864    -1.255277    1.489865
                sequence |  -.1371573   .0920733    -1.49   0.144    -.3228408    .0485262
                   No_HH |  -.0004863   .0176794    -0.03   0.978    -.0361403    .0351676
                FES_site |  -3.890408   2.599634    -1.50   0.142     -9.13307    1.352253
        n_SHG_before2017 |  -.2049038   .2377252    -0.86   0.394    -.6843223    .2745148
                Shar_Lit |  -.3350764   .1309148    -2.56   0.014    -.5990912   -.0710616
               Shar_SCST |  -.0486005   .0713205    -0.68   0.499    -.1924321     .095231
            n_school_gov |  -.4011465   1.155193    -0.35   0.730    -2.730816    1.928523
                   _cons |   39.44042   10.99802     3.59   0.001     17.26081    61.62003
------------------------------------------------------------------------------------------

. eststo game5: reg game_praises leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.27
                                                Prob > F          =     0.0021
                                                R-squared         =     0.3641
                                                Root MSE          =     7.0071

------------------------------------------------------------------------------------------
                         |               Robust
            game_praises |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.1303568   3.411475    -0.04   0.970    -7.010252    6.749539
         leader_comp3_BS |  -5.442839   5.033157    -1.08   0.286    -15.59317     4.70749
         leader_comp4_BS |  -4.329294   4.032618    -1.07   0.289    -12.46184    3.803255
           total_leaders |   1.406929   1.101603     1.28   0.208    -.8146641    3.628522
share_female_percent3_BS |   .1172943   .6806051     0.17   0.864    -1.255277    1.489865
                sequence |  -.1371573   .0920733    -1.49   0.144    -.3228408    .0485262
                   No_HH |  -.0004863   .0176794    -0.03   0.978    -.0361403    .0351676
                FES_site |  -3.890408   2.599634    -1.50   0.142     -9.13307    1.352253
        n_SHG_before2017 |  -.2049038   .2377252    -0.86   0.394    -.6843223    .2745148
                Shar_Lit |  -.3350764   .1309148    -2.56   0.014    -.5990912   -.0710616
               Shar_SCST |  -.0486005   .0713205    -0.68   0.499    -.1924321     .095231
            n_school_gov |  -.4011465   1.155193    -0.35   0.730    -2.730816    1.928523
                   _cons |   39.44042   10.99802     3.59   0.001     17.26081    61.62003
------------------------------------------------------------------------------------------

. eststo game6: reg game_discussed_formally leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $cont
> rols, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       3.54
                                                Prob > F          =     0.0011
                                                R-squared         =     0.2724
                                                Root MSE          =      .4841

------------------------------------------------------------------------------------------
                         |               Robust
 game_discussed_formally |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .1604066   .2375359     0.68   0.503    -.3189603    .6397735
         leader_comp3_BS |  -.2026523    .356507    -0.57   0.573    -.9221125    .5168079
         leader_comp4_BS |  -.0059132   .2642046    -0.02   0.982    -.5390996    .5272733
           total_leaders |   .1704323   .0798139     2.14   0.039     .0093613    .3315033
share_female_percent3_BS |   .0965491   .0376857     2.56   0.014     .0204963     .172602
                sequence |   .0024207   .0057323     0.42   0.675    -.0091476    .0139891
                   No_HH |   .0003273   .0009297     0.35   0.727    -.0015489    .0022034
                FES_site |   .0754192   .1810249     0.42   0.679    -.2899038    .4407421
        n_SHG_before2017 |   .0234396   .0158178     1.48   0.146     -.008482    .0553611
                Shar_Lit |  -.0047505   .0086746    -0.55   0.587    -.0222566    .0127555
               Shar_SCST |   .0033797   .0044632     0.76   0.453    -.0056274    .0123867
            n_school_gov |  -.0748738   .0817039    -0.92   0.365    -.2397588    .0900113
                   _cons |  -.3504544   .6796785    -0.52   0.609    -1.722101    1.021192
------------------------------------------------------------------------------------------

. *seems to be very similar across female (leader) participation, must be something happening afterwards to have real world impact
. 
. 
. esttab game1 game2 game3 game4 game5 game6 indirect total using "$working_ANALYSIS\results\tables\game_outcomes_leader_type.rtf", mtitles("Game
>  related discussions #" "Proposed rules #" "Cooperative outcome R9/10" "Praises #" "Formal discussions #") se transform(ln*: exp(@) exp(@))  b(
> %4.2f) label stats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nono
> tes addnotes("Notes: Estimates are from OLS regressions using regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0
> .01") replace 
estimation result indirect not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. 
. esttab game1 game2 game3 game4 game5 game6 using "$working_ANALYSIS\results\tables\game_outcomes_leader_type.rtf", mtitles("Game related discus
> sions #" "Proposed rules #" "Cooperative outcome R9/10" "Praises #" "Formal discussions #") se transform(ln*: exp(@) exp(@))  b(%4.2f) label st
> ats(N, labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("N
> otes: Estimates are from OLS regressions using regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\game_outcomes_leader_type.rtf not found)
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\game_outcomes_leader_type.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDec4_000000.tmp"

. eststo game1: reg game_total_gamerelated leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $contr
> ols, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.62
                                                Prob > F          =     0.0009
                                                R-squared         =     0.3597
                                                Root MSE          =     30.258

------------------------------------------------------------------------------------------
                         |               Robust
  game_total_gamerelated |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   3.275662   16.83499     0.19   0.847    -30.67534    37.22666
         leader_comp3_BS |  -7.803913   20.37417    -0.38   0.704    -48.89233    33.28451
         leader_comp4_BS |  -14.75956   16.70841    -0.88   0.382    -48.45527    18.93615
           total_leaders |   2.348928   4.667493     0.50   0.617    -7.063969    11.76183
share_female_percent3_BS |  -1.355771   3.001753    -0.45   0.654    -7.409383    4.697841
                sequence |  -.6922725    .453388    -1.53   0.134    -1.606617    .2220716
                   No_HH |   .0240194   .0766744     0.31   0.756    -.1306092     .178648
                FES_site |  -7.895827   11.96973    -0.66   0.513    -32.03509    16.24343
        n_SHG_before2017 |  -.6548856   .8939132    -0.73   0.468    -2.457633    1.147862
                Shar_Lit |  -1.311077   .7335689    -1.79   0.081     -2.79046    .1683058
               Shar_SCST |  -.4444745   .2880954    -1.54   0.130    -1.025474    .1365254
            n_school_gov |  -2.599257   4.950995    -0.52   0.602    -12.58389    7.385376
                   _cons |   239.4631     51.995     4.61   0.000     134.6052     344.321
------------------------------------------------------------------------------------------

. eststo game2: reg game_propose_rule leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, 
> r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       2.01
                                                Prob > F          =     0.0469
                                                R-squared         =     0.2330
                                                Root MSE          =     7.9155

------------------------------------------------------------------------------------------
                         |               Robust
       game_propose_rule |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.6116772   4.256758    -0.14   0.886    -9.196247    7.972893
         leader_comp3_BS |  -3.136622   5.454205    -0.58   0.568    -14.13608    7.862831
         leader_comp4_BS |  -2.453343   4.400707    -0.56   0.580    -11.32821    6.421528
           total_leaders |   1.147179   1.307325     0.88   0.385    -1.489293    3.783652
share_female_percent3_BS |  -.3028403   .6290878    -0.48   0.633    -1.571517    .9658362
                sequence |  -.0790601   .1164558    -0.68   0.501    -.3139155    .1557953
                   No_HH |  -.0001518   .0171283    -0.01   0.993    -.0346944    .0343907
                FES_site |  -1.671993   3.311915    -0.50   0.616    -8.351107    5.007121
        n_SHG_before2017 |  -.1103144   .2477705    -0.45   0.658    -.6099913    .3893625
                Shar_Lit |  -.3409096   .1961966    -1.74   0.089    -.7365777    .0547586
               Shar_SCST |   -.073983   .0704249    -1.05   0.299    -.2160084    .0680423
            n_school_gov |  -.6067748   1.237397    -0.49   0.626    -3.102224    1.888674
                   _cons |   56.89514   12.70897     4.48   0.000     31.26507    82.52522
------------------------------------------------------------------------------------------

. eststo game3: reg game_almost_opt_inv_r9_10 leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $co
> ntrols, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       1.01
                                                Prob > F          =     0.4542
                                                R-squared         =     0.2303
                                                Root MSE          =     .35035

------------------------------------------------------------------------------------------
                         |               Robust
game_almost_opt_inv_r9~0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .0777879   .1864789     0.42   0.679    -.2982826    .4538585
         leader_comp3_BS |   .1376535   .2822772     0.49   0.628    -.4316127    .7069198
         leader_comp4_BS |   .0763063   .2191669     0.35   0.729    -.3656858    .5182984
           total_leaders |  -.0246947   .0354073    -0.70   0.489    -.0961003     .046711
share_female_percent3_BS |    .016509   .0313102     0.53   0.601     -.046634     .079652
                sequence |  -.0065996   .0046136    -1.43   0.160    -.0159039    .0027047
                   No_HH |  -.0005681   .0007981    -0.71   0.480    -.0021775    .0010414
                FES_site |  -.1314508   .0955937    -1.38   0.176    -.3242339    .0613323
        n_SHG_before2017 |   .0128166   .0118751     1.08   0.286    -.0111318    .0367651
                Shar_Lit |   .0094901   .0069536     1.36   0.179    -.0045332    .0235134
               Shar_SCST |  -.0017542   .0026224    -0.67   0.507    -.0070428    .0035345
            n_school_gov |   .0079061   .0686399     0.12   0.909    -.1305195    .1463317
                   _cons |   .7083756   .4863959     1.46   0.153    -.2725352    1.689286
------------------------------------------------------------------------------------------

. eststo game4: reg game_praises leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $controls, r

Linear regression                               Number of obs     =         56
                                                F(12, 43)         =       3.27
                                                Prob > F          =     0.0021
                                                R-squared         =     0.3641
                                                Root MSE          =     7.0071

------------------------------------------------------------------------------------------
                         |               Robust
            game_praises |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |  -.1303568   3.411475    -0.04   0.970    -7.010252    6.749539
         leader_comp3_BS |  -5.442839   5.033157    -1.08   0.286    -15.59317     4.70749
         leader_comp4_BS |  -4.329294   4.032618    -1.07   0.289    -12.46184    3.803255
           total_leaders |   1.406929   1.101603     1.28   0.208    -.8146641    3.628522
share_female_percent3_BS |   .1172943   .6806051     0.17   0.864    -1.255277    1.489865
                sequence |  -.1371573   .0920733    -1.49   0.144    -.3228408    .0485262
                   No_HH |  -.0004863   .0176794    -0.03   0.978    -.0361403    .0351676
                FES_site |  -3.890408   2.599634    -1.50   0.142     -9.13307    1.352253
        n_SHG_before2017 |  -.2049038   .2377252    -0.86   0.394    -.6843223    .2745148
                Shar_Lit |  -.3350764   .1309148    -2.56   0.014    -.5990912   -.0710616
               Shar_SCST |  -.0486005   .0713205    -0.68   0.499    -.1924321     .095231
            n_school_gov |  -.4011465   1.155193    -0.35   0.730    -2.730816    1.928523
                   _cons |   39.44042   10.99802     3.59   0.001     17.26081    61.62003
------------------------------------------------------------------------------------------

. eststo game5: reg game_discussed_formally leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS sequence $cont
> rols, r

Linear regression                               Number of obs     =         55
                                                F(12, 42)         =       3.54
                                                Prob > F          =     0.0011
                                                R-squared         =     0.2724
                                                Root MSE          =      .4841

------------------------------------------------------------------------------------------
                         |               Robust
 game_discussed_formally |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
         leader_comp2_BS |   .1604066   .2375359     0.68   0.503    -.3189603    .6397735
         leader_comp3_BS |  -.2026523    .356507    -0.57   0.573    -.9221125    .5168079
         leader_comp4_BS |  -.0059132   .2642046    -0.02   0.982    -.5390996    .5272733
           total_leaders |   .1704323   .0798139     2.14   0.039     .0093613    .3315033
share_female_percent3_BS |   .0965491   .0376857     2.56   0.014     .0204963     .172602
                sequence |   .0024207   .0057323     0.42   0.675    -.0091476    .0139891
                   No_HH |   .0003273   .0009297     0.35   0.727    -.0015489    .0022034
                FES_site |   .0754192   .1810249     0.42   0.679    -.2899038    .4407421
        n_SHG_before2017 |   .0234396   .0158178     1.48   0.146     -.008482    .0553611
                Shar_Lit |  -.0047505   .0086746    -0.55   0.587    -.0222566    .0127555
               Shar_SCST |   .0033797   .0044632     0.76   0.453    -.0056274    .0123867
            n_school_gov |  -.0748738   .0817039    -0.92   0.365    -.2397588    .0900113
                   _cons |  -.3504544   .6796785    -0.52   0.609    -1.722101    1.021192
------------------------------------------------------------------------------------------

. *seems to be very similar across female (leader) participation, must be something happening afterwards to have real world impact
. 
. 
. esttab game1 game2 game3 game4 game5 using "$working_ANALYSIS\results\tables\game_outcomes_leader_type.rtf", mtitles("Game related discussions 
> #" "Proposed rules #" "Cooperative outcome R9/10" "Praises #" "Formal discussions #") se transform(ln*: exp(@) exp(@))  b(%4.2f) label stats(N,
>  labels("N") fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: 
> Estimates are from OLS regressions using regressions with robust standard errors in brackets. * p<0.10, ** p<0.05, *** p<0.01") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\tables\game_outcomes_leader_type.rtf)

. 
end of do-file

. exit, clear
