-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2025.05.07-15.24.50.log.txt
  log type:  text
 opened on:   7 May 2025, 15:24:50

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  7 May 2025 15:24:50

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;
> lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace-desktop-r4995g6;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50
> " reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. 
. * Table S9.     Maintenance treatment effect
. preserve

. clear 

. use "$working_ANALYSIS/processed/games_clean.dta", clear

. *----------------------------------------------------------------------
. *drop variables with all missings and generate some additional variabels and labels
. global village No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)
variable n_SHG_before2017 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
end of do-file

. tab SHG_before2017

SHG_before2 |
        017 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       10.17       10.17
          1 |         53       89.83      100.00
------------+-----------------------------------
      Total |         59      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. global village No_HH FES_site SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 4 obs not used

note: treatment_BS omitted because of collinearity
Iteration 0:   log pseudolikelihood = -32.096572  
Iteration 1:   log pseudolikelihood = -28.674071  
Iteration 2:   log pseudolikelihood = -28.655579  
Iteration 3:   log pseudolikelihood = -28.655578  

Probit regression                               Number of obs     =         52
                                                Wald chi2(7)      =       6.60
                                                Prob > chi2       =     0.4719
Log pseudolikelihood = -28.655578               Pseudo R2         =     0.1072

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |          0  (omitted)
 survey_maint_12m_BS |   .4291263   .4250879     1.01   0.313    -.4040306    1.262283
               No_HH |   .0004542   .0024932     0.18   0.855    -.0044324    .0053408
            FES_site |   .6842641   .4831972     1.42   0.157    -.2627849    1.631313
      SHG_before2017 |  -.5419343   .6667906    -0.81   0.416     -1.84882    .7649513
     d_public_school |   .2494851   .7732921     0.32   0.747    -1.266139     1.76511
    d_private_school |          0  (omitted)
            Shar_Lit |   .0283694   .0267335     1.06   0.289    -.0240274    .0807661
           Shar_SCST |  -.0077219   .0111473    -0.69   0.488    -.0295703    .0141264
               _cons |    -.83158   2.359824    -0.35   0.725    -5.456751    3.793591
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         52
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |          0  (omitted)
survey_maint_12m_BS |   .1338711   .1284344     1.04   0.297    -.1178556    .3855979
              No_HH |   .0001417   .0007781     0.18   0.855    -.0013833    .0016667
           FES_site |   .2134644    .141842     1.50   0.132    -.0645408    .4914696
     SHG_before2017 |  -.1690629   .2074389    -0.82   0.415    -.5756356    .2375099
    d_public_school |   .0778299   .2397786     0.32   0.745    -.3921275    .5477872
   d_private_school |          0  (omitted)
           Shar_Lit |   .0088502   .0079934     1.11   0.268    -.0068165    .0245169
          Shar_SCST |   -.002409    .003443    -0.70   0.484    -.0091572    .0043393
-------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .10720751

. 
end of do-file

. tab no_school

  no_school |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       86.21       86.21
          1 |         12       13.79      100.00
------------+-----------------------------------
      Total |         87      100.00

. tab d_public_school

d_public_sc |
       hool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13       14.94       14.94
          1 |         74       85.06      100.00
------------+-----------------------------------
      Total |         87      100.00

. tab d_private_school

d_private_s |
      chool |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80       91.95       91.95
          1 |          7        8.05      100.00
------------+-----------------------------------
      Total |         87      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS SHG_before2017 d_public_school

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

note: treatment_BS omitted because of collinearity
Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -29.995038  
Iteration 2:   log pseudolikelihood = -29.962718  
Iteration 3:   log pseudolikelihood = -29.962705  
Iteration 4:   log pseudolikelihood = -29.962705  

Probit regression                               Number of obs     =         56
                                                Wald chi2(8)      =       5.12
                                                Prob > chi2       =     0.7442
Log pseudolikelihood = -29.962705               Pseudo R2         =     0.1057

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |          0  (omitted)
         survey_maint_12m_BS |   .3043864   .4026615     0.76   0.450    -.4848156    1.093588
                       No_HH |   .0000627   .0023546     0.03   0.979    -.0045523    .0046777
                    FES_site |    .605518   .4701489     1.29   0.198    -.3159568    1.526993
                    Shar_Lit |   .0329482   .0280966     1.17   0.241    -.0221202    .0880166
                   Shar_SCST |  -.0077138   .0110607    -0.70   0.486    -.0293924    .0139647
survey_dam_for_irrigation_FS |   .3820052   .4039343     0.95   0.344    -.4096915    1.173702
              SHG_before2017 |  -.4310083   .6828067    -0.63   0.528    -1.769285    .9072682
             d_public_school |   .4189753   .7926587     0.53   0.597    -1.134607    1.972558
                       _cons |  -1.207861   2.518445    -0.48   0.632    -6.143922    3.728199
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS SHG_before2017 d_public_school

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |          0  (omitted)
         survey_maint_12m_BS |   .0929983   .1199586     0.78   0.438    -.1421162    .3281128
                       No_HH |   .0000191   .0007196     0.03   0.979    -.0013913    .0014296
                    FES_site |   .1850022   .1360361     1.36   0.174    -.0816236    .4516281
                    Shar_Lit |   .0100666   .0080453     1.25   0.211    -.0057019     .025835
                   Shar_SCST |  -.0023568   .0033452    -0.70   0.481    -.0089132    .0041996
survey_dam_for_irrigation_FS |    .116713   .1192182     0.98   0.328    -.1169504    .3503764
              SHG_before2017 |  -.1316848   .2083137    -0.63   0.527    -.5399721    .2766025
             d_public_school |   .1280084   .2371195     0.54   0.589    -.3367374    .5927541
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .10567356

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS SHG_before2017 

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

note: treatment_BS omitted because of collinearity
Iteration 0:   log pseudolikelihood = -33.503097  
Iteration 1:   log pseudolikelihood = -30.117609  
Iteration 2:   log pseudolikelihood = -30.084588  
Iteration 3:   log pseudolikelihood = -30.084574  
Iteration 4:   log pseudolikelihood = -30.084574  

Probit regression                               Number of obs     =         56
                                                Wald chi2(7)      =       5.29
                                                Prob > chi2       =     0.6245
Log pseudolikelihood = -30.084574               Pseudo R2         =     0.1020

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |          0  (omitted)
         survey_maint_12m_BS |    .266112   .3899977     0.68   0.495    -.4982694    1.030493
                       No_HH |   .0002686   .0023198     0.12   0.908    -.0042781    .0048153
                    FES_site |   .5807308   .4594889     1.26   0.206    -.3198509    1.481313
                    Shar_Lit |   .0302399   .0260193     1.16   0.245    -.0207569    .0812367
                   Shar_SCST |  -.0085252   .0112442    -0.76   0.448    -.0305634     .013513
survey_dam_for_irrigation_FS |    .365872   .3890784     0.94   0.347    -.3967077    1.128452
              SHG_before2017 |  -.3954276   .6794813    -0.58   0.561    -1.727186    .9363313
                       _cons |  -.6386229   2.167528    -0.29   0.768    -4.886899    3.609653
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         56
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS SHG_before2017

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |          0  (omitted)
         survey_maint_12m_BS |   .0813115   .1170702     0.69   0.487    -.1481419    .3107649
                       No_HH |   .0000821   .0007092     0.12   0.908    -.0013079    .0014721
                    FES_site |   .1774445   .1339748     1.32   0.185    -.0851414    .4400303
                    Shar_Lit |   .0092399   .0075234     1.23   0.219    -.0055056    .0239854
                   Shar_SCST |  -.0026049   .0033919    -0.77   0.442    -.0092528     .004043
survey_dam_for_irrigation_FS |   .1117935   .1156995     0.97   0.334    -.1149732    .3385603
              SHG_before2017 |  -.1208244   .2077937    -0.58   0.561    -.5280925    .2864438
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .10203604

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. *drop variables with all missings and generate some additional variabels and labels
. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS  

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .199991   .0980867     2.04   0.041     .0077446    .3922375
         survey_maint_12m_BS |   .1937148   .0940361     2.06   0.039     .0094075    .3780222
                       No_HH |   -.000358   .0004645    -0.77   0.441    -.0012685    .0005525
                    FES_site |   .0200957   .1104538     0.18   0.856    -.1963897    .2365811
                    Shar_Lit |   .0056405    .006322     0.89   0.372    -.0067504    .0180314
                   Shar_SCST |  -.0051376   .0027227    -1.89   0.059     -.010474    .0001988
survey_dam_for_irrigation_FS |   .0383799   .1037738     0.37   0.712     -.165013    .2417728
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11851538

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. 
. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. drop if treatment==0
(28 observations deleted)

. *define program to export direct, indirect and total effects
. capture program drop te_direct

. program te_direct, eclass
  1.     quietly estat teffects
  2.     mat b = r(direct)
  3.     mat V = r(V_direct)
  4.     local N = e(N)
  5.     ereturn post b V, obs(`N')
  6.     ereturn local cmd te_direct 
  7. end

. 
. capture program drop te_indirect

. program te_indirect, eclass
  1.     quietly estat teffects
  2.     mat b = r(indirect)
  3.     mat V = r(V_indirect)
  4.     ereturn post b V
  5.     ereturn local cmd te_indirect 
  6. end

. 
. capture program drop te_total

. program te_total, eclass
  1.     quietly estat teffects
  2.     mat b = r(total)
  3.     mat V = r(V_total)
  4.     ereturn post b V
  5.     ereturn local cmd te_total 
  6. end

. 
. 
. 
. 
. 
. 
. *-----------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *-----------------------------------------
. 
. 
. *figure 1, panel A: main treatment effect
. preserve

. clear 

. use "$working_ANALYSIS/processed/games_clean.dta", clear

. *----------------------------------------------------------------------
. *drop variables with all missings and generate some additional variabels and labels
. global village  No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS  

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

Iteration 0:   log pseudolikelihood = -54.302378  
Iteration 1:   log pseudolikelihood = -47.880411  
Iteration 2:   log pseudolikelihood = -47.866711  
Iteration 3:   log pseudolikelihood = -47.866711  

Probit regression                               Number of obs     =         83
                                                Wald chi2(7)      =      11.74
                                                Prob > chi2       =     0.1093
Log pseudolikelihood = -47.866711               Pseudo R2         =     0.1185

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6096168   .3196498     1.91   0.057    -.0168852    1.236119
         survey_maint_12m_BS |   .5904856   .3089218     1.91   0.056    -.0149901    1.195961
                       No_HH |  -.0010913   .0014365    -0.76   0.447    -.0039068    .0017241
                    FES_site |   .0612562   .3369852     0.18   0.856    -.5992227    .7217351
                    Shar_Lit |   .0171936   .0195623     0.88   0.379    -.0211478     .055535
                   Shar_SCST |  -.0156605    .008745    -1.79   0.073    -.0328004    .0014793
survey_dam_for_irrigation_FS |   .1169904   .3172275     0.37   0.712     -.504764    .7387448
                       _cons |   .1184325   1.425989     0.08   0.934    -2.676455     2.91332
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         83
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site Shar_Lit Shar_SCST survey_dam_for_irrigation_FS

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |    .199991   .0980867     2.04   0.041     .0077446    .3922375
         survey_maint_12m_BS |   .1937148   .0940361     2.06   0.039     .0094075    .3780222
                       No_HH |   -.000358   .0004645    -0.77   0.441    -.0012685    .0005525
                    FES_site |   .0200957   .1104538     0.18   0.856    -.1963897    .2365811
                    Shar_Lit |   .0056405    .006322     0.89   0.372    -.0067504    .0180314
                   Shar_SCST |  -.0051376   .0027227    -1.89   0.059     -.010474    .0001988
survey_dam_for_irrigation_FS |   .0383799   .1037738     0.37   0.712     -.165013    .2417728
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .11851538

. 
. * Table S9.     Maintenance treatment effect
. esttab treatment1 treatment2 using "$working_ANALYSIS\results\Tables\tableS9_treatment_effects.rtf", ci transform(ln*: exp(@) exp(@))mtitles("D
> am maintenance (=1)" "" "Dam rule exists (=1)" "") b(%4.2f)label stats(N r2_p, labels("N" "Pseudo R2" ) fmt(%4.0f %4.2f)) star(* 0.10 ** 0.05 *
> ** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}"))  nonotes addnotes("Notes: Estimates are from OLS regressions with robust stand
> ard errors. Omitted category is ‘village villages’. 95% confidence intervals in brackets. * p<0.05, ** p<0.01, *** p<0.001") replace 
(output written to D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\Tables\tableS9_treatment_effects.rtf)

. restore

. 
. 
. *Figure 1: How women’s participation in games influenced sustainable water management. 
. 
. 
. 
. * created with open-source software (draw.io) based on the SEM analysis below
. * Setting globals
. 
. winsor2 n_SHG_before2017, cuts(0 95) replace

. winsor2 n_SHG_after2017, cuts(0 95) replace

. 
. *Globals
. global village No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

. 
. 
. 
. *Table S7: SEM main result output
. sem ($village sequence-> leader_comp1_BS ) ($village  sequence-> leader_comp2_BS ) ($village  sequence-> leader_comp3_BS ) ($village  sequence-
> > leader_comp4_BS ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS total_leaders $village  sequence -> share_female_percent3_BS , )  (leader_
> comp2_BS leader_comp3_BS leader_comp4_BS total_leaders share_female_percent3_BS survey_maint_rule_BS $village  survey_dam_for_irrigation_FS seq
> uence -> survey_maint_rule_FS, ) (leader_comp2_BS leader_comp3_BS leader_comp4_BS  total_leaders share_female_percent3_BS survey_maint_12m_BS s
> urvey_maint_rule_FS $village  survey_dam_for_irrigation_FS sequence -> survey_maint_2017_FS , ), vce(robust) nocapslatent
(104 observations with missing values excluded)

Endogenous variables

Observed:  leader_comp1_BS leader_comp2_BS leader_comp3_BS leader_comp4_BS share_female_percent3_BS survey_maint_rule_FS survey_maint_2017_FS

Exogenous variables

Observed:  No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST sequence total_leaders survey_maint_rule_BS
           survey_dam_for_irrigation_FS survey_maint_12m_BS

Fitting target model:

Iteration 0:   log pseudolikelihood = -1580.2579  
Iteration 1:   log pseudolikelihood = -1580.2579  

Structural equation model                       Number of obs     =         56
Estimation method    = ml
Log pseudolikelihood = -1580.2579

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0002953   .0006104     0.48   0.629    -.0009011    .0014917
                      FES_site |  -.2014033   .1148538    -1.75   0.080    -.4265126     .023706
              n_SHG_before2017 |  -.0349646   .0099927    -3.50   0.000    -.0545498   -.0153793
               d_public_school |  -.0264227     .06815    -0.39   0.698    -.1599941    .1071488
              d_private_school |   .2042838   .1702281     1.20   0.230    -.1293571    .5379247
                      Shar_Lit |  -.0098871   .0043244    -2.29   0.022    -.0183627   -.0014115
                     Shar_SCST |  -.0024116   .0023249    -1.04   0.300    -.0069682    .0021451
                      sequence |   .0103599   .0025695     4.03   0.000     .0053238    .0153961
                         _cons |   .8948039   .3759901     2.38   0.017     .1578769    1.631731
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   -.000335   .0008503    -0.39   0.694    -.0020016    .0013316
                      FES_site |   .1608249   .1467883     1.10   0.273    -.1268748    .4485247
              n_SHG_before2017 |   .0208682   .0139809     1.49   0.136     -.006534    .0482703
               d_public_school |  -.3374021    .132303    -2.55   0.011    -.5967111    -.078093
              d_private_school |  -.3111274   .2454104    -1.27   0.205    -.7921228    .1698681
                      Shar_Lit |   .0027201   .0082415     0.33   0.741     -.013433    .0188731
                     Shar_SCST |   .0028147    .003868     0.73   0.467    -.0047664    .0103958
                      sequence |  -.0096717   .0039832    -2.43   0.015    -.0174785   -.0018649
                         _cons |   .5384011   .6823571     0.79   0.430    -.7989943    1.875796
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0011587   .0004822    -2.40   0.016    -.0021039   -.0002136
                      FES_site |   .1364592   .0762755     1.79   0.074    -.0130381    .2859565
              n_SHG_before2017 |   .0123828   .0073136     1.69   0.090    -.0019516    .0267171
               d_public_school |   .2335261   .0996146     2.34   0.019      .038285    .4287672
              d_private_school |   .0751661   .1486878     0.51   0.613    -.2162568    .3665889
                      Shar_Lit |   .0010649   .0055198     0.19   0.847    -.0097537    .0118834
                     Shar_SCST |  -.0053542   .0033952    -1.58   0.115    -.0120087    .0013002
                      sequence |  -.0030425    .003363    -0.90   0.366    -.0096339    .0035489
                         _cons |   .3855958     .51034     0.76   0.450    -.6146522    1.385844
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0011984   .0008606     1.39   0.164    -.0004884    .0028852
                      FES_site |  -.0958808   .1561187    -0.61   0.539     -.401868    .2101063
              n_SHG_before2017 |   .0017136   .0153648     0.11   0.911    -.0284009    .0318282
               d_public_school |   .1302987   .1138606     1.14   0.252     -.092864    .3534613
              d_private_school |   .0316775   .2222321     0.14   0.887    -.4038894    .4672444
                      Shar_Lit |   .0061022   .0078719     0.78   0.438    -.0093264    .0215308
                     Shar_SCST |    .004951   .0032245     1.54   0.125    -.0013689     .011271
                      sequence |   .0023543   .0031492     0.75   0.455     -.003818    .0085266
                         _cons |  -.8188008   .6291308    -1.30   0.193    -2.051875    .4142729
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .9183725    .724062     1.27   0.205    -.5007629    2.337508
               leader_comp3_BS |   1.069118   .8711123     1.23   0.220     -.638231    2.776466
               leader_comp4_BS |   2.072379   .8144054     2.54   0.011     .4761735    3.668584
                         No_HH |   .0003344   .0025382     0.13   0.895    -.0046404    .0053092
                      FES_site |  -.2931013   .4936896    -0.59   0.553    -1.260715    .6745125
              n_SHG_before2017 |  -.0780455   .0400542    -1.95   0.051    -.1565502    .0004592
               d_public_school |   .1960433   .5838913     0.34   0.737    -.9483626    1.340449
              d_private_school |   1.011476    .646586     1.56   0.118    -.2558091    2.278762
                      Shar_Lit |   .0330156   .0298255     1.11   0.268    -.0254414    .0914726
                     Shar_SCST |  -.0019659   .0162501    -0.12   0.904    -.0338155    .0298836
                      sequence |   .0371809   .0164165     2.26   0.024     .0050051    .0693567
                 total_leaders |  -.3931455   .1768062    -2.22   0.026    -.7396792   -.0466118
                         _cons |   -.154204   2.461094    -0.06   0.950     -4.97786    4.669452
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0303792   .1857978     0.16   0.870    -.3337777    .3945361
               leader_comp3_BS |  -.1085158   .3043598    -0.36   0.721      -.70505    .4880184
               leader_comp4_BS |  -.0855346   .1620252    -0.53   0.598    -.4030981    .2320289
      share_female_percent3_BS |   .1443733    .029364     4.92   0.000     .0868209    .2019257
                         No_HH |  -.0016447   .0007498    -2.19   0.028    -.0031143   -.0001752
                      FES_site |   .2887691   .1116821     2.59   0.010     .0698763     .507662
              n_SHG_before2017 |   .0390713   .0125099     3.12   0.002     .0145523    .0635903
               d_public_school |   .0842449   .2730966     0.31   0.758    -.4510147    .6195044
              d_private_school |  -.1531315   .1976901    -0.77   0.439    -.5405969    .2343339
                      Shar_Lit |  -.0023803   .0064019    -0.37   0.710    -.0149277    .0101672
                     Shar_SCST |  -.0025106   .0032318    -0.78   0.437    -.0088448    .0038235
                      sequence |  -.0061227   .0058925    -1.04   0.299    -.0176717    .0054264
                 total_leaders |   .0254417    .056759     0.45   0.654    -.0858038    .1366873
          survey_maint_rule_BS |  -.0906574   .1804618    -0.50   0.615     -.444356    .2630412
  survey_dam_for_irrigation_FS |  -.2293843   .1161461    -1.97   0.048    -.4570264   -.0017422
                         _cons |   .2934175   .5175376     0.57   0.571    -.7209375    1.307773
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0221137   .1936866     0.11   0.909     -.357505    .4017323
               leader_comp3_BS |   .4305975   .2660371     1.62   0.106    -.0908256    .9520206
               leader_comp4_BS |   -.211242   .1803166    -1.17   0.241    -.5646561    .1421721
      share_female_percent3_BS |  -.0002829   .0355683    -0.01   0.994    -.0699954    .0694297
          survey_maint_rule_FS |   .3586076   .1124936     3.19   0.001     .1381243     .579091
                         No_HH |   .0010017   .0006999     1.43   0.152    -.0003701    .0023735
                      FES_site |   .0605289   .1365673     0.44   0.658    -.2071382    .3281959
              n_SHG_before2017 |  -.0082479   .0124672    -0.66   0.508    -.0326832    .0161874
               d_public_school |  -.0999194   .2031432    -0.49   0.623    -.4980727     .298234
              d_private_school |   .3968493   .1926536     2.06   0.039     .0192553    .7744433
                      Shar_Lit |   .0117957   .0069047     1.71   0.088    -.0017372    .0253286
                     Shar_SCST |   -.000028   .0033446    -0.01   0.993    -.0065833    .0065274
                      sequence |   .0085821   .0045361     1.89   0.058    -.0003085    .0174726
                 total_leaders |  -.0592183   .0613268    -0.97   0.334    -.1794166    .0609799
  survey_dam_for_irrigation_FS |   .3279836   .1176865     2.79   0.005     .0973222     .558645
           survey_maint_12m_BS |  -.0716056   .1293043    -0.55   0.580    -.3250374    .1818263
                         _cons |   -.370877   .5742241    -0.65   0.518    -1.496336    .7545815
-------------------------------+----------------------------------------------------------------
         var(e.leader_comp1_BS)|   .0813852   .0160324                      .0553176    .1197366
         var(e.leader_comp2_BS)|   .1943461    .021082                      .1571233    .2403871
         var(e.leader_comp3_BS)|    .101374   .0256137                      .0617813    .1663398
         var(e.leader_comp4_BS)|   .1415566   .0250254                      .1001033     .200176
var(e.share_female_percent3_BS)|   1.738346   .4343546                      1.065244    2.836763
    var(e.survey_maint_rule_FS)|   .1393357   .0206197                       .104255    .1862207
    var(e.survey_maint_2017_FS)|    .126043   .0188817                      .0939736    .1690563
------------------------------------------------------------------------------------------------

. 
. eststo SEM

. estat teffects


Direct effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0002953   .0006104     0.48   0.629    -.0009011    .0014917
                      FES_site |  -.2014033   .1148538    -1.75   0.080    -.4265126     .023706
              n_SHG_before2017 |  -.0349646   .0099927    -3.50   0.000    -.0545498   -.0153793
               d_public_school |  -.0264227     .06815    -0.39   0.698    -.1599941    .1071488
              d_private_school |   .2042838   .1702281     1.20   0.230    -.1293571    .5379247
                      Shar_Lit |  -.0098871   .0043244    -2.29   0.022    -.0183627   -.0014115
                     Shar_SCST |  -.0024116   .0023249    -1.04   0.300    -.0069682    .0021451
                      sequence |   .0103599   .0025695     4.03   0.000     .0053238    .0153961
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   -.000335   .0008503    -0.39   0.694    -.0020016    .0013316
                      FES_site |   .1608249   .1467883     1.10   0.273    -.1268748    .4485247
              n_SHG_before2017 |   .0208682   .0139809     1.49   0.136     -.006534    .0482703
               d_public_school |  -.3374021    .132303    -2.55   0.011    -.5967111    -.078093
              d_private_school |  -.3111274   .2454104    -1.27   0.205    -.7921228    .1698681
                      Shar_Lit |   .0027201   .0082415     0.33   0.741     -.013433    .0188731
                     Shar_SCST |   .0028147    .003868     0.73   0.467    -.0047664    .0103958
                      sequence |  -.0096717   .0039832    -2.43   0.015    -.0174785   -.0018649
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0011587   .0004822    -2.40   0.016    -.0021039   -.0002136
                      FES_site |   .1364592   .0762755     1.79   0.074    -.0130381    .2859565
              n_SHG_before2017 |   .0123828   .0073136     1.69   0.090    -.0019516    .0267171
               d_public_school |   .2335261   .0996146     2.34   0.019      .038285    .4287672
              d_private_school |   .0751661   .1486878     0.51   0.613    -.2162568    .3665889
                      Shar_Lit |   .0010649   .0055198     0.19   0.847    -.0097537    .0118834
                     Shar_SCST |  -.0053542   .0033952    -1.58   0.115    -.0120087    .0013002
                      sequence |  -.0030425    .003363    -0.90   0.366    -.0096339    .0035489
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0011984   .0008606     1.39   0.164    -.0004884    .0028852
                      FES_site |  -.0958808   .1561187    -0.61   0.539     -.401868    .2101063
              n_SHG_before2017 |   .0017136   .0153648     0.11   0.911    -.0284009    .0318282
               d_public_school |   .1302987   .1138606     1.14   0.252     -.092864    .3534613
              d_private_school |   .0316775   .2222321     0.14   0.887    -.4038894    .4672444
                      Shar_Lit |   .0061022   .0078719     0.78   0.438    -.0093264    .0215308
                     Shar_SCST |    .004951   .0032245     1.54   0.125    -.0013689     .011271
                      sequence |   .0023543   .0031492     0.75   0.455     -.003818    .0085266
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .9183725    .724062     1.27   0.205    -.5007629    2.337508
               leader_comp3_BS |   1.069118   .8711123     1.23   0.220     -.638231    2.776466
               leader_comp4_BS |   2.072379   .8144054     2.54   0.011     .4761735    3.668584
                         No_HH |   .0003344   .0025382     0.13   0.895    -.0046404    .0053092
                      FES_site |  -.2931013   .4936896    -0.59   0.553    -1.260715    .6745125
              n_SHG_before2017 |  -.0780455   .0400542    -1.95   0.051    -.1565502    .0004592
               d_public_school |   .1960433   .5838913     0.34   0.737    -.9483626    1.340449
              d_private_school |   1.011476    .646586     1.56   0.118    -.2558091    2.278762
                      Shar_Lit |   .0330156   .0298255     1.11   0.268    -.0254414    .0914726
                     Shar_SCST |  -.0019659   .0162501    -0.12   0.904    -.0338155    .0298836
                      sequence |   .0371809   .0164165     2.26   0.024     .0050051    .0693567
                 total_leaders |  -.3931455   .1768062    -2.22   0.026    -.7396792   -.0466118
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .0303792   .1857978     0.16   0.870    -.3337777    .3945361
               leader_comp3_BS |  -.1085158   .3043598    -0.36   0.721      -.70505    .4880184
               leader_comp4_BS |  -.0855346   .1620252    -0.53   0.598    -.4030981    .2320289
      share_female_percent3_BS |   .1443733    .029364     4.92   0.000     .0868209    .2019257
                         No_HH |  -.0016447   .0007498    -2.19   0.028    -.0031143   -.0001752
                      FES_site |   .2887691   .1116821     2.59   0.010     .0698763     .507662
              n_SHG_before2017 |   .0390713   .0125099     3.12   0.002     .0145523    .0635903
               d_public_school |   .0842449   .2730966     0.31   0.758    -.4510147    .6195044
              d_private_school |  -.1531315   .1976901    -0.77   0.439    -.5405969    .2343339
                      Shar_Lit |  -.0023803   .0064019    -0.37   0.710    -.0149277    .0101672
                     Shar_SCST |  -.0025106   .0032318    -0.78   0.437    -.0088448    .0038235
                      sequence |  -.0061227   .0058925    -1.04   0.299    -.0176717    .0054264
                 total_leaders |   .0254417    .056759     0.45   0.654    -.0858038    .1366873
          survey_maint_rule_BS |  -.0906574   .1804618    -0.50   0.615     -.444356    .2630412
  survey_dam_for_irrigation_FS |  -.2293843   .1161461    -1.97   0.048    -.4570264   -.0017422
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0221137   .1936866     0.11   0.909     -.357505    .4017323
               leader_comp3_BS |   .4305975   .2660371     1.62   0.106    -.0908256    .9520206
               leader_comp4_BS |   -.211242   .1803166    -1.17   0.241    -.5646561    .1421721
      share_female_percent3_BS |  -.0002829   .0355683    -0.01   0.994    -.0699954    .0694297
          survey_maint_rule_FS |   .3586076   .1124936     3.19   0.001     .1381243     .579091
                         No_HH |   .0010017   .0006999     1.43   0.152    -.0003701    .0023735
                      FES_site |   .0605289   .1365673     0.44   0.658    -.2071382    .3281959
              n_SHG_before2017 |  -.0082479   .0124672    -0.66   0.508    -.0326832    .0161874
               d_public_school |  -.0999194   .2031432    -0.49   0.623    -.4980727     .298234
              d_private_school |   .3968493   .1926536     2.06   0.039     .0192553    .7744433
                      Shar_Lit |   .0117957   .0069047     1.71   0.088    -.0017372    .0253286
                     Shar_SCST |   -.000028   .0033446    -0.01   0.993    -.0065833    .0065274
                      sequence |   .0085821   .0045361     1.89   0.058    -.0003085    .0174726
                 total_leaders |  -.0592183   .0613268    -0.97   0.334    -.1794166    .0609799
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |   .3279836   .1176865     2.79   0.005     .0973222     .558645
           survey_maint_12m_BS |  -.0716056   .1293043    -0.55   0.580    -.3250374    .1818263
------------------------------------------------------------------------------------------------


Indirect effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
               d_public_school |          0  (no path)
              d_private_school |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
               d_public_school |          0  (no path)
              d_private_school |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
               d_public_school |          0  (no path)
              d_private_school |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |          0  (no path)
                      FES_site |          0  (no path)
              n_SHG_before2017 |          0  (no path)
               d_public_school |          0  (no path)
              d_private_school |          0  (no path)
                      Shar_Lit |          0  (no path)
                     Shar_SCST |          0  (no path)
                      sequence |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |          0  (no path)
               leader_comp3_BS |          0  (no path)
               leader_comp4_BS |          0  (no path)
                         No_HH |   .0009371   .0016434     0.57   0.569    -.0022839    .0041581
                      FES_site |   .0948867   .2956652     0.32   0.748    -.4846064    .6743798
              n_SHG_before2017 |   .0359547   .0390835     0.92   0.358    -.0406475    .1125569
               d_public_school |   .2098342   .2008625     1.04   0.296     -.183849    .6035174
              d_private_school |  -.1397217    .396394    -0.35   0.724    -.9166395    .6371962
                      Shar_Lit |   .0162826    .014837     1.10   0.272    -.0127974    .0453625
                     Shar_SCST |   .0071211   .0061892     1.15   0.250    -.0050095    .0192517
                      sequence |  -.0072561   .0085375    -0.85   0.395    -.0239893    .0094771
                 total_leaders |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1325885   .1057685     1.25   0.210     -.074714     .339891
               leader_comp3_BS |    .154352   .1223346     1.26   0.207    -.0854194    .3941235
               leader_comp4_BS |   .2991961   .1303122     2.30   0.022     .0437889    .5546033
      share_female_percent3_BS |          0  (no path)
                         No_HH |   .0001966   .0005292     0.37   0.710    -.0008406    .0012339
                      FES_site |   -.030338   .0902814    -0.34   0.737    -.2072863    .1466102
              n_SHG_before2017 |  -.0069331   .0100912    -0.69   0.492    -.0267115    .0128452
               d_public_school |   .0118616   .1103388     0.11   0.914    -.2043985    .2281217
              d_private_school |   .1055401   .1064282     0.99   0.321    -.1030554    .3141355
                      Shar_Lit |   .0065625   .0050816     1.29   0.197    -.0033974    .0165223
                     Shar_SCST |   .0009873   .0028574     0.35   0.730     -.004613    .0065877
                      sequence |   .0041553   .0034981     1.19   0.235    -.0027008    .0110114
                 total_leaders |  -.0567597     .02694    -2.11   0.035    -.1095612   -.0039582
          survey_maint_rule_BS |          0  (no path)
  survey_dam_for_irrigation_FS |          0  (no path)
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0581816    .072466     0.80   0.422    -.0838492    .2002124
               leader_comp3_BS |   .0161348   .1121169     0.14   0.886    -.2036103    .2358799
               leader_comp4_BS |   .0760344   .0879037     0.86   0.387    -.0962536    .2483224
      share_female_percent3_BS |   .0517734   .0193352     2.68   0.007      .013877    .0896697
          survey_maint_rule_FS |          0  (no path)
                         No_HH |  -.0012792   .0005405    -2.37   0.018    -.0023385   -.0002199
                      FES_site |   .1753009   .0981638     1.79   0.074    -.0170966    .3676985
              n_SHG_before2017 |   .0169684   .0114547     1.48   0.139    -.0054825    .0394192
               d_public_school |   .0999197    .138444     0.72   0.470    -.1714255    .3712649
              d_private_school |   .0014813   .1226451     0.01   0.990    -.2388987    .2418612
                      Shar_Lit |   .0007155   .0040168     0.18   0.859    -.0071574    .0085883
                     Shar_SCST |  -.0038369   .0026378    -1.45   0.146    -.0090069    .0013331
                      sequence |  -.0027353   .0039876    -0.69   0.493    -.0105508    .0050803
                 total_leaders |  -.0111197   .0250803    -0.44   0.658    -.0602762    .0380369
          survey_maint_rule_BS |  -.0325104   .0664212    -0.49   0.625    -.1626936    .0976727
  survey_dam_for_irrigation_FS |   -.082259   .0455512    -1.81   0.071    -.1715376    .0070197
           survey_maint_12m_BS |          0  (no path)
------------------------------------------------------------------------------------------------


Total effects
------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
Structural                     |
  leader_comp1_BS              |
                         No_HH |   .0002953   .0006104     0.48   0.629    -.0009011    .0014917
                      FES_site |  -.2014033   .1148538    -1.75   0.080    -.4265126     .023706
              n_SHG_before2017 |  -.0349646   .0099927    -3.50   0.000    -.0545498   -.0153793
               d_public_school |  -.0264227     .06815    -0.39   0.698    -.1599941    .1071488
              d_private_school |   .2042838   .1702281     1.20   0.230    -.1293571    .5379247
                      Shar_Lit |  -.0098871   .0043244    -2.29   0.022    -.0183627   -.0014115
                     Shar_SCST |  -.0024116   .0023249    -1.04   0.300    -.0069682    .0021451
                      sequence |   .0103599   .0025695     4.03   0.000     .0053238    .0153961
  -----------------------------+----------------------------------------------------------------
  leader_comp2_BS              |
                         No_HH |   -.000335   .0008503    -0.39   0.694    -.0020016    .0013316
                      FES_site |   .1608249   .1467883     1.10   0.273    -.1268748    .4485247
              n_SHG_before2017 |   .0208682   .0139809     1.49   0.136     -.006534    .0482703
               d_public_school |  -.3374021    .132303    -2.55   0.011    -.5967111    -.078093
              d_private_school |  -.3111274   .2454104    -1.27   0.205    -.7921228    .1698681
                      Shar_Lit |   .0027201   .0082415     0.33   0.741     -.013433    .0188731
                     Shar_SCST |   .0028147    .003868     0.73   0.467    -.0047664    .0103958
                      sequence |  -.0096717   .0039832    -2.43   0.015    -.0174785   -.0018649
  -----------------------------+----------------------------------------------------------------
  leader_comp3_BS              |
                         No_HH |  -.0011587   .0004822    -2.40   0.016    -.0021039   -.0002136
                      FES_site |   .1364592   .0762755     1.79   0.074    -.0130381    .2859565
              n_SHG_before2017 |   .0123828   .0073136     1.69   0.090    -.0019516    .0267171
               d_public_school |   .2335261   .0996146     2.34   0.019      .038285    .4287672
              d_private_school |   .0751661   .1486878     0.51   0.613    -.2162568    .3665889
                      Shar_Lit |   .0010649   .0055198     0.19   0.847    -.0097537    .0118834
                     Shar_SCST |  -.0053542   .0033952    -1.58   0.115    -.0120087    .0013002
                      sequence |  -.0030425    .003363    -0.90   0.366    -.0096339    .0035489
  -----------------------------+----------------------------------------------------------------
  leader_comp4_BS              |
                         No_HH |   .0011984   .0008606     1.39   0.164    -.0004884    .0028852
                      FES_site |  -.0958808   .1561187    -0.61   0.539     -.401868    .2101063
              n_SHG_before2017 |   .0017136   .0153648     0.11   0.911    -.0284009    .0318282
               d_public_school |   .1302987   .1138606     1.14   0.252     -.092864    .3534613
              d_private_school |   .0316775   .2222321     0.14   0.887    -.4038894    .4672444
                      Shar_Lit |   .0061022   .0078719     0.78   0.438    -.0093264    .0215308
                     Shar_SCST |    .004951   .0032245     1.54   0.125    -.0013689     .011271
                      sequence |   .0023543   .0031492     0.75   0.455     -.003818    .0085266
  -----------------------------+----------------------------------------------------------------
  share_female_percent3_BS     |
               leader_comp2_BS |   .9183725    .724062     1.27   0.205    -.5007629    2.337508
               leader_comp3_BS |   1.069118   .8711123     1.23   0.220     -.638231    2.776466
               leader_comp4_BS |   2.072379   .8144054     2.54   0.011     .4761735    3.668584
                         No_HH |   .0012715   .0031741     0.40   0.689    -.0049496    .0074926
                      FES_site |  -.1982146   .5006864    -0.40   0.692    -1.179542    .7831128
              n_SHG_before2017 |  -.0420908   .0501626    -0.84   0.401    -.1404077    .0562261
               d_public_school |   .4058776   .6143836     0.66   0.509    -.7982921    1.610047
              d_private_school |   .8717545   .5263819     1.66   0.098     -.159935    1.903444
                      Shar_Lit |   .0492982   .0369213     1.34   0.182    -.0230662    .1216626
                     Shar_SCST |   .0051552   .0160532     0.32   0.748    -.0263086     .036619
                      sequence |   .0299248   .0188943     1.58   0.113    -.0071073     .066957
                 total_leaders |  -.3931455   .1768062    -2.22   0.026    -.7396792   -.0466118
  -----------------------------+----------------------------------------------------------------
  survey_maint_rule_FS         |
               leader_comp2_BS |   .1629676   .2014172     0.81   0.418    -.2318027     .557738
               leader_comp3_BS |   .0458362   .3201113     0.14   0.886    -.5815704    .6732429
               leader_comp4_BS |   .2136616   .1862096     1.15   0.251    -.1513026    .5786257
      share_female_percent3_BS |   .1443733    .029364     4.92   0.000     .0868209    .2019257
                         No_HH |  -.0014481   .0007202    -2.01   0.044    -.0028598   -.0000365
                      FES_site |   .2584311   .1374765     1.88   0.060    -.0110178      .52788
              n_SHG_before2017 |   .0321381   .0127125     2.53   0.011     .0072222    .0570541
               d_public_school |   .0961064   .3109402     0.31   0.757    -.5133252    .7055381
              d_private_school |  -.0475914   .1841179    -0.26   0.796     -.408456    .3132731
                      Shar_Lit |   .0041822    .009211     0.45   0.650    -.0138711    .0222355
                     Shar_SCST |  -.0015233   .0041607    -0.37   0.714    -.0096781    .0066314
                      sequence |  -.0019673   .0064729    -0.30   0.761    -.0146541    .0107194
                 total_leaders |   -.031318   .0639736    -0.49   0.624     -.156704     .094068
          survey_maint_rule_BS |  -.0906574   .1804618    -0.50   0.615     -.444356    .2630412
  survey_dam_for_irrigation_FS |  -.2293843   .1161461    -1.97   0.048    -.4570264   -.0017422
  -----------------------------+----------------------------------------------------------------
  survey_maint_2017_FS         |
               leader_comp2_BS |   .0802953   .2071826     0.39   0.698    -.3257751    .4863657
               leader_comp3_BS |   .4467323    .264694     1.69   0.091    -.0720585    .9655231
               leader_comp4_BS |  -.1352076   .1835491    -0.74   0.461    -.4949571     .224542
      share_female_percent3_BS |   .0514905   .0309328     1.66   0.096    -.0091366    .1121176
          survey_maint_rule_FS |   .3586076   .1124936     3.19   0.001     .1381243     .579091
                         No_HH |  -.0002775   .0008314    -0.33   0.739    -.0019071    .0013521
                      FES_site |   .2358298   .1556828     1.51   0.130     -.069303    .5409626
              n_SHG_before2017 |   .0087205   .0151426     0.58   0.565    -.0209584    .0383993
               d_public_school |   3.33e-07   .2291684     0.00   1.000    -.4491615    .4491622
              d_private_school |   .3983306   .1140096     3.49   0.000     .1748758    .6217854
                      Shar_Lit |   .0125112    .007461     1.68   0.094    -.0021121    .0271344
                     Shar_SCST |  -.0038648   .0041509    -0.93   0.352    -.0120005    .0042708
                      sequence |   .0058468   .0052879     1.11   0.269    -.0045173     .016211
                 total_leaders |   -.070338   .0613728    -1.15   0.252    -.1906266    .0499506
          survey_maint_rule_BS |  -.0325104   .0664212    -0.49   0.625    -.1626936    .0976727
  survey_dam_for_irrigation_FS |   .2457247   .1258961     1.95   0.051    -.0010272    .4924765
           survey_maint_12m_BS |  -.0716056   .1293043    -0.55   0.580    -.3250374    .1818263
------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. use "$working_ANALYSIS/processed/games_clean.dta", clear

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. *LOAD DATASET
. use "$working_ANALYSIS/processed/games_clean_final.dta", clear

. winsor2 n_SHG_before2017, cuts(0 95) replace

. winsor2 n_SHG_after2017, cuts(0 95) replace

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. global village No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

. 
. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS $village, vce(robust)

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 7 obs not used

Iteration 0:   log pseudolikelihood = -50.042525  
Iteration 1:   log pseudolikelihood = -41.539119  
Iteration 2:   log pseudolikelihood = -41.483515  
Iteration 3:   log pseudolikelihood = -41.483466  
Iteration 4:   log pseudolikelihood = -41.483466  

Probit regression                               Number of obs     =         75
                                                Wald chi2(8)      =      15.96
                                                Prob > chi2       =     0.0430
Log pseudolikelihood = -41.483466               Pseudo R2         =     0.1710

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .6991084    .336804     2.08   0.038     .0389846    1.359232
 survey_maint_12m_BS |   .7523842   .3447594     2.18   0.029     .0766682      1.4281
               No_HH |   .0001465   .0018553     0.08   0.937    -.0034897    .0037828
            FES_site |   .3094453   .3757401     0.82   0.410    -.4269918    1.045882
    n_SHG_before2017 |   .0131173   .0367295     0.36   0.721    -.0588713    .0851058
     d_public_school |    .504115   .5354357     0.94   0.346    -.5453198     1.55355
    d_private_school |          0  (omitted)
            Shar_Lit |   .0192948   .0212582     0.91   0.364    -.0223706    .0609602
           Shar_SCST |  -.0152178   .0091989    -1.65   0.098    -.0332473    .0028118
               _cons |  -1.131997   1.683319    -0.67   0.501    -4.431241    2.167247
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         75
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS No_HH FES_site n_SHG_before2017 d_public_school d_private_school Shar_Lit Shar_SCST

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .2195898   .0976135     2.25   0.024     .0282709    .4109087
survey_maint_12m_BS |   .2363237   .0959904     2.46   0.014      .048186    .4244614
              No_HH |    .000046   .0005824     0.08   0.937    -.0010955    .0011875
           FES_site |   .0971967   .1158924     0.84   0.402    -.1299483    .3243417
   n_SHG_before2017 |   .0041201   .0115741     0.36   0.722    -.0185647     .026805
    d_public_school |   .1583424   .1647026     0.96   0.336    -.1644688    .4811536
   d_private_school |          0  (omitted)
           Shar_Lit |   .0060605   .0065721     0.92   0.356    -.0068205    .0189415
          Shar_SCST |  -.0047799   .0028002    -1.71   0.088    -.0102682    .0007084
-------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .17103573

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. probit survey_maint_rule_FS treatment survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.295031  
Iteration 2:   log pseudolikelihood = -51.294734  
Iteration 3:   log pseudolikelihood = -51.294734  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       1.29
                                                Prob > chi2       =     0.5238
Log pseudolikelihood = -51.294734               Pseudo R2         =     0.0130

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .086564   .3099871     0.28   0.780    -.5209995    .6941274
 survey_maint_12m_BS |   .3219676   .2907744     1.11   0.268    -.2479398     .891875
               _cons |  -.7304377   .3046826    -2.40   0.017    -1.327605   -.1332708
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .0301018   .1075954     0.28   0.780    -.1807813    .2409848
survey_maint_12m_BS |    .111961   .0989799     1.13   0.258     -.082036    .3059581
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01303908

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -42.407384  
Iteration 2:   log pseudolikelihood = -42.006775  
Iteration 3:   log pseudolikelihood =  -42.00277  
Iteration 4:   log pseudolikelihood = -42.002768  

Probit regression                               Number of obs     =         82
                                                Wald chi2(10)     =      18.41
                                                Prob > chi2       =     0.0484
Log pseudolikelihood = -42.002768               Pseudo R2         =     0.1670

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1358692   .3478525     0.39   0.696    -.5459091    .8176475
         survey_maint_12m_BS |   .2065803   .3225665     0.64   0.522    -.4256384     .838799
survey_dam_for_irrigation_FS |  -.7066839   .3628386    -1.95   0.051    -1.417834    .0044666
                       No_HH |  -.0073556   .0026786    -2.75   0.006    -.0126055   -.0021057
                    FES_site |   .1710006   .3437888     0.50   0.619    -.5028132    .8448144
            n_SHG_before2017 |   .1376803   .0377357     3.65   0.000     .0637197     .211641
             d_public_school |  -.5049903    .568868    -0.89   0.375    -1.619951    .6099705
            d_private_school |  -.3098295   .5190668    -0.60   0.551    -1.327182    .7075228
                    Shar_Lit |   .0118356   .0209212     0.57   0.572    -.0291692    .0528404
                   Shar_SCST |  -.0100494   .0096553    -1.04   0.298    -.0289734    .0088746
                       _cons |    .287608   1.598806     0.18   0.857    -2.845995    3.421211
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school d_private_school
               Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0391758    .099835     0.39   0.695    -.1564972    .2348487
         survey_maint_12m_BS |   .0595642   .0922175     0.65   0.518    -.1211789    .2403073
survey_dam_for_irrigation_FS |  -.2037613   .0967453    -2.11   0.035    -.3933787    -.014144
                       No_HH |  -.0021209   .0007249    -2.93   0.003    -.0035416   -.0007002
                    FES_site |   .0493054   .0986331     0.50   0.617    -.1440119    .2426226
            n_SHG_before2017 |    .039698   .0097973     4.05   0.000     .0204957    .0589003
             d_public_school |  -.1456061   .1626314    -0.90   0.371    -.4643578    .1731456
            d_private_school |  -.0893345   .1499381    -0.60   0.551    -.3832079    .2045388
                    Shar_Lit |   .0034126   .0059871     0.57   0.569     -.008322    .0151472
                   Shar_SCST |  -.0028976   .0027255    -1.06   0.288    -.0082395    .0024444
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .16702757

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-30(20)60,labsize(6pt
> )) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(treatment ) coeflabels(treatment =
>  "Games intervention", labsize(6pt)) gxline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to passive 
> Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbo
> l(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment(top)
>  bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycl
> e plotregion(margin(0 0 0 0)) aspectratio(0.6)
(treatment2: no coefficients found, all dropped, or none kept)
estimation result treatment4 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. probit survey_maint_2017_ treatment survey_maint_12m_, vce(robust)

Iteration 0:   log pseudolikelihood = -54.747551  
Iteration 1:   log pseudolikelihood = -50.686569  
Iteration 2:   log pseudolikelihood = -50.673484  
Iteration 3:   log pseudolikelihood = -50.673483  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       7.48
                                                Prob > chi2       =     0.0238
Log pseudolikelihood = -50.673483               Pseudo R2         =     0.0744

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |   .5640697    .299312     1.88   0.059    -.0225711    1.150711
 survey_maint_12m_BS |    .607976   .2916971     2.08   0.037     .0362601    1.179692
               _cons |   -.303988   .2767365    -1.10   0.272    -.8463815    .2384056
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment1:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .1940987   .0959112     2.02   0.043     .0061162    .3820811
survey_maint_12m_BS |    .209207   .0919223     2.28   0.023     .0290426    .3893714
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .07441553

. 
. probit survey_maint_2017_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

note: d_private_school != 0 predicts success perfectly
      d_private_school dropped and 7 obs not used

Iteration 0:   log pseudolikelihood = -50.042525  
Iteration 1:   log pseudolikelihood =  -41.09178  
Iteration 2:   log pseudolikelihood = -41.033879  
Iteration 3:   log pseudolikelihood =  -41.03383  
Iteration 4:   log pseudolikelihood =  -41.03383  

Probit regression                               Number of obs     =         75
                                                Wald chi2(9)      =      15.98
                                                Prob > chi2       =     0.0674
Log pseudolikelihood =  -41.03383               Pseudo R2         =     0.1800

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_2017_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .6787528   .3386833     2.00   0.045     .0149458     1.34256
         survey_maint_12m_BS |   .6978995   .3488796     2.00   0.045     .0141081    1.381691
survey_dam_for_irrigation_FS |   .3413281   .3590954     0.95   0.342    -.3624859    1.045142
                       No_HH |   .0002504    .001856     0.13   0.893    -.0033873     .003888
                    FES_site |   .3342822   .3745743     0.89   0.372      -.39987    1.068434
            n_SHG_before2017 |   .0078731   .0380404     0.21   0.836    -.0666846    .0824309
             d_public_school |   .6124057   .5461843     1.12   0.262    -.4580959    1.682907
            d_private_school |          0  (omitted)
                    Shar_Lit |   .0158278   .0210575     0.75   0.452    -.0254442    .0570998
                   Shar_SCST |  -.0162335    .009303    -1.74   0.081    -.0344671        .002
                       _cons |  -1.066734   1.689835    -0.63   0.528    -4.378749    2.245281
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment2:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         75
Model VCE    : Robust

Expression   : Pr(survey_maint_2017_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school d_private_school
               Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .2114229   .0982353     2.15   0.031     .0188853    .4039606
         survey_maint_12m_BS |   .2173868   .0984092     2.21   0.027     .0245083    .4102653
survey_dam_for_irrigation_FS |   .1063194   .1088687     0.98   0.329    -.1070593     .319698
                       No_HH |    .000078   .0005778     0.13   0.893    -.0010544    .0012104
                    FES_site |   .1041247   .1138604     0.91   0.360    -.1190376    .3272869
            n_SHG_before2017 |   .0024524   .0118831     0.21   0.836    -.0208381    .0257429
             d_public_school |   .1907566   .1640441     1.16   0.245     -.130764    .5122772
            d_private_school |          0  (omitted)
                    Shar_Lit |   .0049302   .0064647     0.76   0.446    -.0077403    .0176007
                   Shar_SCST |  -.0050565   .0027777    -1.82   0.069    -.0105007    .0003876
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .1800208

. 
. probit survey_maint_rule_FS treatment survey_maint_12m_BS, vce(robust)

Iteration 0:   log pseudolikelihood = -51.972407  
Iteration 1:   log pseudolikelihood = -51.295031  
Iteration 2:   log pseudolikelihood = -51.294734  
Iteration 3:   log pseudolikelihood = -51.294734  

Probit regression                               Number of obs     =         84
                                                Wald chi2(2)      =       1.29
                                                Prob > chi2       =     0.5238
Log pseudolikelihood = -51.294734               Pseudo R2         =     0.0130

--------------------------------------------------------------------------------------
                     |               Robust
survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        treatment_BS |    .086564   .3099871     0.28   0.780    -.5209995    .6941274
 survey_maint_12m_BS |   .3219676   .2907744     1.11   0.268    -.2479398     .891875
               _cons |  -.7304377   .3046826    -2.40   0.017    -1.327605   -.1332708
--------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment3:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         84
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
       treatment_BS |   .0301018   .1075954     0.28   0.780    -.1807813    .2409848
survey_maint_12m_BS |    .111961   .0989799     1.13   0.258     -.082036    .3059581
-------------------------------------------------------------------------------------

. estadd scalar r2_p = `r2_p'

added scalar:
               e(r2_p) =  .01303908

. 
. probit survey_maint_rule_FS treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS $village, vce(robust)

Iteration 0:   log pseudolikelihood =  -50.42516  
Iteration 1:   log pseudolikelihood = -42.407384  
Iteration 2:   log pseudolikelihood = -42.006775  
Iteration 3:   log pseudolikelihood =  -42.00277  
Iteration 4:   log pseudolikelihood = -42.002768  

Probit regression                               Number of obs     =         82
                                                Wald chi2(10)     =      18.41
                                                Prob > chi2       =     0.0484
Log pseudolikelihood = -42.002768               Pseudo R2         =     0.1670

----------------------------------------------------------------------------------------------
                             |               Robust
        survey_maint_rule_FS |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .1358692   .3478525     0.39   0.696    -.5459091    .8176475
         survey_maint_12m_BS |   .2065803   .3225665     0.64   0.522    -.4256384     .838799
survey_dam_for_irrigation_FS |  -.7066839   .3628386    -1.95   0.051    -1.417834    .0044666
                       No_HH |  -.0073556   .0026786    -2.75   0.006    -.0126055   -.0021057
                    FES_site |   .1710006   .3437888     0.50   0.619    -.5028132    .8448144
            n_SHG_before2017 |   .1376803   .0377357     3.65   0.000     .0637197     .211641
             d_public_school |  -.5049903    .568868    -0.89   0.375    -1.619951    .6099705
            d_private_school |  -.3098295   .5190668    -0.60   0.551    -1.327182    .7075228
                    Shar_Lit |   .0118356   .0209212     0.57   0.572    -.0291692    .0528404
                   Shar_SCST |  -.0100494   .0096553    -1.04   0.298    -.0289734    .0088746
                       _cons |    .287608   1.598806     0.18   0.857    -2.845995    3.421211
----------------------------------------------------------------------------------------------

. local r2_p= e(r2_p)

. eststo treatment4:  margins, dydx(*) post

Average marginal effects                        Number of obs     =         82
Model VCE    : Robust

Expression   : Pr(survey_maint_rule_FS), predict()
dy/dx w.r.t. : treatment_BS survey_maint_12m_BS survey_dam_for_irrigation_FS No_HH FES_site n_SHG_before2017 d_public_school d_private_school
               Shar_Lit Shar_SCST

----------------------------------------------------------------------------------------------
                             |            Delta-method
                             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                treatment_BS |   .0391758    .099835     0.39   0.695    -.1564972    .2348487
         survey_maint_12m_BS |   .0595642   .0922175     0.65   0.518    -.1211789    .2403073
survey_dam_for_irrigation_FS |  -.2037613   .0967453    -2.11   0.035    -.3933787    -.014144
                       No_HH |  -.0021209   .0007249    -2.93   0.003    -.0035416   -.0007002
                    FES_site |   .0493054   .0986331     0.50   0.617    -.1440119    .2426226
            n_SHG_before2017 |    .039698   .0097973     4.05   0.000     .0204957    .0589003
             d_public_school |  -.1456061   .1626314    -0.90   0.371    -.4643578    .1731456
            d_private_school |  -.0893345   .1499381    -0.60   0.551    -.3832079    .2045388
                    Shar_Lit |   .0034126   .0059871     0.57   0.569     -.008322    .0151472
                   Shar_SCST |  -.0028976   .0027255    -1.06   0.288    -.0082395    .0024444
----------------------------------------------------------------------------------------------

. estadd scalar r2_p= `r2_p'

added scalar:
               e(r2_p) =  .16702757

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-30(20)60,labsize(6pt
> )) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(treatment ) coeflabels(treatment =
>  "Games intervention", labsize(6pt)) gxline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to passive 
> Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbo
> l(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment(top)
>  bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycl
> e plotregion(margin(0 0 0 0)) aspectratio(0.6)
(treatment2: no coefficients found, all dropped, or none kept)
(treatment4: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-30(20)60,labsize(6pt
> )) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(1.treatment ) coeflabels(treatment
>  = "Games intervention", labsize(6pt)) gxline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to passiv
> e Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msym
> bol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment(to
> p) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecy
> cle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(treatment2: no coefficients found, all dropped, or none kept)
(treatment4: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-30(20)60,labsize(6pt
> )) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatmen
> t = "Games intervention", labsize(6pt)) gxline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to passi
> ve Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msy
> mbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment(t
> op) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norec
> ycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)
option gxline() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-30(20)60,labsize(6pt
> )) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatmen
> t = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to passiv
> e Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msym
> bol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment(to
> p) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecy
> cle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)
(note:  named style medthin not found in class linestyle, default attributes used)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. 
. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-0.4(0.2)0.4,labsize(
> 6pt)) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  keep(treatment_BS ) coeflabels(treat
> ment = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact in %-points relative to pas
> sive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) m
> symbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobox justification(center) alignment
> (top) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") nor
> ecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20"
>  0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  kee
> p(treatment_BS ) coeflabels(treatment = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated i
> mpact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", cond(@
> pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) nobo
> x justification(center) alignment(top) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  recast
> (rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4),bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20"
>  0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Intervention effects", size(10pt)) compact  imargin(*1.2) rows(1) legend(off))  kee
> p(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimate
> d impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", con
> d(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium) n
> obox justification(center) alignment(top) bmargin(top))  xsize(3) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6")  rec
> ast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact  imargin(*1.2) rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact  imargin(*1.2) rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact  imargin(*1.1) rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact  imargin(*1.3) rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact  rows(1) legend(off))  
> keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estim
> ated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pval<.05, "**", 
> cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none) margin(medium
> ) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "140 140 140*0.6
> ")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact imargin(*1.5)  rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games", size(10pt)) compact imargin(*1.5)  rows(1) 
> legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Games intervention", labsize(6pt)) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Re
> gression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005, "***", cond(@pv
> al<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9pt) lstyle(none)
>  margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("140 140 140%80" "1
> 40 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/intervention_effect.gph", replace
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph not found)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph saved)

. gr export "$working_ANALYSIS\results\figures\intervention_effect.png", replace width(3800)
(note: file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png not found)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png written in PNG format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4560_000000.tmp"

. coefplot(treatment2), bylabel(Dam maintenance last 12 months) || (treatment4), bylabel(Rules for dam maintenance) ||,  xla(-0.4 "-40" -0.2 "-20
> " 0 "0" 0.2 "20" 0.4 "40",labsize(6pt)) byopts(title("{bf:A} Effect of experiental learning games intervention", size(10pt)) compact imargin(*1
> .5)  rows(1) legend(off))  keep(treatment_BS ) coeflabels(treatment_BS = "Intervention villages", labsize(6pt)) xline(0, lpattern(dash) lcolor(
> gs3)) xtitle("Regression estimated impact in %-points relative to passive Control ", size(6pt)) grid(none) levels(95 90)mlabel(cond(@pval<.005,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(12) mlabgap(-1.2)  subtitle(, size(9
> pt) lstyle(none) margin(medium) nobox justification(center) alignment(top) bmargin(top))  xsize(3.465) ysize(2) ciopts(lwidth(0.8 2) lcolor("14
> 0 140 140%80" "140 140 140*0.6")  recast(rcap)) mcolor("140 140 140") norecycle plotregion(margin(0 0 0 0)) aspectratio(0.6)
(note:  named style * not found in class gsize, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/intervention_effect.gph", replace
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/results/intermediate/intervention_effect.gph saved)

. gr export "$working_ANALYSIS\results\figures\intervention_effect.png", replace width(3800)
(file D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis\results\figures\intervention_effect.png written in PNG format)

. 
. 
end of do-file

