-------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/logs/2025.05.14-16.54.32.log.txt
  log type:  text
 opened on:  14 May 2025, 16:54:32

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 14 May 2025 16:54:32

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;
> lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace-desktop-r4995g6;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50
> " reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. */
. *--------------------------------------------------
. 
. * Types of leaders present
. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1 
(7,560 observations deleted)

. drop if excluded_villages==1
(56 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
end of do-file

. tab sex

     Sex of |
participant |
          s |
[1=Male,0=F |
     emale] |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        215       27.42       27.42
       Male |        569       72.58      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab sex, nola

     Sex of |
participant |
          s |
[1=Male,0=F |
     emale] |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        215       27.42       27.42
          1 |        569       72.58      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab Shar_SCST

   Share of |
     tribal |
 population |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
   34.62658 |         14        1.79        1.79
   38.77551 |         14        1.79        3.57
   47.88571 |         14        1.79        5.36
   48.45361 |         14        1.79        7.14
   48.98477 |         14        1.79        8.93
       49.5 |         14        1.79       10.71
   53.20388 |         14        1.79       12.50
   54.01388 |         14        1.79       14.29
   55.86035 |         14        1.79       16.07
   56.99708 |         14        1.79       17.86
   59.83607 |         14        1.79       19.64
   64.77762 |         14        1.79       21.43
   66.81351 |         14        1.79       23.21
   67.09957 |         14        1.79       25.00
   69.49153 |         14        1.79       26.79
   70.45455 |         14        1.79       28.57
    71.2297 |         14        1.79       30.36
   71.72012 |         14        1.79       32.14
   74.13534 |         14        1.79       33.93
   74.52514 |         14        1.79       35.71
   76.47059 |         14        1.79       37.50
   77.79479 |         14        1.79       39.29
   78.10651 |         14        1.79       41.07
   78.55918 |         14        1.79       42.86
   79.17261 |         14        1.79       44.64
   79.50311 |         14        1.79       46.43
   80.13582 |         14        1.79       48.21
   81.33803 |         14        1.79       50.00
   81.36882 |         14        1.79       51.79
   81.62651 |         14        1.79       53.57
   82.75862 |         14        1.79       55.36
   83.61702 |         14        1.79       57.14
   83.70672 |         14        1.79       58.93
   83.74718 |         14        1.79       60.71
   84.16667 |         14        1.79       62.50
   86.26198 |         14        1.79       64.29
   88.41379 |         14        1.79       66.07
   89.97514 |         14        1.79       67.86
   90.90909 |         14        1.79       69.64
   91.66667 |         14        1.79       71.43
   92.15686 |         14        1.79       73.21
   93.28767 |         14        1.79       75.00
   93.30144 |         14        1.79       76.79
     93.361 |         14        1.79       78.57
   94.61883 |         14        1.79       80.36
   95.89041 |         14        1.79       82.14
   96.64879 |         14        1.79       83.93
   96.88406 |         14        1.79       85.71
    98.4252 |         14        1.79       87.50
   99.25373 |         14        1.79       89.29
    99.3228 |         14        1.79       91.07
   99.33775 |         14        1.79       92.86
   99.69605 |         14        1.79       94.64
        100 |         42        5.36      100.00
------------+-----------------------------------
      Total |        784      100.00

. sum Shar_SCST

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   Shar_SCST |        784     78.3905    17.30132   34.62658        100

. bys sex: sum Shar_SCST

-------------------------------------------------------------------------------------------------------------------------------------------------
-> sex = Female

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   Shar_SCST |        215    78.58214     17.8469   34.62658        100

-------------------------------------------------------------------------------------------------------------------------------------------------
-> sex = Male

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   Shar_SCST |        569    78.31809     17.1061   34.62658        100


. tab census_caste_fem

    Census: |
      Total |
     female |
  scheduled |
     castes |
 population |
 of village |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        476       60.71       60.71
          1 |         84       10.71       71.43
          2 |         28        3.57       75.00
          4 |         28        3.57       78.57
          5 |         14        1.79       80.36
          6 |         14        1.79       82.14
          8 |         14        1.79       83.93
         15 |         14        1.79       85.71
         24 |         14        1.79       87.50
         26 |         14        1.79       89.29
         40 |         14        1.79       91.07
         55 |         14        1.79       92.86
         93 |         14        1.79       94.64
         98 |         14        1.79       96.43
        191 |         14        1.79       98.21
        313 |         14        1.79      100.00
------------+-----------------------------------
      Total |        784      100.00

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        780    33.23462    10.81078         16         80

. tab illiterate

Participant |
         is |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        749       95.54       95.54
          1 |         35        4.46      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab literacy

   literacy |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         35        4.46        4.46
          1 |        749       95.54      100.00
------------+-----------------------------------
      Total |        784      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. ttest age = 27.1  if sex==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     214    30.21963    .5825456    8.521907    29.07133    31.36792
------------------------------------------------------------------------------
    mean = mean(age)                                              t =   5.3552
Ho: mean = 27.1                                  degrees of freedom =      213

   Ha: mean < 27.1             Ha: mean != 27.1               Ha: mean > 27.1
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest age =  27.43 if sex==1

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     566    34.37456    .4774361    11.35856    33.43679    35.31232
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  14.5455
Ho: mean = 27.43                                 degrees of freedom =      565

  Ha: mean < 27.43             Ha: mean != 27.43             Ha: mean > 27.43
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
end of do-file

. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         16 |          1        0.13        0.13
         17 |          4        0.51        0.64
         18 |         17        2.18        2.82
         19 |         21        2.69        5.51
         20 |         31        3.97        9.49
         21 |         23        2.95       12.44
         22 |         36        4.62       17.05
         23 |         28        3.59       20.64
         24 |         33        4.23       24.87
         25 |         28        3.59       28.46
         26 |         35        4.49       32.95
         27 |         29        3.72       36.67
         28 |         31        3.97       40.64
         29 |         11        1.41       42.05
         30 |         41        5.26       47.31
         31 |         11        1.41       48.72
         32 |         37        4.74       53.46
         33 |         10        1.28       54.74
         34 |          4        0.51       55.26
         35 |         71        9.10       64.36
         36 |         24        3.08       67.44
         37 |          4        0.51       67.95
         38 |         25        3.21       71.15
         39 |          7        0.90       72.05
         40 |         47        6.03       78.08
         41 |          6        0.77       78.85
         42 |         27        3.46       82.31
         43 |          6        0.77       83.08
         44 |          7        0.90       83.97
         45 |         31        3.97       87.95
         46 |          7        0.90       88.85
         47 |          6        0.77       89.62
         48 |          8        1.03       90.64
         49 |          4        0.51       91.15
         50 |         16        2.05       93.21
         51 |          8        1.03       94.23
         52 |          5        0.64       94.87
         53 |          4        0.51       95.38
         54 |          1        0.13       95.51
         55 |          8        1.03       96.54
         57 |          3        0.38       96.92
         58 |          2        0.26       97.18
         60 |          8        1.03       98.21
         61 |          1        0.13       98.33
         62 |          1        0.13       98.46
         63 |          2        0.26       98.72
         65 |          2        0.26       98.97
         66 |          2        0.26       99.23
         68 |          2        0.26       99.49
         69 |          1        0.13       99.62
         70 |          2        0.26       99.87
         80 |          1        0.13      100.00
------------+-----------------------------------
      Total |        780      100.00

. tab sex

     Sex of |
participant |
          s |
[1=Male,0=F |
     emale] |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        215       27.42       27.42
       Male |        569       72.58      100.00
------------+-----------------------------------
      Total |        784      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. ttest literacy = 23.1 if sex==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
literacy |     215    .9488372    .0150614    .2208439    .9191495     .978525
------------------------------------------------------------------------------
    mean = mean(literacy)                                         t = -1.5e+03
Ho: mean = 23.1                                  degrees of freedom =      214

   Ha: mean < 23.1             Ha: mean != 23.1               Ha: mean > 23.1
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest literacy = 32.1 if sex==1

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
literacy |     569    .9578207    .0084337    .2011748    .9412557    .9743858
------------------------------------------------------------------------------
    mean = mean(literacy)                                         t = -3.7e+03
Ho: mean = 32.1                                  degrees of freedom =      568

   Ha: mean < 32.1             Ha: mean != 32.1               Ha: mean > 32.1
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
end of do-file

. tab Shar_Lit

   Share of |
   literate |
 population |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
   35.53299 |         14        1.79        1.79
   36.34312 |         14        1.79        3.57
   36.51926 |         14        1.79        5.36
   37.26708 |         14        1.79        7.14
    37.4031 |         14        1.79        8.93
   37.51724 |         14        1.79       10.71
   40.72165 |         14        1.79       12.50
   41.48936 |         14        1.79       14.29
   42.41922 |         14        1.79       16.07
   42.82297 |         14        1.79       17.86
   43.13725 |         14        1.79       19.64
   43.44023 |         14        1.79       21.43
   43.49315 |         14        1.79       23.21
   45.72464 |         14        1.79       25.00
   46.69604 |         14        1.79       26.79
    47.2103 |         14        1.79       28.57
   47.34848 |         14        1.79       30.36
   47.39726 |         14        1.79       32.14
   47.70798 |         14        1.79       33.93
   48.08126 |         14        1.79       35.71
   48.12834 |         14        1.79       37.50
   48.39961 |         14        1.79       39.29
   49.90291 |         14        1.79       41.07
         50 |         14        1.79       42.86
   50.23474 |         14        1.79       44.64
   50.27933 |         14        1.79       46.43
    51.1811 |         14        1.79       48.21
   52.07469 |         14        1.79       50.00
   52.17391 |         14        1.79       51.79
   52.33083 |         14        1.79       53.57
   52.74949 |         14        1.79       55.36
   53.08311 |         14        1.79       57.14
   53.36323 |         14        1.79       58.93
   53.46084 |         14        1.79       60.71
   53.85935 |         14        1.79       62.50
   54.18251 |         14        1.79       64.29
   54.51807 |         14        1.79       66.07
   54.70085 |         14        1.79       67.86
   55.02152 |         14        1.79       69.64
   55.31915 |         14        1.79       71.43
   55.36723 |         14        1.79       73.21
   56.12245 |         14        1.79       75.00
   56.68571 |         14        1.79       76.79
   56.88801 |         14        1.79       78.57
   57.83582 |         14        1.79       80.36
   58.33333 |         14        1.79       82.14
   58.85057 |         14        1.79       83.93
   59.58466 |         14        1.79       85.71
   60.55684 |         14        1.79       87.50
   61.34663 |         14        1.79       89.29
   61.47186 |         14        1.79       91.07
   65.26316 |         14        1.79       92.86
   65.54364 |         14        1.79       94.64
   67.15976 |         14        1.79       96.43
   68.21429 |         14        1.79       98.21
   69.11977 |         14        1.79      100.00
------------+-----------------------------------
      Total |        784      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. ttest literacy = Shar_Lit

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
literacy |     784    .9553571    .0073804    .2066503    .9408695    .9698448
Shar_Lit |     784    51.27821     .298647    8.362115    50.69197    51.86446
---------+--------------------------------------------------------------------
    diff |     784   -50.32286    .2989489    8.370568   -50.90969   -49.73602
------------------------------------------------------------------------------
     mean(diff) = mean(literacy - Shar_Lit)                       t = -1.7e+02
 Ho: mean(diff) = 0                              degrees of freedom =      783

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
end of do-file

. tab illiterate

Participant |
         is |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        749       95.54       95.54
          1 |         35        4.46      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab Shar_Lit

   Share of |
   literate |
 population |
 in village |      Freq.     Percent        Cum.
------------+-----------------------------------
   35.53299 |         14        1.79        1.79
   36.34312 |         14        1.79        3.57
   36.51926 |         14        1.79        5.36
   37.26708 |         14        1.79        7.14
    37.4031 |         14        1.79        8.93
   37.51724 |         14        1.79       10.71
   40.72165 |         14        1.79       12.50
   41.48936 |         14        1.79       14.29
   42.41922 |         14        1.79       16.07
   42.82297 |         14        1.79       17.86
   43.13725 |         14        1.79       19.64
   43.44023 |         14        1.79       21.43
   43.49315 |         14        1.79       23.21
   45.72464 |         14        1.79       25.00
   46.69604 |         14        1.79       26.79
    47.2103 |         14        1.79       28.57
   47.34848 |         14        1.79       30.36
   47.39726 |         14        1.79       32.14
   47.70798 |         14        1.79       33.93
   48.08126 |         14        1.79       35.71
   48.12834 |         14        1.79       37.50
   48.39961 |         14        1.79       39.29
   49.90291 |         14        1.79       41.07
         50 |         14        1.79       42.86
   50.23474 |         14        1.79       44.64
   50.27933 |         14        1.79       46.43
    51.1811 |         14        1.79       48.21
   52.07469 |         14        1.79       50.00
   52.17391 |         14        1.79       51.79
   52.33083 |         14        1.79       53.57
   52.74949 |         14        1.79       55.36
   53.08311 |         14        1.79       57.14
   53.36323 |         14        1.79       58.93
   53.46084 |         14        1.79       60.71
   53.85935 |         14        1.79       62.50
   54.18251 |         14        1.79       64.29
   54.51807 |         14        1.79       66.07
   54.70085 |         14        1.79       67.86
   55.02152 |         14        1.79       69.64
   55.31915 |         14        1.79       71.43
   55.36723 |         14        1.79       73.21
   56.12245 |         14        1.79       75.00
   56.68571 |         14        1.79       76.79
   56.88801 |         14        1.79       78.57
   57.83582 |         14        1.79       80.36
   58.33333 |         14        1.79       82.14
   58.85057 |         14        1.79       83.93
   59.58466 |         14        1.79       85.71
   60.55684 |         14        1.79       87.50
   61.34663 |         14        1.79       89.29
   61.47186 |         14        1.79       91.07
   65.26316 |         14        1.79       92.86
   65.54364 |         14        1.79       94.64
   67.15976 |         14        1.79       96.43
   68.21429 |         14        1.79       98.21
   69.11977 |         14        1.79      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab share_illiterate_village

   Share of |
participant |
   that are |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        462       58.93       58.93
   .0714286 |        196       25.00       83.93
   .1428571 |         84       10.71       94.64
   .2142857 |         42        5.36      100.00
------------+-----------------------------------
      Total |        784      100.00

. tab edu_fem_illit_vill

     Sum of |
    females |
   that are |
 illiterate |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        672       85.71       85.71
          1 |         70        8.93       94.64
          2 |         42        5.36      100.00
------------+-----------------------------------
      Total |        784      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. 
. cibar age, over1(participant_type)
variable participant_type not found
invalid over() option
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. * Types of leaders present
. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1 
(7,560 observations deleted)

. drop if excluded_villages==1
(56 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. *dummy for female leader presence
. gen female_leader_present= 0 if leader_fem_vill==0
(280 missing values generated)

. replace female_leader_present = 1 if leader_fem_vill>0
(280 real changes made)

. 
. tab female_leader_present male_leader_present
variable male_leader_present not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates most tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> */
. *--------------------------------------------------
. 
. * Types of leaders present
. clear all

. use "$working_ANALYSIS/data/2022_06_Mandla_Game.dta", clear

. sort site_ID round

. drop if round!=1 
(7,560 observations deleted)

. drop if excluded_villages==1
(56 observations deleted)

. 
. egen dam_contribution = rowmax (cont_lab  cont_money)

. 
. 
. *leader composition in games
. *dummy for male leader presence
. gen male_leader_present = 0 if leader_male_vill==0
(490 missing values generated)

. replace male_leader_present = 1 if leader_male_vill>0
(490 real changes made)

. 
. 
. *dummy for female leader presence
. gen female_leader_present= 0 if leader_fem_vill==0
(280 missing values generated)

. replace female_leader_present = 1 if leader_fem_vill>0
(280 real changes made)

. 
. tab female_leader_present male_leader_present

female_lea |
der_presen |  male_leader_present
         t |         0          1 |     Total
-----------+----------------------+----------
         0 |       126        378 |       504 
         1 |       168        112 |       280 
-----------+----------------------+----------
     Total |       294        490 |       784 

. 
. *composition of leader presence
. gen leader_present = 0 if male_leader_present==0 & female_leader_present==0
(658 missing values generated)

. replace leader_present = 1 if male_leader_present == 1 & female_leader_present==0
(378 real changes made)

. replace leader_present = 2 if male_leader_present == 1 & female_leader_present==1
(112 real changes made)

. replace leader_present = 3 if male_leader_present == 0 & female_leader_present==1
(168 real changes made)

. 
. lab def leader_lab 0 "None" 1 "Only Male" 2 "Both" 3 "Only Female", replace

. lab val leader_present leader_lab

. tab leader_present, gen(leader_comp)

leader_pres |
        ent |      Freq.     Percent        Cum.
------------+-----------------------------------
       None |        126       16.07       16.07
  Only Male |        378       48.21       64.29
       Both |        112       14.29       78.57
Only Female |        168       21.43      100.00
------------+-----------------------------------
      Total |        784      100.00

. 
. gen participant_type = 1 if leader_fem==0
(718 missing values generated)

. replace participant_type = 2 if leader_fem==1
(23 real changes made)

. replace participant_type = 3 if leader_type==1 & sex==1
(503 real changes made)

. replace participant_type = 4 if leader_type==1 & sex==0
(192 real changes made)

. lab def party 1 "Male leader" 2 "Female leader" 3 "Male villager" 4 "Female villager", replace

. lab val participant_type party

. 
. 
. *do our participants differ from average Madhya Pradesh population?
. * averages taken from 2011 census data 
. ttest age = 27.1  if sex==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     214    30.21963    .5825456    8.521907    29.07133    31.36792
------------------------------------------------------------------------------
    mean = mean(age)                                              t =   5.3552
Ho: mean = 27.1                                  degrees of freedom =      213

   Ha: mean < 27.1             Ha: mean != 27.1               Ha: mean > 27.1
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest age =  27.43 if sex==1

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     age |     566    34.37456    .4774361    11.35856    33.43679    35.31232
------------------------------------------------------------------------------
    mean = mean(age)                                              t =  14.5455
Ho: mean = 27.43                                 degrees of freedom =      565

  Ha: mean < 27.43             Ha: mean != 27.43             Ha: mean > 27.43
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. * sample signficantly older, but we also required participants to be atlest 18 years older
. ttest literacy = 23.1 if sex==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
literacy |     215    .9488372    .0150614    .2208439    .9191495     .978525
------------------------------------------------------------------------------
    mean = mean(literacy)                                         t = -1.5e+03
Ho: mean = 23.1                                  degrees of freedom =      214

   Ha: mean < 23.1             Ha: mean != 23.1               Ha: mean > 23.1
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest literacy = 32.1 if sex==1

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
literacy |     569    .9578207    .0084337    .2011748    .9412557    .9743858
------------------------------------------------------------------------------
    mean = mean(literacy)                                         t = -3.7e+03
Ho: mean = 32.1                                  degrees of freedom =      568

   Ha: mean < 32.1             Ha: mean != 32.1               Ha: mean > 32.1
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. * significantly higher, as 95% of our participants were literate
. 
. cibar age, over1(participant_type)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD4b78_000000.tmp"

. *--------------------------------------------------
. * Set global Working Directory
. *--------------------------------------------------
. * Define this global macro to point where the replication folder is saved locally that includes this run.do script
. global working_ANALYSIS "D:\OneDrive\Promotion\1_Projects\Games for Sustainability\analysis"

. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. * Initialize log and record system parameters
. clear

. set more off

. cap mkdir "$working_ANALYSIS/scripts/logs"

. cap log close
